{"title":"24 Hour Party People (NTSC, Untouched .iso)","uid":7842616,"size":7800760379,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:00ca367b277e213df4738dbafa9badd0747f803e&amp;dn=24+Hour+Party+People+%28NTSC%2C+Untouched+.iso%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MrShite","files":2,"time":1353381278,"description":"PLEASE SEED FULLY SO THAT THE TORRENT SURVIVES!!!\nAnd if you like this torrent, you can find the soundtrack or the rest of my torrents at:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/MrShite/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MrShite/&lt;/a&gt;\n\n**********\n\n24 Hour Party People is a 2002 British film about Manchester's popular music community from 1976 to 1992, and specifically about Factory Records. It was written by Frank Cottrell Boyce and directed by Michael Winterbottom. The film was entered into the 2002 Cannes Film Festival. It was met with very enthusiastic reviews and currently holds a metacritic score of 85/100. Respected movie critic Roger Ebert gave it four out of four.\n\nIt begins with the punk rock era, and moves through the 1980s into the &quot;Madchester&quot; scene of the late 1980s and early 1990s. The main character is Tony Wilson (played by Steve Coogan), a news reporter for Granada Television and the head of Factory Records, and the narrative largely follows his career, while also covering the major Factory artists, especially Joy Division and New Order, A Certain Ratio, The Durutti Column, and the Happy Mondays.\n\nThe film is a dramatisation based on a combination of real events, rumours, urban legends, and the imaginings of the scriptwriter - as the film makes clear. In one scene, one-time Buzzcocks member Howard Devoto, played by Martin Hancock, is shown having sex with Wilson's first wife in the toilets of a club; the real Devoto, an extra in the scene, turns to the camera and says &quot;I definitely don't remember this happening&quot;. The fourth wall is frequently broken, with Wilson (who also acts as the narrator) frequently commenting on events directly to camera as they occur, at one point declaring that he is &quot;being postmodern, before it's fashionable&quot;. The actors are often intercut with real contemporary concert footage, including the Sex Pistols gig at the Lesser Free Trade Hall.","torrent":{"xt":"urn:btih:00ca367b277e213df4738dbafa9badd0747f803e","amp;dn":"24+Hour+Party+People+%28NTSC%2C+Untouched+.iso%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ca367b277e213df4738dbafa9badd0747f803e","infoHashBuffer":{"type":"Buffer","data":[0,202,54,123,39,126,33,61,244,115,141,186,250,155,173,208,116,127,128,62]},"announce":[],"urlList":[]}}