{"title":"[HorribleSubs] One Piece - 575 [360p]","uid":7878633,"size":239677270,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:00e014c5d539b2ec809c50be78debedc89e64a6c&amp;dn=%5BHorribleSubs%5D+One+Piece+-+575+%5B360p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xhizors","files":1,"time":1354422698,"description":"\n                     [HorribleSubs] One Piece - 575 [360p] MKV                     \n\n\nEpisode 575\n\nSeries Information:\n\n Gol D. Roger was known as the Pirate King, the strongest and most infamous being to have sailed the Grand Line. The capture and death of Roger by the World Government brought a change throughout the world. His last words before his death revealed the location of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece (which promises an unlimited amount of riches and fame), and quite possibly the most coveted of titles for the person who found it, the title of the Pirate King.\n\n Enter Monkey D. Luffy, a 17-year-old boy that defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate who ransacks villages for fun, Luffy's reason for being a pirate is one of pure wonder; the thought of an exciting adventure and meeting new and intriguing people, along with finding One Piece, are his reasons of becoming a pirate. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach One Piece.\n","torrent":{"xt":"urn:btih:00e014c5d539b2ec809c50be78debedc89e64a6c","amp;dn":"%5BHorribleSubs%5D+One+Piece+-+575+%5B360p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e014c5d539b2ec809c50be78debedc89e64a6c","infoHashBuffer":{"type":"Buffer","data":[0,224,20,197,213,57,178,236,128,156,80,190,120,222,190,220,137,230,74,108]},"announce":[],"urlList":[]}}