{"title":"Femdom Ass Worship 18 x264-PORNOLATiON","uid":7861685,"size":1845122764,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0160888ba392b6e9ac439e25d4e5ed4b0460a4e4&amp;dn=Femdom+Ass+Worship+18+x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1353948240,"description":"Category Fetish Movies, Smothering, Evil Angel's Femdom Ass Worship Series \n  \nDirector Glenn King \n\nStarring Alexis Texas, Kyle Stone, Annikka Albrite, Cindy Starfall, Jeremy Conway, Kelli Staxxx, Eric Jover \n\n\nFemdom Ass Worship # 18 porn For guys who truly know their place, females are superior to men in every aspect. Femdom Ass Worship # 18 DVD video And a truly dominant woman enjoys showing a simpering male exactly how worthless he is! Fetish director Glenn King's MeanBitch Productions brings another seductively cruel showcase of feminine supremacy, 'FemDom Ass Worship 18,' in which haughty ass queens crush their victims with powerful buttocks and verbal degradation. Each of four scenes is preceded by a POV-style solo segment in which the evil lady issues chilling threats and wicked abuse to you the hapless viewer. Blonde, ass-blessed knockout Alexis Texas makes a stunning dominatrix. She breaks in her helpless slave, making him tongue her asshole and stepping on his face in her vicious high heels. Her incredible hams flatten pathetic Jeremy Conway's head and she makes him suck her fragrant toes. \n\nAsian beauty Cindy Starfall is the office bully, making poor executive Kyle Stone's life hell. The bratty boss lady steps up the workplace harassment, turning the underling into her personal play toy in a ruthless campaign of bare foot worship and face sitting. Bombshell Anikka Albrite robs wimpy bartender Eric Jover at gunpoint, then adds insult to theft with a full-on ass assault that leaves him gasping for air. Finally, super-busty Kelli Staxxx torments her landlord; the curvaceous bitch orders him to pleasure her enormous, fleshy behind and grovel beneath her fishnet-clad feet. For the heartless ladies of 'FemDom Ass Worship 18,' there's no mercy rule! \n\n\nDuration                                 : 3h 4mn\nBit rate                                 : 1 209 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 404 pixels\n\n\n\n\n\n &lt;a href=&quot;\nhttp://tippic.eu/?v=postertwt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tippic.eu/?v=postertwt.jpg&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://tippic.eu/?v=plfaw18mp4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tippic.eu/?v=plfaw18mp4.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0160888ba392b6e9ac439e25d4e5ed4b0460a4e4","amp;dn":"Femdom+Ass+Worship+18+x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0160888ba392b6e9ac439e25d4e5ed4b0460a4e4","infoHashBuffer":{"type":"Buffer","data":[1,96,136,139,163,146,182,233,172,67,158,37,212,229,237,75,4,96,164,228]},"announce":[],"urlList":[]}}