{"title":"The Host (2013) - HD Bluray Rip X264 English - AC3 Audio","uid":8676240,"size":3186263574,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:01f0560e4b2dc36f7fb6c2869b680d739be9818e&amp;dn=The+Host+%282013%29+-+HD+Bluray+Rip+X264+English+-+AC3+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KidAtomic","files":1,"time":1373600793,"description":"What if everything you love was taken from you in the blink of an eye? When an unseen enemy threatens mankind by taking over their bodies and erasing their memories, Melanie Stryder will risk everything to protect the people she cares most about - Jared, Ian, her brother Jamie and her Uncle Jeb, proving that love can conquer all in a dangerous new world\n\nThe Host is a 2013 American romantic science fiction film adapted from Stephenie Meyer's novel of the same name. Written and directed by Andrew Niccol, the film stars Saoirse Ronan, Max Irons, Jake Abel, William Hurt, and Diane Kruger. Released on March 29, 2013, the film has been generally panned by critics, and has performed modestly in box office sales.\n\n***SPOILER ALERT***\nIn the future, the human race has been assimilated by extraterrestrial psychic parasites called &quot;Souls&quot;. Melanie Stryder, a human, is captured by the Seeker (Diane Kruger) and infused with a soul called &quot;Wanderer&quot;, in order to discover the location of one of the last pockets of non-assimilated humans. However, Melanie survives the procedure and begins to struggle for control of her body.\n\nWanderer discovers that Melanie was captured while scavenging for food with her brother Jamie and her boyfriend Jared Howe, and that they were looking for Melanie's uncle Jeb, who lives in a cabin in the desert. Wanderer loses control of Melanie and the Seeker decides to be inserted into Melanie to get the information herself. With the help of Melanie, Wanderer escapes and makes her way to the desert, eventually found by a group of humans, including Jeb. She is taken to a series of underground caves, discovering that Jared and Jamie are living there too.\n\nWanderer is kept isolated from the others, who are hostile towards her because she is seen as another alien, and a potential threat. Eventually, she begins interacting with the humans, who start to slowly trust her, and develops feelings for one of them, Ian O'Shea, all the while beginning to believe the Souls shouldn't steal other people's free will. Although Melanie had instructed Wanderer not to tell anyone she is still alive, the survivors learn the truth from Jamie (the only person she was allowed to tell). Meanwhile, The Seeker learns that the community is located somewhere in the desert and follows Wanderer there, but fails to locate them. After nearly being captured by the Seeker, Ian's brother Kyle attempts to kill Wanderer, but is stopped by Ian and another human, Wes, after which Jared also learns that Melanie is still alive.\n\nWanderer is horrified to learn that Doc, the community's medic, has been experimenting on people infused with Souls, removing the Souls from their bodies and killing them, and isolates herself from the group, but agrees to help Jared infiltrate a Soul medical facility to steal technology to cure the ill Jamie. In the process, they are attacked by the Seeker, who is then shot and captured by Jeb. The Seeker is taken to the caves, where she is removed from her host and contained in a pod stolen by Wanderer, who then sends the Seeker to a distant planet.\n\nWanderer teaches Doc how to remove the Souls from people's bodies without harming them, and asks to be removed from Melanie's so Melanie can have her life back. Melanie protests, having bonded with Wanderer, but Doc goes through with the procedure. However, rather than letting Wanderer die, Doc inserts her into Pet (Emily Browning), a human who was left brain-dead after the Soul inside her was removed, thereby ensuring that Wanderer can live without harming another soul. Wanderer, now in Pet's body, begins a relationship with Ian, while Melanie reunites with Jared. A few months later, Wanderer and the others meet another group of humans who have been joined by Souls who have decided to live peacefully among them.\n\nStarring:\nSaoirse Ronan\nJake Abel\nMax Irons\nFrances Fisher\nChandler Canterbury\nDiane Kruger\nWilliam Hurt","torrent":{"xt":"urn:btih:01f0560e4b2dc36f7fb6c2869b680d739be9818e","amp;dn":"The+Host+%282013%29+-+HD+Bluray+Rip+X264+English+-+AC3+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01f0560e4b2dc36f7fb6c2869b680d739be9818e","infoHashBuffer":{"type":"Buffer","data":[1,240,86,14,75,45,195,111,127,182,194,134,155,104,13,115,155,233,129,142]},"announce":[],"urlList":[]}}