{"title":"[Femaleagent / Casting XXX] Ondinne","uid":8589925,"size":455002855,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:049d06a4d69812044d131e2bfdce39dcd02236d3&amp;dn=%5BFemaleagent+%2F+Casting+XXX%5D+Ondinne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1371612775,"description":"[Femaleagent / Casting XXX] Ondinne\n\nOndinne (36 mins). As soon as Ondinne walked into my office I asked her how old she was. She is an incredibly pretty girl and looked far too young to be coming for a casting. She told me she was 19 but I checked her documents anyway to make sure she was not lying. Quite a shy girl she had come to me to become a fashion model, shy but not modest, she knew she was a stunning looking girl. I had to see what this girls body looked like so I asked her if she'd though about nude modelling. I ran through my usual lines from here and finished with the fact that she was too small to be a fashion model she would be perfect for but nude modelling. She was not too keen at first but money is an important factor to all these young women and once I plucked an amount she would get paid out of the air, her eyes lit up like Vegas. I needed to bring her down a peg or two so I told her to remove her coat as she looked a little fat. I slowly stripped her using the power of persuasion. Her tits were magnificent, I envy the youth and their gorgeous bodies. To cut a long story short, it took all my powers of persuasion to get her to do some masturbation for me and then I could feel her heat as she got turned on. After her orgasm I made her fuck me with her mouth. She was quite inexperienced and needed some coaching but it was all worth it to see that pretty face covered in my juices. Sometimes I like the inexperienced as it gives me a great sense of power over them and domination is a big part of the kick I get out of this.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=1tck9kfs8tjktfkhbjsj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=1tck9kfs8tjktfkhbjsj.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:049d06a4d69812044d131e2bfdce39dcd02236d3","amp;dn":"%5BFemaleagent+%2F+Casting+XXX%5D+Ondinne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"049d06a4d69812044d131e2bfdce39dcd02236d3","infoHashBuffer":{"type":"Buffer","data":[4,157,6,164,214,152,18,4,77,19,30,43,253,206,57,220,208,34,54,211]},"announce":[],"urlList":[]}}