{"title":"Stardock Start8 v1.03 for Windows 8","uid":7831882,"size":5178233,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:07343c7094577d8c48992e30b835963344a5e8b7&amp;dn=Stardock+Start8+v1.03+for+Windows+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1353075475,"description":"Changes in Start8 v1.03\nNew Desktop page in config UI\nNew options to control which taskbar the start button appears on\nNew UI option to control if the bottom left hand corner hotspot functions\nWhen disable all hot corners is disabled you can now select icons etc on the top 4 pixels\nNew UI option to hide Windows 8 Modern UI applications from the Windows 7 start menu\nNew UI option to use ctrl + winkey as an alternative for right winkey\nNew UI option to use shift + winkey as an alternative for right winkey\nNew UI button to recreate the pinned shortcut to the Windows 8 start menu if deleted\nNew option to toggle if the user picture should be visible or not\nHighlighted folders lose their highlight once opened if they have no highlighted child items\nFonts rendering with the default theme with translucency disabled uses full cleartype now vs greyscale cleartype\nShutdown button and all programs button now have text for screen readers\nPressing enter on a jumplist shortcut now launches the jumplist item vs the application\nSearch items now have Open File Location menu item\nKeyboard context menu button now opens the right click menus\nYou can now drag a shortcut to the start button (which opens the menu) and then onto the menu in order to pin something. For now it will add to the bottom of the pinned list. Once added you can rearrange it by dragging it to the location you want.\nItems on the right hand list can be dragged onto the left side of the startmenu to pin them, or off onto other applications such as explorer windows and the desktop to create shortcuts. Jump list items can be dragged off the startmenu and into appli\nItems on the right hand list now have Show on desktop option in their right click menus.\ncations or explorer windows.\nMost search result items can be dragged off the startmenu and into applications or explorer windows.\nTree items can be dragged out of the all programs tree and into explorer windows etc. They cannot be rearranged in 1.03, but this is planned for the next update.\nv1.01 deadlock fix fully implemented as there was a bit missing in the previous version.\nEmpty folders in the all programs tree now have an (Empty) child to avoid confusion.\nBlank lines in the Modern UI applications list no longer occur when you pin IE shortcuts to the Modern UI start menu.\nAll programs now looks at the Start menu folder rather than Start menuPrograms to ensure applications which install outside the normal folder tree are not missed.\nStart button hot corner when in the Modern UI start menu will go to the desktop rather than opening Start8.\nStart button hot corner when at the desktop and accessed via the left hand switcher no longer misses clicks at the bottom left.\nFake tile shortcuts added to the Modern UI start menu will not show in the Start8 menu.\nRegistry option to disable Pin to Start8 startmenu also now disables the menu in explorer windows.\nHovering over the all programs button and then typing in the search field will no longer confuses Start8.\nAdded option to search locations other than the default libraries to the UI.\nAdded option to make holding down winkey for more than half a second simulate a right windows key press.\nAdded new theme based on default theme but with black edges\nModified Windows 7 theme to pickup defined colours\nAdded new theme option for Windows 7 solid (non DWM style)\nModification to trial code to handle a situation where the trial would not start properly on some setups.\nHolding down ctrl when clicking on Shutdown, Reboot or Sign out will add the force flags.\nHolding down shift when clicking Shutdown will force a full shutdown vs Fast Startup shutdown.\n\nHomepage:: http://www.stardock.com/products/start8/","torrent":{"xt":"urn:btih:07343c7094577d8c48992e30b835963344a5e8b7","amp;dn":"Stardock+Start8+v1.03+for+Windows+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07343c7094577d8c48992e30b835963344a5e8b7","infoHashBuffer":{"type":"Buffer","data":[7,52,60,112,148,87,125,140,72,153,46,48,184,53,150,51,68,165,232,183]},"announce":[],"urlList":[]}}