{"title":"20121115-Stossel-[Four More Years].Fox Business.CF.avi","uid":7833565,"size":285246092,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:089fd83437976c8297173f876d77b5c461496ae1&amp;dn=20121115-Stossel-%5BFour+More+Years%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1353137490,"description":"----------\n\nSTOSSEL - [Four More Years] - Fox Business Network\n2012, November 15, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nI peer into my crystal ball on this week's show to predict what President Obama's next term will bring.\n\nThe media says we must obsess about a fiscal cliff! But Congressman Ron Paul says, &quot;So what?&quot; The cliff is trivial compared to America's unsustainable debt. Economist Russ Roberts agrees. Contrary to what most politicians say, sequestration cuts wouldn't be so bad. Even a defense budget reduction wouldn't put us in danger, according to Benjamin Friedman of the CATO Institute.\n\nMore regulations! The economy has grown slowly under the weight of thousands of pages of rules added by the Bush and Obama administrations. Entrepreneur Bob Luddy and the former Lt. Governor of New York, Betsy McCaughey, explain how the rules kill economic growth.\n\nA Supreme Court upheaval! With four justices over the age of 70, how many replacements will President Obama nominate? Who he appoints will serve for as long as 40 years. Fox News judicial analyst, Judge Andrew Napolitano, speculates what that would mean for freedom.\n\nMarijuana crackdown! The citizens of Colorado and Washington voted to legalize pot, but if the feds treat state legalization the same way they have these past 4 years, more people will be jailed for doing something the President admits he did himself. Reason TV's Nick Gillespie and Theodore Dalrymple of the Manhattan Institute disagree about the war on drugs.\n\nMore &quot;green jobs&quot;! The President wants what he calls clean energy, but the CATO Institute's Jerry Taylor explains that Obama, and most people, are clueless. He explodes myth after myth.","torrent":{"xt":"urn:btih:089fd83437976c8297173f876d77b5c461496ae1","amp;dn":"20121115-Stossel-%5BFour+More+Years%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089fd83437976c8297173f876d77b5c461496ae1","infoHashBuffer":{"type":"Buffer","data":[8,159,216,52,55,151,108,130,151,23,63,135,109,119,181,196,97,73,106,225]},"announce":[],"urlList":[]}}