{"title":"Anal.Casting.Calls.2.DiSC1.XXX.DVDRip.x264-CHiKANi","uid":8566395,"size":2084373386,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:08de232b4cffac84aa3f8b8b8fb7b7ae6e141f2e&amp;dn=Anal.Casting.Calls.2.DiSC1.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":3,"time":1371031793,"description":"100% Anal Action! POV+!\n\n Ass baron Mike Adriano is one extremely picky porn director when it comes to selecting girls for his nasty videos. Mike's ladies have to be both gorgeous and eager to perform the most twisted acts of rectal perversion. In the deluxe, two-disc he has assembled a stunning array of rookie sluts and fresh-faced initiates for the explicit buggery, rim jobs, ass-to-mouth cocksucking, slobbery deep-throat blow jobs and insane anal gapes/graphic prolapse his devoted fans demand. Everyone gets hired! A trio of sweet, blonde young 'uns - Sierra Day, Chastity Lynn and Penny Pax - lap at each other's tender sphincter before enjoying colonic distention, huge dick worship and a creamy cum facial!\n\n Exquisite brunette beauty Natalie Moore is a naturally stacked princess who uses her tight asshole and talented mouth to please her prospective employer. Sexy and demure redhead Sasha Casey eats Mike's asshole with vigor; she gets her bunghole well stretched and slurps his semen from a large spoon. Cute whore Proxy Paige and her sultry, head-shaved partner, Sparky Sin Claire, team up for a sick prolapse party. Slender and submissive Alana Rains gets completely impaled of Mike's raging boner. There's even a lewd May-December bonus scene featuring pretty Summer Rae and hairy older gentleman Claudio. An intimate view of one director's backdoor evaluation process, Mike Adriano delivers tomorrow's colonic superstars today!\n\n\nChastity Lynn, Penny Pax, Proxy Paige, Sparky Sin Claire, Sierra Day, Sasha Casey\n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=analcastin.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=analcastin.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=analcavev.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=analcavev.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:08de232b4cffac84aa3f8b8b8fb7b7ae6e141f2e","amp;dn":"Anal.Casting.Calls.2.DiSC1.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08de232b4cffac84aa3f8b8b8fb7b7ae6e141f2e","infoHashBuffer":{"type":"Buffer","data":[8,222,35,43,76,255,172,132,170,63,139,139,143,183,183,174,110,20,31,46]},"announce":[],"urlList":[]}}