{"title":"Buttmans Stretch Class 14  ","uid":7817174,"size":1464391680,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:09590c2cc5a7ce3bae097f9141eaaf59d1ff99ea&amp;dn=Buttmans+Stretch+Class+14++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":-1,"time":1352709705,"description":"Year: 2012\nGenre: Anal, Gonzo, POV, Masturbation, Hardcore\nDuration: 1:41:40 1:38:15\nDirected by: John Stagliano\nStudio: Evil Angel Video\n\nStarring: Anikka Albrite, Jessie Rogers, John Stagliano, Melody Jordan\n\nDescription: Porn pioneer John? Buttman? Stagliano trains young ladies to expand their bodies, orifices and sexy, young minds in his? Stretch Class? series. He exposes three gorgeous aspiring starlets to a regimen of teasing, anal presentation, posing, toys and machine-powered masturbation in the new? Buttman? S Stretch Class 14.? The instructor uses these intimate encounters to explore every bump and cranny of the female form, with sensuous SM kink and an intensive program of girl-worship and orgasm facilitation. Super-cute Anikka Albrite shows up to class with her perky, natural tits poking out of a fishnet top. The talented sweetheart arches her back and smothers the director with her amazing, plump booty. Anikka stretches her nipples on Buttman? S medieval-style breast rack; invades her butthole with various phallic toys; torments her pussy lips using weighted clamps; and deep-throats rubber dildos until she drools. Stunning redhead Melody Jordan has an exquisite body with a phat, cushiony rump and perfect, small boobs. Buttman has the leggy beauty do sexy calisthenics and show off her adorably expressive feet. Brazilian Barbie doll Jessie Rogers brings us her shapely ass clad in a pair of sheer-to-waist lacy pantyhose. The lovely blonde spreads her sphincter wide using thick glass butt plugs and even impales that rosebud on the director? S infamous garden gnome! As a reward for her obedience, each of these sweet students gets to make herself climax using big vibrators and giant, rectum-widening dildos. With? Buttman? S Stretch Class 14? adventurous girls discover the true power of education!\n\n\n\nVideo quality: DVDRip\nVideo format: AVI\nVideo: Xvid 624x352 29.97fps 918kbps\nAudio: MPEG Audio Layer 3 48000Hz stereo 125kbps\n &lt;a href=&quot;\nhttp://imgload.me/img-50a0a80b0e14b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50a0a80b0e14b.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://imgload.me/img-50a0a80b27b1d.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50a0a80b27b1d.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:09590c2cc5a7ce3bae097f9141eaaf59d1ff99ea","amp;dn":"Buttmans+Stretch+Class+14++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09590c2cc5a7ce3bae097f9141eaaf59d1ff99ea","infoHashBuffer":{"type":"Buffer","data":[9,89,12,44,197,167,206,59,174,9,127,145,65,234,175,89,209,255,153,234]},"announce":[],"urlList":[]}}