{"title":"Der Stoff, aus dem der Kosmos ist (Brian Greene)","uid":7855925,"size":2202842220,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b90396ac7fde4cf64a6af4d2fbbbc86dd959bb9&amp;dn=Der+Stoff%2C+aus+dem+der+Kosmos+ist+%28Brian+Greene%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PirateerG","files":-1,"time":1353716877,"description":"Der Stoff, aus dem der Kosmos ist (Brian Greene)\n\nDie vierteilige Dokumentationsreihe &quot;Der Stoff, aus dem der Kosmos ist&quot; basiert auf dem gleichnamigen Bestseller des Physikers Brian Greene. Leicht verstaendliche Erlaeuterungen und hochmoderne Computergrafiken veranschaulichen provokative Theorien, Experimente und Geschichten. Greene zeigt, warum ein leerer Raum eigentlich voll ist, was Zeit wirklich bedeutet, warum es sehr wohl andere Universen geben kann und dass neben unserer Welt eine verborgene Parallelwelt existiert, die vollstaendig anderen Gesetzmaessigkeiten unterliegt.\n\nTeil 1: Die Illusion der Zeit\n\nDie Menschen verschwenden sie, sparen sie, schlagen sie tot und schaufeln sie sich frei - die Zeit ist ein wesentlicher Faktor im Leben eines jeden. Doch Physiker haben auf die Frage, was Zeit eigentlich ist, eine ueberraschende Antwort. Sie haben naemlich nicht die geringste Ahnung. Und was noch ueberraschender ist: Das dem Menschen innewohnende Gefuehl der verstreichenden Zeit koennte nichts anderes als eine Sinnestaeuschung sein.\n\n\nTeil 2: Was ist Raum?\n\nDer Raum trennt Menschen voneinander, eine Galaxie von der naechsten, ein Atom vom anderen. Es gibt ihn im gesamten Universum. Doch fuer die meisten Menschen ist Raum gar nicht vorhanden, ein leeres Etwas. Vom Beifahrersitz eines New Yorker Taxis aus, das mit annaehernd Lichtgeschwindigkeit zu einer Billardhalle saust, in der mit den Billardtischen unglaubliche Dinge passieren, erlaeutert der Physiker Brian Greene Raum als ein dynamisches Gewebe, das sich unter dem Einfluss der Schwerkraft dehnt, verdreht, kruemmt und kraeuselt.\nNoch befremdlicher ist eine neu entdeckte Raumkomponente, aus der 70 Prozent des Universums bestehen. Physiker nennen sie dunkle Energie, weil sie sich zwar ihrer Existenz sicher sind und wissen, dass sie dafuer sorgt, dass sich der Raum noch schneller ausdehnt. Aber sie haben keine Ahnung, aus was sie besteht. Waehrend also auf der Erde der Raum im kleinsten Massstab erforscht wird und dabei immer wieder neue Fragen auftauchen, vollziehen sich im grossen Rahmen des Universums Dinge, die die Physiker bislang kaum verstehen.\n\n\nTeil 3: Der Quantensprung\n\nWie kaum jemand anderem gelingt es Brian Green, die Quantenphysik anschaulich zu machen, zu erklaeren, wie Gegenstaende unvermittelt auftauchen oder verschwinden und wie Dinge an einem Ort Dinge an einem ganz anderen Ort unmittelbar beeinflussen koennen - ohne dass die Distanz zwischen ihnen in irgendeiner Weise ueberbrueckt wuerde.\nAls vor circa 100 Jahren die Quantenphysik noch in den Kinderschuhen steckte, zogen die hellsten Koepfe ihrer Zeit - darunter auch Albert Einstein und Niels Bohr - in einen Kampf um die Seele der Physik. Auch sie fragten sich, wie sich die Regeln der Quantenwelt, die so wunderbar zur Beschreibung des Verhaltens einzelner Atome und ihrer Bestandteile geeignet sind, so grundlegend von den alltaeglichen Regeln unterscheiden koennen, denen Menschen, Planeten und Galaxien unterliegen. Doch dank ihrer Vorhersagen mit einer nachweislichen statistischen Fehlerwahrscheinlichkeit von weniger als eins zu einer Milliarde ist die Quantentheorie eine der erfolgreichsten Theorien in der Geschichte der Wissenschaft, mag sie sich dem intuitiven Verstaendnis des Menschen auch entziehen.\n\nTeil 4: Universum oder Multiversum?\n\nJuengste Theorien gehen davon aus, dass unser Universum nicht das einzig existierende ist. Stattdessen koennte es nur eine von unendlich vielen Welten sein, aus denen sich das Multiversum zusammensetzt. Der Physiker und Moderator Brian Greene geht auf Entdeckungstour durch diese neue Theorie an den Grenzen der Physik, erklaert, warum die Wissenschaftler von ihrer Richtigkeit ueberzeugt sind, und zeigt, wie einige dieser anderen Realitaeten aussehen koennten.\nManche Universen lassen sich von unserem vermutlich gar nicht unterscheiden, andere koennten ein veraendertes Abbild unserer Welt sein, ein Ort, an dem wir zwar alle existieren, doch mit unterschiedlichen Familien, Karrieren und Lebenslaeufen. Wieder andere koennten so extrem anders sein, dass sie fuer uns nicht wiedererkennbar waeren.\n\n\nTeil 1 bis 4 liefen vom 18.10. bis 8.11.2012 auf Arte.\n\nPlease seed!\n\nPirateerG\n","torrent":{"xt":"urn:btih:0b90396ac7fde4cf64a6af4d2fbbbc86dd959bb9","amp;dn":"Der+Stoff%2C+aus+dem+der+Kosmos+ist+%28Brian+Greene%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b90396ac7fde4cf64a6af4d2fbbbc86dd959bb9","infoHashBuffer":{"type":"Buffer","data":[11,144,57,106,199,253,228,207,100,166,175,77,47,187,188,134,221,149,155,185]},"announce":[],"urlList":[]}}