{"title":"Pointstone System Cleaner v7.0.0.180 Incl Crack [TorDigger]","uid":7884134,"size":13833825,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0baca82f3481df50de3b645b9d2a3e5024623e26&amp;dn=Pointstone+System+Cleaner+v7.0.0.180+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":5,"time":1354570692,"description":"System Cleaner\n\nSystem Cleaner is a tool for restoring hard-drive space, cleaning up the history of your activities on your computer and keeping your system running like new. The program allows you to clean your drives from unnecessary and temporary files, including your browser cache, cookies, history, recent document list, temporary files, errant uninstall entries and more. It targets more than 100 file extensions, which enable it to scan and recognize most of the unnecessary files on your computer. You can choose to delete the files to the recycle bin or to a specified backup folder. In addition, System Cleaner includes a Windows Startup manager and also allows you to remove invalid uninstaller information from the registry as well as a restore wizard to undo the changes if needed.\n\nKey Features:\n\n- Restores your hard drive's performance, hard-drive space and protect your privacy by cleaning Internet history, cache, temporary files, Windows temp files, recent document list, find history, run history, *.CHK files, the recycle bin, additional garbage and much, much more.\n- Scans dead shortcuts from your Start menu and Desktop. If it finds any shortcuts that point to files that do not exist, it will list them for you.\n- Lets you delete or disable entries that automatically start on Windows startup. This pulls all entries from your Start Menu-Programs-Startup folder as well as from the registry.\n- Define your own user defined items to remove (specified files or folders).\n- Backup files to a ZIP file or proprietary file format. You can later restore individual files using the &quot;Restore Wizard&quot;.\n- Clean Directories and Internet Cache Files. Allows you to clean directories that usually have Temporary Files or cache files (Windows Temp Directory, Documents Folder, MS Internet Explorer Cache Directory and Netscape Cache Directory).\n- Powerful file search. You can select to scan for files between a certain date, with some or all file attributes, with a certain size or with the contents of a file matching a user-defined text string.\n- Remove files to Recycle Bin, zip them, move them to a folder or completely delete them!\n- Scans multiple hard drives.\n- Fixes system errors that slow your PC down and cause it to crash\n- Speeds up your PC's execution of software programs\n- Removes space-wasting temporary files and other unnecessary disk clutter\n- Tunes up and optimizes the Windows Registry\n- Erases all evidence of your computer and internet activity\n- Makes your PC boot faster\n- Makes your PC shutdown faster\n- Fine-tunes all important Windows settings\n\nSupported OS:\n\nWindows 8/7/vista/xp (32 and 64 bit)\n\nHomepage: http://www.pointstone.com/products/systemcleaner/\n\nInstallation Instructions:\n\n1. Install program.\n2. Copy content from crack folder and paste into default installation directory.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:0baca82f3481df50de3b645b9d2a3e5024623e26","amp;dn":"Pointstone+System+Cleaner+v7.0.0.180+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0baca82f3481df50de3b645b9d2a3e5024623e26","infoHashBuffer":{"type":"Buffer","data":[11,172,168,47,52,129,223,80,222,59,100,91,157,42,62,80,36,98,62,38]},"announce":[],"urlList":[]}}