{"title":"1600s james the first - Witch hunts","uid":7926613,"size":461276636,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0bc19648f04b79931d4cca27871a8ead820a0411&amp;dn=1600s+james+the+first+-+Witch+hunts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TeachersResources","files":2,"time":1355594496,"description":"This is a collection of History resources for teachers and students. The materials here are found elsewhere on the internet and many thanks go to the countless numbers of original uploaders. The documentaries and materials have merely be resorted into chronological order to make them more accessible. \n\nThe folders are named by date of the event or period, followed by a title which more or less suggests the content. Some folders may cover a period across several centuries, while others may cover a single event. Historic figures before the twentieth century are generally listed under their date of birth, then death, while political figures of the last century or so, are listed by the dates during which they \nwere in power. Some individuals appear by their date of death where this is more appropriate. The entire collection covers from 1400 BC to the present. Every major event in world history is represented in its individual folder. Some folders may only have a single documentary, while others may have a great number of video files and books.\n\nIt is suggested that you might use a torrent client like utorrent which allows the user to select the files they wish to download, as some folders may have far too much material to be practicable as a single download.\n\nTo visit the entire History index, go to:\n\nthepiratebay.se/user/TeachersResources/\t\t\n\nFor resources on Literature, go to\n &lt;a href=&quot;\nhttps://thepiratebay.se/user/TeachersResourcesLit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/TeachersResourcesLit&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0bc19648f04b79931d4cca27871a8ead820a0411","amp;dn":"1600s+james+the+first+-+Witch+hunts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc19648f04b79931d4cca27871a8ead820a0411","infoHashBuffer":{"type":"Buffer","data":[11,193,150,72,240,75,121,147,29,76,202,39,135,26,142,173,130,10,4,17]},"announce":[],"urlList":[]}}