{"title":"Evil.Anal.14.XXX.DVDRip.XviD-Jiggly","uid":7894318,"size":1461653809,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1052d42fc274b7e30a6488e2d44b4c9ab2d050a9&amp;dn=Evil.Anal.14.XXX.DVDRip.XviD-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"R0thschild","files":4,"time":1354799216,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=157516&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=157516&lt;/a&gt;\n\nStarring Liza Del Sierra!Superstud Manuel Ferrara cooks up a four-course meal of nasty, rough, twisted anal porn in this 14th edition of his dark, vignette-based 'Evil Anal' series. This director has always been drawn to the forbidden side of sex, and in Evil Anal 14 the French-born pervert dramatizes the thrill of sex-crazed sluts indulging their most unspeakable desires. Having invited his pal Toni to the house, Mick Blue walks into his bathroom to discover his wife - fishnet-clad nympho Liza del Sierra - impaling her ass on a black dildo.Soon the hot married whore's getting sodomized, double-fucked and creamed by hubby and his friend. Reddish-blonde Krissy Lynn does a sultry POV striptease with big anal toys for Manuel, then rides his huge cock in a fierce but intimate anal scene that leaves her swallowing a messy mouthful of cum. Sleek, beautiful blonde Victoria White sensually fingers her asshole in the sauna while her tennis partner (Ribas) watches. After teasing him through the window, she shows his dick some real anal athleticism by taking it deep inside her rectum, then sucking it clean. Finally, Manuel stuffs the ass of busty young slut Brandy Aniston with his thick cock before filling her mouth with sperm. Once again, Monsieur Ferrara has captured the excitement of taboo lust. If it ain't evil, you're doing it wrong!Manuel Ferrara's Evil Anal 14 is a single-disc DVD with behind-the-scenes footage, cumshot recap, photo galleries, cast list, filmographies and trailers.","torrent":{"xt":"urn:btih:1052d42fc274b7e30a6488e2d44b4c9ab2d050a9","amp;dn":"Evil.Anal.14.XXX.DVDRip.XviD-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1052d42fc274b7e30a6488e2d44b4c9ab2d050a9","infoHashBuffer":{"type":"Buffer","data":[16,82,212,47,194,116,183,227,10,100,136,226,212,75,76,154,178,208,80,169]},"announce":[],"urlList":[]}}