{"title":"e 2009 Somewhere I Have Never Travelled (TAI) [EngSub]","uid":7925206,"size":734108076,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:108c6d1db04195778c8a7146a3ebbd9266c25979&amp;dn=e+2009+Somewhere+I+Have+Never+Travelled+%28TAI%29+%5BEngSub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Alexa0411","files":2,"time":1355570189,"description":"Two social outcasts long for a world in which they don't stand out in this drama from Taiwan. Ah-Guei is a fifteen-year-old girl who comes from a family of misfits -- her father is intellectually challenged and cleans streets for a living, while her grandfather is a neighborhood character known for his short temper. While Ah-Guei seems like a happy and well-adjusted girl on the surface, she was born color-blind and cannot see red or green, a seemingly minor disability but one that sets her apart from her classmates. Ah-Guei's most trusted confidante is her twenty-year-old cousin Ah-Xian, who dreams of traveling the world and owns a large collection of maps and books on exotic locales. But Ah-Xian has his own secret -- he's gay, and has never been able to find another man with whom he can have a happy relationship. Ah-Guei and Ah-Xian both share a dream of going away to a place where they won't seem like outsiders, but while Ah-Xian's desire is to move to New York City, Ah-Guei imagines a fantasy world where the colors she cannot see do not exist.\n\n\n01:34:11\n576x320\n23.976 FPS","torrent":{"xt":"urn:btih:108c6d1db04195778c8a7146a3ebbd9266c25979","amp;dn":"e+2009+Somewhere+I+Have+Never+Travelled+%28TAI%29+%5BEngSub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"108c6d1db04195778c8a7146a3ebbd9266c25979","infoHashBuffer":{"type":"Buffer","data":[16,140,109,29,176,65,149,119,140,138,113,70,163,235,189,146,102,194,89,121]},"announce":[],"urlList":[]}}