{"title":"Alex Jones Show - 2013 Jun 23 SU [sebaygo1]","uid":8607310,"size":41658409,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:131ee8c13bafb36476779048363eefb6246030a7&amp;dn=Alex+Jones+Show+-+2013+Jun+23+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":9,"time":1372046742,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 23 June 2013\n\n\n[sebaygo1]\n\nShow description from theweb site :: On this Sunday, June 23 edition of the Alex Jones Show, Alex breaks down the latest developments in the NSA surveillance case as the whistleblower Edward Snowden is officially charged with espionage for the national security state crime of revealing details on the NSA's systematic violation of the Constitution and the Bill of Rights as it surveils millions of Americans. Alex also covers revelations that the journalist Michael Hastings had stated hours before his death that he was going into hiding in response to government harassment and Obama's war on the press. Alex also breaks down an intrusive Australian census collection effort that is an extension of efforts by governments and the United Nations to compile databases delving into the personal lives of citizens as part of an overarching control grid.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:131ee8c13bafb36476779048363eefb6246030a7","amp;dn":"Alex+Jones+Show+-+2013+Jun+23+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131ee8c13bafb36476779048363eefb6246030a7","infoHashBuffer":{"type":"Buffer","data":[19,30,232,193,59,175,179,100,118,119,144,72,54,62,239,182,36,96,48,167]},"announce":[],"urlList":[]}}