{"title":"Train Simulator 2013 - J94 'Memories of Maerdy' Pack","uid":7840225,"size":661811788,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:132609ceb00ea01cf4c30ae220f9193e296eac03&amp;dn=Train+Simulator+2013+-+J94+%27Memories+of+Maerdy%27+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IiTraxiI","files":-1,"time":1353320824,"description":"The Hunslet J94 Austerity tank locomotive is now available for Train Simulator, complete with the Maerdy Valley colliery mini-route and advanced steam simulation features.\n\nThe J94 was introduced in 1937 as the Hunslet Class 50550, general purpose 0-6-0 saddle tank locomotive. At the outbreak of World War 2, the design was amended to allow cheaper and speedier production, and the Hunslet Austerity tank was born. Several works were charged with producing the J94 including Hunslet, Andrew Barclay Sons &amp; Co, W.G Bagnall, Hudswell and Clarke, Robert Stephensons and Hawthorns and the Vulcan Foundry. Incredibly, the J94 continued in production for the National Coal Board almost until the end of British main line steam, with the last being produced for the NCB in 1964. The J94s versatility and appeal for yard operators assured the type a continuing life late into the 20th Century with the NCB and with numerous industrial owners.\n\nThe J94 for Train Simulator includes 8 different loco variants, including weathered liveries, and two different control options: a standard version which can be driven with the on-screen HUD or simple controls, plus an advanced version with accurately simulated steam controls which requires keyboard control. Also included is a small colliery route running between Maerdy and Tylorstown.\n\nVisit our website: http://www.railgamer.co.uk\n\nVisit our main torrent host at: http://1337x.org/user/RailGamer/","torrent":{"xt":"urn:btih:132609ceb00ea01cf4c30ae220f9193e296eac03","amp;dn":"Train+Simulator+2013+-+J94+%27Memories+of+Maerdy%27+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"132609ceb00ea01cf4c30ae220f9193e296eac03","infoHashBuffer":{"type":"Buffer","data":[19,38,9,206,176,14,160,28,244,195,10,226,32,249,25,62,41,110,172,3]},"announce":[],"urlList":[]}}