{"title":"The Ed Show 12-3-12.mp4","uid":7892582,"size":175086810,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:160021a299a224760cbe512a1f9d5cd0a7e54c8f&amp;dn=The+Ed+Show+12-3-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1354760128,"description":"The Ed Show; December 4, 2012.\n\nThe &quot;flabbergasted&quot; Republicans finally put a plan on the table to avoid the fiscal cliff and surprise, the middle class gets the shaft!\n\nEd welcomed Robert Reich (former U.S. Labor Secretary and UC Berkeley Professor), to break it all down.\n\nThen, Richard Wolffe (Executive Editor, MSNBC.com, MSNBC Political Analyst), and Molly Ball (political reporter at The Atlantic), looked at the Republican political theater and the White House response.\n\nRecord-breaking corporate profits show the economy is on the road to recovery. But what does it mean for workers? Ed asked Sam Stein (Huffington Post political editor).\n\nVeteran NBC Sports broadcaster Bob Costas issued a common sense plea for gun control in the wake of a murder-suicide involving the Kansas City Chiefs linebacker Jovan Belcher and the right wing just explodes. William C. Rhoden (Columnist for The New York Times) and Dan Gross (President of The Brady Campaign), responded.\n\nThen, Mitt Romney and Rick Santorum finally find new jobs. Ed had the details.\n\nAnd in the Big Finish, world leaders said farewell to Secretary of State Hillary Clinton with a ringing endorsement in the form of a 10-minute video tribute. Is it the opening salvo in the 2016 race? Ed asked Michael Tomasky (Special Correspondent, The Daily Beast).","torrent":{"xt":"urn:btih:160021a299a224760cbe512a1f9d5cd0a7e54c8f","amp;dn":"The+Ed+Show+12-3-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"160021a299a224760cbe512a1f9d5cd0a7e54c8f","infoHashBuffer":{"type":"Buffer","data":[22,0,33,162,153,162,36,118,12,190,81,42,31,157,92,208,167,229,76,143]},"announce":[],"urlList":[]}}