{"title":"Effects of Delay in Oral Practice at the Beginning of Second Lan","uid":8609765,"size":1612101,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:16d5265ff6879ec230a6695a01d2f7ea0ae37d81&amp;dn=Effects+of+Delay+in+Oral+Practice+at+the+Beginning+of+Second+Lan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1372106352,"description":"\n\nEffects of Delay in Oral Practice at the Beginning of Second Language Learning (1970)\n\n\nAuthor: Valerian A. Postovsky\n\n# of pages: 11\n\n\nThis is a pdf of an &quot;unpublished&quot; dissertation in 1971 by the author.\n\n\n\nAbout the author:\n\n\nIn the 1960's, Valerian A. Postovsky, one of the ACC (Audio Comprehension Course) developers at the Defense Language Institute at Monterey, became interested in the discovery that with students in the ACC Russian program comprehension skills significantly facilitated their acquisition of speaking skill.He grasped the fact that comprehension implies competence, and that the ability to understand spoken and written language constitutes a very important and valuable aspect of language competence in itself and, more than that, may constitute an ideal latency from which speech production can emerge on its own.\n\nHis approach, as implied in its name, Delayed Oral Practice, was designed to foster the rapid acquisition of all the linguistic systems except speech production. He saw speech as being dependent on the same grammar as comprehension, but requiring in addition the retrieval of grammatical forms and therefore imposing a much heavier load on the memory system as well as engaging very complex psychomotor skills.\n\nHis dissertation at UC/Berkeley, entitled Effects of Delay in Oral Practice at the Beginning of Second Language Learning (this one here), and his articles in language journals describe his comprehension approach and argue powerfully for consideration of this revolutionary model of language instruction.\n\nHis untimely death in 1977 cut short a notable career, but his name will always be associated with the concept of comprehension training....\n\n                                                     \n\nfrom &quot;Innovative approaches to Language Teaching&quot; (1982) by Robert W. Blair\n\n\n\n","torrent":{"xt":"urn:btih:16d5265ff6879ec230a6695a01d2f7ea0ae37d81","amp;dn":"Effects+of+Delay+in+Oral+Practice+at+the+Beginning+of+Second+Lan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16d5265ff6879ec230a6695a01d2f7ea0ae37d81","infoHashBuffer":{"type":"Buffer","data":[22,213,38,95,246,135,158,194,48,166,105,90,1,210,247,234,10,227,125,129]},"announce":[],"urlList":[]}}