{"title":"Trillian 5 Pro for Windows 5.3.0.16-TE","uid":8586636,"size":22996559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:198c0f86a1aa0b1c2442cffe36bec325872f1ef4&amp;dn=Trillian+5+Pro+for+Windows+5.3.0.16-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darksniper4887","files":-1,"time":1371549340,"description":"RELEASE NOTES:\n--------------\n        Clean. Simple. Powerful.\n \n\n        Streamlined social news feeds:\n\n        Trillian 5's Facebook, Twitter and LinkedIn support is fast,\n        uniform and integrated.\n        â•– Comprehensive: More types of feeds, like Facebook events and\n          Twitter searches.\n        â•– Flexible: Store feeds in your contact list and/or system tray.\n        â•– Quick: Instant updates to all services are just one click away.\n        â•– Interactive: View likes and read/write comments directly within\n          Trillian.\n        â•– Detailed: Links and pictures are expanded automatically to\n          avoid opening the web browser.\n \n        Designed for Windows 7\n        â•– Trillian 5 feels right at home in all versions of Windows. Our\n          clean and pleasant user interface has been carefully designed\n          to smoothly integrate with the operating system.\n \n        Synchronized chat history\n        â•– Never miss a message again with Trillian 5's fully\n          synchronized chat history. The power of the Trillian network\n          ensures your contact list, accounts, and chat history are\n          automatically shared between your desktops and phones!\n \n        Foursquare with GPS support\n        â•– Our newly-supported Foursquare plugin lets you meet up with\n          new friends and discover new places! Powered by the GPS support\n          in Windows 7, you can even check-in right from Trillian!\n \n        A truly compact interface\n        â•– Stuck on a netbook with a tiny screen? No problem. Switching\n          between our full and compact user interfaces is only a click\n          away in Trillian 5. No need to change skins, no need to wait,\n          and no need to worry about Trillian hogging your desktop.\n          Compact, slim and fast.\n\n\n\n        What is Trillian?\n \n        Connect to your IM, mail, and social networks in one place\n        â•– Trillian can connect to AIM, Windows Live, Yahoo!, Google,\n          Facebook Chat, Jabber, Skype and a lot more. Trillian 5\n          introduces improved Facebook Chat via XMPP and support for\n          Foursquare, LinkedIn, and studiVZ / meinVZ / schuelerVZ chat!\n \n        Fully customizable and extensible\n        â•– With a multitude of options and a comprehensive library of\n          plugins, skins and skin packs, you can extend and customize\n          Trillian in any way imaginable. Show RSS feeds or even play\n          music while chugging along with a contact list right out of\n          Terminator 5.\n \n        Optimized for Windows\n        â•– Trillian is built directly in C++ using native Windows APIs.\n          Not relying on third-party runtimes or toolkits means lower\n          memory consumption and direct access to native Windows\n          features as soon as they're made available to developers.\n          Trillian 5 for Windows is the smoothest and fastest version\n          of Trillian ever!\n\n\n        Whats New In v5.3.0.16?:\n\n        Fix Twitter connectivity.\n\n\n\n        For More Info on Trillian 5 Pro for Windows Visit:\n       &lt;a href=&quot; http://www.trillian.im/learn/tour-trillian5.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.trillian.im/learn/tour-trillian5.html&lt;/a&gt;\n\n\n\nINSTALLATION NOTES:\n-------------------\n        Step #1:\n\n        Run trillian-v5.3.0.16.exe and read below before doing install.\n\n        It is prefered that you do not click Launch on the final\n        installation Window, instead click the X at the top right.  If\n        you clicked launch (don't worry nothing wrong can happen), close\n        Trillian 5 down first.  Next copy precracked exe from the Crack\n        folder to the installed folder of Trillian 5 Pro, making sure to\n        overwrite the existing file.  If you have already setup your\n        account with a previous version then your done, if not follow on\n        to Step #2 below.\n\n        Step #2:\n\n        Launch Trillian 5 Pro and Register a new Trillian Account.  Fill\n        out required information (real email is needed for confirmation)\n        and make sure to UNCHECK I have previously purchased Trillian\n        Pro.  Check your email and get confirmation code.  Apply code and\n        now continue to setup your IM accounts.  You now how a fully\n        registered version of Trillian 5 Pro!  Also remember the Trillian\n        Account IS REQUIRED for your settings to be saved!\n\n        You are now a Supreme Trillian Overlord is ONLY done by TE, its\n        the PRO version in everyway, plus some.  We had people ask, this\n        is why.  If you find this showing on another groups crack, they\n        are stealing from TE and are just repacking whores.\n\n        Thats it!  Enjoy.\n","torrent":{"xt":"urn:btih:198c0f86a1aa0b1c2442cffe36bec325872f1ef4","amp;dn":"Trillian+5+Pro+for+Windows+5.3.0.16-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"198c0f86a1aa0b1c2442cffe36bec325872f1ef4","infoHashBuffer":{"type":"Buffer","data":[25,140,15,134,161,170,11,28,36,66,207,254,54,190,195,37,135,47,30,244]},"announce":[],"urlList":[]}}