{"title":"Farm Invasion USA - Premium v1.2.1","uid":8672105,"size":24360434,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:19bd4076ab5fa509cb6cc90a4e1e7231baa144d7&amp;dn=Farm+Invasion+USA+-+Premium+v1.2.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":-1,"time":1373514089,"description":"\nThe Aliens have arrived! And all they want is your corn! Defend your fields with the old corn chopper and tinkered arsenal to spoil the blue menÎ“Ã‡Ã–s appetite forMake Redneck Pops proud and welcome your new friends from outer spaceÎ“Ã‡Âª the Texan way!\n\nFeatures:\n\n- Splendidly spaced out runner action with oddball Rednecks and cuddly Aliens\n- Wild hounding with thresher and tinkered arsenal\n- Countless weapons against Ufos and blue noses\n- Little Aliens, hoggish Aliens and explosive Aliens crowd your back\n- Tuning upgrades for the hottest and deadliest vehicle in the universe\n- Alien and Redneck gadgets for more fun on the fields\n- Funky levels for the endless Alien hunt\n- Dozens of achievements and challenges for the toughest harvest hands\n- Full tablet support\n\n* Supports Google Play game services *\n\n*Optimized for big screen TV over MHL*\n\n* Supports Immersion haptic technology *\n\nIts been a peaceful day in Texas, with the sun burning down its last rays on Redneck Pops and his two sons Joe and Otis, counting the harvested corn on their porchÎ“Ã‡Âª when suddenly unknown flying objects are landing and hoggish blue noses start frying fresh corn to makeof it! \n\nReasons enough to welcome the new visitors the Earthling way! Help the two brothers Joe and Otis, get a shotgun, the deadly rocket launcher or a hunting rifle and start the engine of the familyÎ“Ã‡Ã–s heirloom, the mighty corn chopper! \n\nRace down the fields and banish theraiders with the sharp blades of your thresher! Use aimed shots to get down their spaceships and avoid obstacles on the field to collect the remaining corn! The craziest invasion of the third kind has just begun!\n\nWhat's in this version:\n\nFixed crash at map start on some devices\nFixed freeze when losing internet connection\n1.2.0\nAdded support for Google Play game services. Sign in with your Google+ account to access online leaderboards and achievements..\n1.1.2\nFixed crashes at game and level start\nFixed some compatibility issues with ICS devices\n1.1.0:\nAdded screenshot save and share functionality\nAdded Immersion haptic technology\nImproved memory consumption (should be running on Droid X2 and other critical devices now)\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.hg.farminvasion&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.hg.farminvasion&lt;/a&gt;\n","torrent":{"xt":"urn:btih:19bd4076ab5fa509cb6cc90a4e1e7231baa144d7","amp;dn":"Farm+Invasion+USA+-+Premium+v1.2.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19bd4076ab5fa509cb6cc90a4e1e7231baa144d7","infoHashBuffer":{"type":"Buffer","data":[25,189,64,118,171,95,165,9,203,108,201,10,78,30,114,49,186,161,68,215]},"announce":[],"urlList":[]}}