{"title":"POtHS 2 - Bible Study - Part 123 - Philip Sizemore - For Every T","uid":7874544,"size":10648962825,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ab28df3d2c403d6ac3c76e3046a68c21cd5485c&amp;dn=POtHS+2+-+Bible+Study+-+Part+123+-+Philip+Sizemore+-+For+Every+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":73,"time":1354301472,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Bible Study - 122 - Charles Lawson - Present Truth\n\nPOtHS Comment: His BLOOD is the only thing that Redeems us.\n\nDescription:\n\nTemple Baptist Church and Pastor Lawson, www.thelionofjudah.org , delivers a collection of messages from the pulpit of Temple Baptist Church. Old Time Preaching in the following sermons...\n\nAnother Gospel:\nTony Wilson 05/23/12 (WN) II Corinthians 11:1-4 Popular Preaching and Popular &quot;Salvation&quot; Is NOT the Same Gospel Preached By Paul and Peter and John, But the Speaker Carefully and Decisively Shows How Their Message Falls Short and Fails When Compared to the Distinctive Living and Written Word of God.\n\nNew Testament of Our Lord   Savior Jesus Christ:\nCharles Lawson 09/23/12 (SM) New Testament of Our Lord &amp; Savior Jesus Christ. Everything in the New Testament Points To The Lord &amp; Saviour Jesus Christ. Academically Speaking, &quot;How To Deal With the Issue of Sin&quot;; &amp;, Speaking as a Lost Man: &quot;How Do I Get Him To Help Me?&quot;\n\nPresent Truth:\nCharles Lawson - Temple Baptist Church - 11/04/12 (SM) II Peter 1:1-2 Peter's Practical Exhortation To Godliness Lists the Progression of Steps We Should See, Unless We Be Blind, and It Speaks of the Truth That Impacts You at This Time\n\nQuick Look Back:\nCharles Lawson 08/19/12 (SS) Revelation 13:18 Review of Recent Sunday School Lessons Clarifying the Successive Links.\n\nYour Need to Pray\nCharles Lawson 08/19/12 (SM) James 5:17-18 Five Things You're telling God When You Quit Praying; And Five Specific Benefits of Prayer to Almighty God.\n\nTonight You Die:\nCharles Lawson 11/18/12 (SM) Luke 12:16-21 Near Death Studies Done by Maurice Rawlings And by Michael Sebam in His Atlanta Study Brought the Conviction of God and Then Salvation To Their Souls. We Are None Promised Tomorrow. Do Be Ready.\n\nRepentance and Belief:\nPastor Lawson speaks on the need for Holy Ghost wrought repentance in salvation. The decision based belief taught today falls far short of what was preached by the apostle Paul.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.                                        \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:1ab28df3d2c403d6ac3c76e3046a68c21cd5485c","amp;dn":"POtHS+2+-+Bible+Study+-+Part+123+-+Philip+Sizemore+-+For+Every+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ab28df3d2c403d6ac3c76e3046a68c21cd5485c","infoHashBuffer":{"type":"Buffer","data":[26,178,141,243,210,196,3,214,172,60,118,227,4,106,104,194,28,213,72,92]},"announce":[],"urlList":[]}}