{"title":"FootWorship---FW-24288 Lorelei Lee, Gia DiMarco, Chanel Preston ","uid":7848085,"size":747246362,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1c8afe5e678c159bf672ab824bf0bbfa57f80424&amp;dn=FootWorship---FW-24288+Lorelei+Lee%2C+Gia+DiMarco%2C+Chanel+Preston+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1353522966,"description":"\nMad For Feet!\n\nOct 26, 2012 - Performers: Lorelei Lee , Sebastian Keys , Gia DiMarco and Chanel Preston \n\n\nWMV + Pics.\n        \n\nWhat happens to the biggest ad man in the biz when the company leaves for lunch break and his secretaries take over? Foot Worship of course! Lorelei Lee, the head of the secretarial pool shows the world what every big executive has on his mind, feet! With her two friends, Chanel Preston and Gia Dimarco to assist they take Mr. Keys on a podophilist's dream trip to the kinky world of foot worship, submission, obsession and devotion. He may seem like the debonair, whiskey in hand business man but behind closed doors he's a groveling foot freak on his knees and the secretaries know this! The secretaries adorned in vintage seamed nylons, garters and heels have had a tough morning pouring drinks for all the executives and at lunchtime they want to unwind the only way they know how by allowing Mr. Keys the pleasure of worshiping their perfect peds! Plenty of nylon tease, sweaty nylon sniffing, trampling, foot to ass spanking, foot tease, shoe sniffing, high arches, foot humiliation and foot fetish sex! Mr. Keys gets a foot job like no other with 6 perfectly pedicured feet and allowed to blow his load on all 30 toes! Tsk, tsk, tsk Mr. Keys lunch is almost over and you know that honor comes with a price don't you? Wonder if the other boys will smell your dirty secret all over your face in your first afternoon meeting?!\n\nScreens &lt;a href=&quot;\nhttp://www.footworship.com/site/shoot/24288-Mad-For-Feet.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.footworship.com/site/shoot/24288-Mad-For-Feet.html&lt;/a&gt;\n\nAlmost 9000 uploads, and if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)    \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:1c8afe5e678c159bf672ab824bf0bbfa57f80424","amp;dn":"FootWorship---FW-24288+Lorelei+Lee%2C+Gia+DiMarco%2C+Chanel+Preston+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8afe5e678c159bf672ab824bf0bbfa57f80424","infoHashBuffer":{"type":"Buffer","data":[28,138,254,94,103,140,21,155,246,114,171,130,75,240,187,250,87,248,4,36]},"announce":[],"urlList":[]}}