{"title":"211B Total Onslaught - The Secret Behind The Secret Societies","uid":7865046,"size":732882944,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1e4c239202c38047eb3de2b7473014739418e767&amp;dn=211B+Total+Onslaught+-+The+Secret+Behind+The+Secret+Societies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dietrichzumwald","files":1,"time":1354035599,"description":"For any truth seeker interested in the secret societies and growing evil in the world today, this torrent is for you!\n\nThis series is thorough and contains some of the best information I have ever seen. Walter Veith's other series on this topic are equally relevant ad as well presented.\n\n\n211 - The Secret Behind Secret Societies\n\nThe nature of secrecy is such that the real power behind the power remains exactly that: secret. In this lecture, clear evidence is provided to show who really stands behind the throne of earthly power.\n\nThis DVD includes an introduction to Albert Pike, the Jesuit Order, Knights of Columbus, Opus Dei, Skull and Bones, and the Bohemian Grove.\n\n\n----------\n\nTotal Onslaught 36 DVDs Set\n\nThis series is an in-depth chapter by chapter study of the book of Revelation. Throughout the study, the total onslaught on Jesus Christ and the effects of this war on every individual living on this planet are clearly portrayed. The beauty of Christ's kingdom and laws are contrasted with Satan's government and plans, and Satan's deceptions are clearly revealed. This series is must-have for every Christian and non-Christian living today. The ideas explored hit home because they are current, relevant, and applicable to the dangers and deceptions raging today on planet earth. Excellent for sharing with friends and family as the ideas presented therein give outstanding behind-the-scenes information about current events. Buy the complete series and see how Jesus Christ is being attacked, and learn how to avoid the manipulative plans laid out by the enemy of souls.","torrent":{"xt":"urn:btih:1e4c239202c38047eb3de2b7473014739418e767","amp;dn":"211B+Total+Onslaught+-+The+Secret+Behind+The+Secret+Societies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e4c239202c38047eb3de2b7473014739418e767","infoHashBuffer":{"type":"Buffer","data":[30,76,35,146,2,195,128,71,235,61,226,183,71,48,20,115,148,24,231,103]},"announce":[],"urlList":[]}}