{"title":"The Ed Show 11-14-12.mp4","uid":7831622,"size":195702586,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:214c138ad0de193ad8248be0fddff771a098f913&amp;dn=The+Ed+Show+11-14-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1353072364,"description":"The Ed Show; November 14, 2012.\n\n At his first press conference since he was re-elected, the president drew a line in the sand for the middle class.\n\nCongressman Tim Ryan (D-OH) joined to talk about the president's middle class rallying cry, and the coming showdown over taxes and the fiscal cliff.\n\nThen, the president gpt as angry as anyone would ever see him in public over John McCain's attack on Susan Rice. These two have a history, and Ed discussed it with  Jonathan Alter (MSNBC Political Analyst and Bloomberg View Columnist).\n\nPresident Obama talked about far more than just the economy today. Jon Nichols (The Nation's Washington Correspondent), joined to discuss the president's remarks today on immigration and Petraeus.\n\nThere's going to be a new senator from North Dakota, and even Nate Silver didn't see her coming. Senator-Elect Heidi Heitkamp (D-ND) joined Ed for an exclusive interview.\n\nAnd in the Big Finish, Republicans in Ohio haven't learned anything after this year's election. They continued their war on women with a vote to defund Planned Parenthood. And it didn't stop there: they had even more radical legislation in the works. State Senator Nina Turner(D-OH) went on the show to respond.","torrent":{"xt":"urn:btih:214c138ad0de193ad8248be0fddff771a098f913","amp;dn":"The+Ed+Show+11-14-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214c138ad0de193ad8248be0fddff771a098f913","infoHashBuffer":{"type":"Buffer","data":[33,76,19,138,208,222,25,58,216,36,139,224,253,223,247,113,160,152,249,19]},"announce":[],"urlList":[]}}