{"title":"Novel - The Western Front (Part 1) by Archer Garrett.pdf","uid":7820305,"size":697832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2233e163303bf03a56a504eebc005a86121cff4d&amp;dn=Novel+-+The+Western+Front+%28Part+1%29+by+Archer+Garrett.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ArcherG","files":1,"time":1352778898,"description":"Darkness has descended upon the world; the fabric of society has been torn asunder, sovereign nations collapse under their own burdens, once stable governments are ushered into revolution and allies of old are thrust into war. The tentacles of darkness have inevitably traveled across the Atlantic and are now tightening their grip on the American republic.\n\nNow, faced with a collapsing economy, a failing currency and a society that is swiftly casting its humanity aside, the United States stands at the precipice of a bedlam and malevolence not witnessed since the fall of Rome.\n\nThe story follows several characters who strive to navigate the chaos, including:\n\nJake, his wife and brother are forced to flee the maelstrom of violence as it spills from the distant cities and into their small town enclave.\n\nA Texas State Guardsmen deep behind enemy lines on South Padre Island, stands with his compatriots against a wave of unspeakable atrocities committed by a ruthless cartel alliance committed to seizing the spoils of the American southwest.\n\nAn outlaw and his Catahoula cur companion, learn to survive and even thrive in their river swamp domain as they seek a redoubt from the troubles that plague the world around them.\n\nMeanwhile, a radical revolutionary intent on plunging the wounded nation into revolution, stokes the flames of hatred and destruction.","torrent":{"xt":"urn:btih:2233e163303bf03a56a504eebc005a86121cff4d","amp;dn":"Novel+-+The+Western+Front+%28Part+1%29+by+Archer+Garrett.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2233e163303bf03a56a504eebc005a86121cff4d","infoHashBuffer":{"type":"Buffer","data":[34,51,225,99,48,59,240,58,86,165,4,238,188,0,90,134,18,28,255,77]},"announce":[],"urlList":[]}}