{"title":"BBC A Very English Winter The Unthanks 2012","uid":7951820,"size":734726656,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2360070faee1e095d0893366d82ff15488e66aea&amp;dn=BBC+A+Very+English+Winter+The+Unthanks+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1356297584,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/b01pdsvds&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/b01pdsvds&lt;/a&gt;\n\nRachel and Becky Unthank continue their journey around England's hidden customs \nand dance traditions and into the dark heart of its winter pastimes. The \nfollow-up to Still Folk Dancing After All These Years, which explored English \nfolk dances from spring to harvest, this film explores English folk customs \naround the country though the other six months of the year.\n\n200 years of political intrigue and clashes with police authorities in Lewes on \nGuy Fawkes Night have created an awe-inspiring procession of burning popes and \nother effigies of the enemies of the bonfire, not to mention a heavy police \npresence to this day. Throwing the Yorkshire carols of Sheffield out of the \nchurch repertoire has only served to enhance the heart-stopping show of \nunrestrained joy found in the powerful singing at the Royal Hotel pub in \nDungworth. \n\nThe longsword dancers of the North East and molly dancers of East Anglia, who \nhave gone collecting funds each year, are a reminder that no higher power puts \nfood on the plate. Just as these customs rely on the communities themselves to \nmark each point with song, remembrance and a gathering together, the very need \nto survive lies in the hands of your neighbour.\n\nThe Unthanks discover these stories through singing, dancing, meeting people \nwho have grown up with these traditions and trying not to get set on fire.\n","torrent":{"xt":"urn:btih:2360070faee1e095d0893366d82ff15488e66aea","amp;dn":"BBC+A+Very+English+Winter+The+Unthanks+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2360070faee1e095d0893366d82ff15488e66aea","infoHashBuffer":{"type":"Buffer","data":[35,96,7,15,174,225,224,149,208,137,51,102,216,47,241,84,136,230,106,234]},"announce":[],"urlList":[]}}