{"title":"Melissa Harris-Perry 12-1-12.mp4","uid":7885400,"size":359353808,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2365f9fa976065eb04edd244414c1a8b9d6665cc&amp;dn=Melissa+Harris-Perry+12-1-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1354604458,"description":"Melissa Harris-Perry; Saturday, December 1, 2012.\n\nIn Nerdland were:\nJoy Reid (MSNBC contributor, managing editor of the Grio.com), Dan Dicker (CNBC contributor, principal partner at Mercbloc), and Laura Flanders (host and founder of GRITtv.org) discussed the Democrats hold all the cards.\n\nA little later, Ari Melber (MSNBC contributor, correspondent for &quot;The Nation&quot; magazine, and an author of a report about how the OFA campaign tried to turn its grassroots network into a governing force in the president's first term) they discussed the  fiscal deal.\n\nLee Fang (The Nation) joined via satellite and talked about Norquist loosing power.\n\nMHP's open letter &quot;To whom it may concern&quot; about another death of a young unarmed black man in Florida with the killer claiming self-defense against someone who is not a threat.\n\nJoy Reid and Ari Melber rejoined, Trymaine Lee (national reporter for msnbc.com) joined the panel which discussed gun violence in Florida and in general against black men.\n\nCaptain Zoe Bedell (the United States Marine Corps Reserve, plaintiff suing to serve in combat) and Anu Bhagwati (the executive director of the Service Women's Action Network) joined to discuss women and their prohibition from serving in combat.\n\nSlightly later Laura Flowers and Ari Melber joined in the conversation.\n\nThen on AIDs day Nerdland welcomed Sonia Rastogi (an advocacy coordinator for the Positive Women's Network, who is HIV positive), Dr. Susan Ball (director of the HIV Care Center at New York Presbyterian-Weill Cornell Medical Center) joined as Joy Reid and Ari Melber returned and discussed AIDs and HIV and what can be done to detect and prevent the disease.\n\nSheryl Lee Ralph (actress, author, AIDs activist) joined via satellite to discuss AIDs/HIV awareness.\n\nFoot Soldier: Katie Meyler.","torrent":{"xt":"urn:btih:2365f9fa976065eb04edd244414c1a8b9d6665cc","amp;dn":"Melissa+Harris-Perry+12-1-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2365f9fa976065eb04edd244414c1a8b9d6665cc","infoHashBuffer":{"type":"Buffer","data":[35,101,249,250,151,96,101,235,4,237,210,68,65,76,26,139,157,102,101,204]},"announce":[],"urlList":[]}}