{"title":"Manhunter-SKIDROW [EtGamez]","uid":7878957,"size":1603679235,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:247e64de47bce2ed8c820238c7c1457858c3c1ee&amp;dn=Manhunter-SKIDROW+%5BEtGamez%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"EtGamez","files":3,"time":1354435998,"description":"Manhunter-SKIDROW [EtGamez]\n\n\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nManhunter (c) silden\n\n29-11-2012......Release Date - Protection...............Nothing\nFPS................Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nWhen John &quot;Striker&quot; Gullivan left the SAS, he's been far from thinking\nabout retirement. A skilled sniper, veteran of many covert operations,\nhe was ready to take on the less legal side of the &quot;business&quot;.\n\nWorking closely with his friend Max - one of the best hackers there are\n- he quickly earned his fame among other mercenaries and private\nagencies. Yet, he was cautious enough to avoid standing openly against\nany legal government. He was even taking semi-official jobs that were\ntoo dangerous or too politically risky for any government agenda. This\nwas an easy life.\n\nUntil now.\n\nFeatures:\n\nFirst Person Perspective dynamic adventure shooter powered by the\nadvanced Argon 5 technology.\n\nPlay the role of a famous mercenary through 5 large, different\nchapters (14 huge levels total): Iranian hidden nuclear materials'\nprocessing plant, Moscow Trade Center where the trouble begins, City\nDockyard hit-and-flee mission, Baykonur Cosmodrome shootout, and Iraq\nterrorist cave search for a missing VIP.\n\nGame reflects John's sniper expertise. At the beginning of each\nchapter he is given 2 sniper rifles - a silenced Arctic Warfare as a\nprimary weapon and additionally one specialised rifle that fits the\nchapter best, selected from a variety of choices. Additional rifles\nrange from a very fast, semi automatic Saiga with sniper scope to a\nheavy and deadly Barrett .50.\n\nGame simulates bullet ballistics depending on gravity, wind and bullet\ninitial velocity for more realistic experience.\n\nUsing silencer on the Arctic Warfare or on John's personally modified\nP99 pistol may be useful at times, as the enemies fully depend on\ntheir eyes and ears - and they cannot chase what they don't see nor\nhear.\n\nPlaying the game as a &quot;standard&quot; shooter using automatic rifles and\npistols taken from dead enemies is of course possible as well - still\nusing sniper tactics over longer distances is easier.\n\nSophisticated enemy AI allows them to fight in groups, using different\nweapons and explosives, alarming and supporting each other, using\nterrain and objects in their tactics.\n\nGame is powered by advanced technology and renderer that produces\nbeautiful images, full of light, beautiful atmospheric effects,\nrealtime water, reflections, shadows and different, realistic surface\nmaterials complete with vivid, living environments with animated plant\nlife, insects and birds.\n\nConvincing storyline and action objectives. The player is constantly in\ncontact with his HQ, which feeds him with data and changes mission\nobjectives as he goes.\n\nAs the technology is very well tested and the team consists of\nprofessionals with long experience, the process of finishing, testing,\nlocalising and publishing the game should be most fluent.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n5. Play the game\n6. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups","torrent":{"xt":"urn:btih:247e64de47bce2ed8c820238c7c1457858c3c1ee","amp;dn":"Manhunter-SKIDROW+%5BEtGamez%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"247e64de47bce2ed8c820238c7c1457858c3c1ee","infoHashBuffer":{"type":"Buffer","data":[36,126,100,222,71,188,226,237,140,130,2,56,199,193,69,120,88,195,193,238]},"announce":[],"urlList":[]}}