{"title":"Jacquard's Web How a Hand-Loom Led to the Birth of the Informati","uid":7941599,"size":4389481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25d8698875b2b740530ab79a954bff19abc35070&amp;dn=Jacquard%27s+Web+How+a+Hand-Loom+Led+to+the+Birth+of+the+Informati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1356000978,"description":"Jacquards Web: How a Hand-Loom Led to the Birth of the Information Age\n\n\nBook Description\nPublication Date: May 21, 2007 | ISBN-10: 0192805789 | ISBN-13: 978-0192805782 | Edition: Reprint | Format: PDF\n\nCircuits from silk? Todays technophiles probably have no idea how much todays computer technology owes to the invention of one ingenuous textile manufacturer in nineteenth-century France. Here, master storyteller James Essinger shows through a series of remarkable and meticulously researched historical connections how the Jacquard loom kick-started a process of scientific evolution which would lead directly to the development of the modern computer.\n\nJacquards 1804 invention, a loom which used punch cards with stored instructions for weaving different patterns and designs, enabled the master silk-weavers of Lyons to weave fabrics 25 times faster than the competition. Here, Essinger reveals the plethora of extraordinary links between that innovation in weaving and todays computer age, introducing us to the intriguing and colorful people who paved the way. The book concludes by bringing the story completely up-to-date with the latest developments in the World Wide Web and the fascinating phenomenon of artificial intelligence.\n\nAttractively illustrated and compellingly narrated, Jacquards Web presents an eye-opening and scarcely known history that will prove fascinating to readers of popular science, especially those interested in the history of science, technology, and computing, as well as professional scientists, historians, and students.","torrent":{"xt":"urn:btih:25d8698875b2b740530ab79a954bff19abc35070","amp;dn":"Jacquard%27s+Web+How+a+Hand-Loom+Led+to+the+Birth+of+the+Informati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d8698875b2b740530ab79a954bff19abc35070","infoHashBuffer":{"type":"Buffer","data":[37,216,105,136,117,178,183,64,83,10,183,154,149,75,255,25,171,195,80,112]},"announce":[],"urlList":[]}}