{"title":"POtHS - Conspiracy - 008 - We Are Legion - The Story of Anonymou","uid":7865799,"size":3145983252,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2845494cf699bcb13ff61395849ab14213a95106&amp;dn=POtHS+-+Conspiracy+-+008+-+We+Are+Legion+-+The+Story+of+Anonymou&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1354057881,"description":"PO t HS\nPouring Out the Holy Spirit\n\n\n&quot;C  O  N  S  P  I  R  A  C  Y&quot;\n\nVolume 008\n\nWe Are Legion\nThe Story of Anonymous\nMuch Vulgarity\n\n\nPOtHS - Conspiracy - 008 - We Are Legion - The Story of Anonymous - Much Vulgarity\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, to Bless all that Seed Long.\n\n\nPOtHS Comment:  I Plead the Fifth\n\nDescription:  \n\nAnonymous (group)\nFrom Wikipedia, the free encyclopedia\nAnonymous\n\nAn image commonly found on fliers associated with Anonymous. The &quot;suit without a head&quot; represents leaderless organization and anonymity.[1]\n\n\nAnonymous (used as a mass noun) is a loosely associated hacktivist group. It (is estimated it) originated in 2003 on the imageboard 4chan, representing the concept of many online and offline community users simultaneously existing as an anarchic, digitized global brain.[4] It is also generally considered to be a blanket term for members of certain Internet subcultures, a way to refer to the actions of people in an environment where their actual identities are not known.[5] It strongly opposes Internet censorship and surveillance, and has hacked various government websites. It has also targeted major security corporations.[6][7][8] Its members can be distinguished in public by the wearing of stylised Guy Fawkes masks.[9]\n\nIn its early form, the concept has been adopted by a decentralized online community acting anonymously in a coordinated manner, usually toward a loosely self-agreed goal, and primarily focused on entertainment. Beginning with 2008, the Anonymous collective has become increasingly associated with collaborative, international hacktivism. They undertook protests and other actions in retaliation against anti-digital piracy campaigns by motion picture and recording industry trade associations.[10][11] Actions credited to &quot;Anonymous&quot; are undertaken by unidentified individuals who apply the Anonymous label to themselves as attribution.[12] Some analysts have praised Anonymous as the freedom fighters of the internet,[13] and a digital Robin Hood,[14] although others have condemned them as &quot;anarchic cyber-guerrillas&quot;.[15]\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n                                             \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:2845494cf699bcb13ff61395849ab14213a95106","amp;dn":"POtHS+-+Conspiracy+-+008+-+We+Are+Legion+-+The+Story+of+Anonymou","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2845494cf699bcb13ff61395849ab14213a95106","infoHashBuffer":{"type":"Buffer","data":[40,69,73,76,246,153,188,177,63,246,19,149,132,154,177,66,19,169,81,6]},"announce":[],"urlList":[]}}