{"title":"LibreOffice 3.6.4 RC 3 [Tuklu]","uid":7883824,"size":214724608,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2907d74eb4674e2c3c435018bfb3ee57afc9a394&amp;dn=LibreOffice+3.6.4+RC+3+%5BTuklu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tuklu","files":1,"time":1354561580,"description":"LibreOffice is the free power-packed Open Source personal productivity suite for Windows, Macintosh and Linux, that gives you six feature-rich applications for all your document production and data processing needs: Writer, Calc, Impress, Draw, Math and Base. Support and documentation is free from our large, dedicated community of users, contributors and developers. You, too, can also get involved!\n\nFeatures:\n==========\nWriter is the word processor inside LibreOffice. Use it for everything, from dashing off a quick letter to producing an entire book with tables of contents, embedded illustrations, bibliographies and diagrams. The while-you-type auto-completion, auto-formatting and automatic spelling checking make difficult tasks easy (but are easy to disable if you prefer). Writer is powerful enough to tackle desktop publishing tasks such as creating multi-column newsletters and brochures. The only limit is your imagination.\n\nCalc tames your numbers and helps with difficult decisions when you're weighing the alternatives. Analyze your data with Calc and then use it to present your final output. Charts and analysis tools help bring transparency to your conclusions. A fully-integrated help system makes easier work of entering complex formulas. Add data from external databases such as SQL or Oracle, then sort and filter them to produce statistical analyses. Use the graphing functions to display large number of 2D and 3D graphics from 13 categories, including line, area, bar, pie, X-Y, and net - with the dozens of variations available, you're sure to find one that suits your project.\n\nImpress is the fastest and easiest way to create effective multimedia presentations. Stunning animation and sensational special effects help you convince your audience. Create presentations that look even more professional than the standard presentations you commonly see at work. Get your collegues' and bosses' attention by creating something a little bit different.\n\nDraw lets you build diagrams and sketches from scratch. A picture is worth a thousand words, so why not try something simple with box and line diagrams? Or else go further and easily build dynamic 3D illustrations and special effects. It's as simple or as powerful as you want it to be.\n\nBase is the database front-end of the LibreOffice suite. With Base, you can seamlessly integrate into your existing database structures. Based on imported and linked tables and queries from MySQL, PostgreSQL or Microsoft Access and many other data sources, you can build powerful databases containing forms, reports, views and queries. Full integration is possible with the in-built HSQL database.\n\nMath is a simple equation editor that lets you lay-out and display your mathematical, chemical, electrical or scientific equations quickly in standard written notation. Even the most-complex calculations can be understandable when displayed correctly. E=mc2.\n\nLibreOffice also comes configured with a PDF file creator, meaning you can distribute documents that you're sure can be opened and read by users of almost any computing device or operating system.\n\nINFO\n======\nTitle:\tLibreOffice 3.6.4 RC 3\nFilename:\tLibO_3.6.4.3_Win_x86_install_multi.msi\nFile size:\t204.78MB (214,724,608 bytes)\nRequirements:\tWindows 2000 / XP / Vista / Windows7 / XP64 / Vista64 / Windows7 64 / Windows8 / Windows8 64\nLanguages:\tMultiple languages\nMD5 Checksum:\t94C2808CED90E8113BE4153BD54179A8\n\nINSTALL NOTES\n================\nRun the setup(LibO_3.6.4.3_Win_x86_install_multi.msi) and install.\n\nTorrent Create &amp; Uploaded by Tuklu.\n\n[img]http://kastatic.com/i2/users/8ee82d025127bddd71bd81fa9d4a155d.gif[/img]","torrent":{"xt":"urn:btih:2907d74eb4674e2c3c435018bfb3ee57afc9a394","amp;dn":"LibreOffice+3.6.4+RC+3+%5BTuklu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2907d74eb4674e2c3c435018bfb3ee57afc9a394","infoHashBuffer":{"type":"Buffer","data":[41,7,215,78,180,103,78,44,60,67,80,24,191,179,238,87,175,201,163,148]},"announce":[],"urlList":[]}}