{"title":"Alex Jones Show - 2013 Jul 12 FR [sebaygo1]","uid":8679966,"size":74868505,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:29aadb38f0bbcdab86dd74ed58ada12acc6c11bf&amp;dn=Alex+Jones+Show+-+2013+Jul+12+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1373673442,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 12 July 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Friday, July 12 edition of The Alex Jones Show, Alex confronts the prospect George Zimmerman will be acquitted in the Trayvon Martin case and riots will erupt across America, a possibility exploited by the New Black Panthers who are converging on Sanford, Florida, where the trial is concluding. \n\nAlex also talks about pervasive NSA surveillance and the further encroachment of a high-tech Stasi surveillance state with guest Wayne Madsen, who will be in-studio today. Madsen, a former NSA employee, is one of America's foremost investigative journalists. He hosts a blog, The Wayne Madsen Report. \n\nAlex also talks with James O'Keefe, the founder of Project Veritas and author of Breakthrough: Our Guerilla War to Expose Fraud and Save Democracy, a blockbuster book that documents his efforts to expose the duplicity of Planned Parenthood, ACORN, Medicaid, NPR, the New Jersey Educational Association, labor unions and politicians.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:29aadb38f0bbcdab86dd74ed58ada12acc6c11bf","amp;dn":"Alex+Jones+Show+-+2013+Jul+12+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29aadb38f0bbcdab86dd74ed58ada12acc6c11bf","infoHashBuffer":{"type":"Buffer","data":[41,170,219,56,240,187,205,171,134,221,116,237,88,173,161,42,204,108,17,191]},"announce":[],"urlList":[]}}