{"title":"Lex Is A Motherfucker Disc 2 - Interracial Porn XXX","uid":8517816,"size":1775386894,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2f6449d1762cbe68ed86cf48a98a3cb67007329a&amp;dn=Lex+Is+A+Motherfucker+Disc+2+-+Interracial+Porn+XXX+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KidAtomic","files":1,"time":1369809002,"description":"DISC 2\n\nLex Is A Motherfucker: Sexually mature ladies know what they need, and legendary stud/new Evil Angel director Lexington Steele is well-equipped to fulfill their special desires. In Lex Is a Motherfucker, he uses his enormous black cock to tame a bevy of seasoned sluts whose experienced bodies crave massive doses of interracial pleasure. Buxom Lisa Ann is the worlds most famous porn MILF a fantastically proportioned brunette bombshell. She calls Lex over for some intimate anal service, and Lisa worships his giant shaft until he spurts his spunk on her sexy face. Next, he pounds busty, fishnet-clad blonde Mellanie Monroe full of throbbing black meat before splattering her big, round ass with sperm. Classic sluts Julia Ann and India Summer team up on the director, taking turns slurping his pole and riding him to ecstasy in a filthy threesome. Delicious French sexpot Eva Karera treats Lex to a tour of her huge tits and long, luscious legs; she gags submissively on his thick, stiff dick and spreads herself wide to get thoroughly butt-fucked. Her passionate date with the muscular director climaxes in an explosion of cum. And curvaceous blonde Nikki Sexx wakes Lex up for a forbidden taste of his towering black boner. When Lexington Steele is after your moms ass, dont fight it just enjoy the show. Mature, cock-happy MILFs agree: Lex Is a Motherfucker!\n\nEva Karera wasn't sure she could take Lex up her ass but lucky for us, she takes an anal pounding!\n\nThe queen Lisa Ann is more than happy to take Lex's 11inches deep in her mouth, pussy and asshole!\n\nIndia Summer and Julia Ann unleash the double MILF attack on Lex!\n\nMellanie Monroe's big round ass is a new wonder to behold!\n\nSlutty superstar Nikki Sexx couldn't jam this big black cock up her pussy fast enough!\n\n    Scene 1. Lisa Ann, Lexington Steele\n    Scene 2. Mellanie Monroe, Lexington Steele\n    Scene 3. India Summer, Julia Ann, Lexington Steele\n    Scene 4. Eva Karera, Lexington Steele\n    Scene 5. Nikki Sexx, Lexington Steele\n\nLength 4 hrs. 19 mins.\nRating XXX\nReleased May 08 2013\nProduction Year 2013\nStudio  Evil Angel\n\nActresses:\n    Eva Karera [Anal IR]\n    India Summer [IR]\n    Julia Ann [Facial IR]\n    Lisa Ann [Anal Facial IR]\n    Mellanie Monroe [IR]\n    Nikki Sexx [IR]\n\nActors:\n    Lexington Steele\n\t\t","torrent":{"xt":"urn:btih:2f6449d1762cbe68ed86cf48a98a3cb67007329a","amp;dn":"Lex+Is+A+Motherfucker+Disc+2+-+Interracial+Porn+XXX+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f6449d1762cbe68ed86cf48a98a3cb67007329a","infoHashBuffer":{"type":"Buffer","data":[47,100,73,209,118,44,190,104,237,134,207,72,169,138,60,182,112,7,50,154]},"announce":[],"urlList":[]}}