{"title":"Fitness.Milfs.XXX.DVDRiP","uid":8524918,"size":1760873092,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2fd778ef259c71bd10794f0bb88b5bc102754d30&amp;dn=Fitness.Milfs.XXX.DVDRiP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":5,"time":1370006864,"description":"Category All Sex,MILF\n  \nDirector Vince Vouyer \nStarring Maya Hills, Alana Evans, Mellanie Monroe, Anthony Rosano, Kendra Lust, Austin Taylor \n\nAustin Taylor - Is a mom who loves to fuck, and shows it when she devour Anthony Rosan's cock by bouncing her basketball booty all over it!\n\nMILF Alana Evans takes on 2 cocks for an anal pounding after her cardio workout!\n\nMaya Hills - Returns to porn as a MILF and it hasn't slowed down her sex drive in the least. Watch Maya unleash the whore within!\n\nMellanie Monroe - This girl loves to stretch everything: hamstrings, quads and vaginal walls as she gets her sweaty pussy pounded!\n\nI've shot more than 200 porno movies in my career and if there is one thing I've learned along the way, it's to listen closely to what the fans want. And I'm here to report that the fans have spoken again. Due to popular demand, I have completed my very first MILF niche DVD, and I've titled it 'Fitness MILFs. '\n\nMy vision for this was simple. It seems like the new normal is seeing these insanely hot, mature women walking the streets in their skin-tight, workout attire, pushing their baby strollers or just jogging through the neighborhood with their big titties bouncing and their big booties shaking. There's nothing sexier than a beautiful MILF with camel-toe creeping through her crotch if you know what I mean. So without further delay, I present to you &quot;Fitness MILFS,&quot; and I guarantee these moms love to fuck. \n\nThe bubbly, blond Austin Taylor makes some free time to be alone with her hubby and reminds him of how she became a MILF by taking him down memory lane. She starts to refresh his memory by squatting on his face and making him munch her dripping, wet pussy. Then Austin deep-throats his cock until there are tears rolling down her cheeks. Of course after that she insists on mounting his shaft, riding it and making that thick booty shake before taking a hot load on her big booty and tight pussy. \n\nSuper MILF Kendra Lust has been stalking Mellanie Monroe on Twitter. Kendra wants to eat Mellanie's pussy so badly that she asked me to film them together in a girl/girl scene. So they meet for the first time on camera and immediately get into the spread-eagle position, taking turns licking and fingering each other's MILF holes. Then Mellanie shows Kendra her specialty position called the scissors, where both MILFs lock their legs for some pussy-to-pussy grinding action. \n\n\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=8944093.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=8944093.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=894409300.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=894409300.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=plfitmimp4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=plfitmimp4.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2fd778ef259c71bd10794f0bb88b5bc102754d30","amp;dn":"Fitness.Milfs.XXX.DVDRiP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fd778ef259c71bd10794f0bb88b5bc102754d30","infoHashBuffer":{"type":"Buffer","data":[47,215,120,239,37,156,113,189,16,121,79,11,184,139,91,193,2,117,77,48]},"announce":[],"urlList":[]}}