{"title":"Sword of the Stars II Enhanced Edition-SKIDROW [EtGamez]","uid":7878950,"size":2593416802,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3084fb4d2f8d2f7e09f73b5fc3098400d113cf9f&amp;dn=Sword+of+the+Stars+II+Enhanced+Edition-SKIDROW+%5BEtGamez%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EtGamez","files":3,"time":1354435950,"description":"Sword of the Stars II Enhanced Edition-SKIDROW [EtGamez]\n\n\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nSword of the Stars II Enhanced Edition (c) Paradox Interactive\n\n30-11-2012......Release Date - Protection.................Steam\nStrategy/RTS.......Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nThe Enhanced Edition contains Sword of the Stars II: The Lords of\nWinter and the first expansion, the End of Flesh. The new expansion\nintroduces the new playable race, the Loa. All previous DLCs containing\nnew avatars, new combat music, alternate voices, skins, and new badges\nfor the warships are also included.\n\nCustomize your own starships, amass your fleet, explore the outer\nreaches of the galaxy and expand your empire. Research new alien\ntechnologies and bring them into battle with  a mix of turn-based\nstrategy and real-time skirmishes.\n\nNow a new Faction bursts onto the scene, a race of Artificial\nIntelligence who once served as slaves and now return seeking\nvengeance. Playing as the Loa, your Fleets will become masters of\nmetamorphosis, shape-shifting into new forms to become the ships you\nneed, where you need them. Durable and hardy, your colonies can be\nbuilt on any rocky planet. Building an empire of silicon and steel,\nyou will bring your former masters to their kneesor will you bring\nabout the End of Flesh.\n\nFeatures:\n\nPlay as the Loa, with over 120 new ship sections and their own unique\ndrive system - the Neutrino Pulse Gate\n\nOver 25 additional technologies, including a new Cybernetic Tech Tree\n\n10 new weapons and attacks to use in battle\n\nNew ship sections for the original six Factions, including 2 new\nLeviathan class vessels\n\n2 new Independent Races to encounter, study and incorporate into your\nempire\n\nNew Random Encounters, a new Grand Menace, and new Star Maps\n\nNew Evacuation Mission, and Supplemental Mission system allowing\nplayers to focus on the Target or the Fleet\n\nAll Race DLCs: Suulka, Liir, Morrigi, Hiver, SolForce, Zuul and Tarka\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups","torrent":{"xt":"urn:btih:3084fb4d2f8d2f7e09f73b5fc3098400d113cf9f","amp;dn":"Sword+of+the+Stars+II+Enhanced+Edition-SKIDROW+%5BEtGamez%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3084fb4d2f8d2f7e09f73b5fc3098400d113cf9f","infoHashBuffer":{"type":"Buffer","data":[48,132,251,77,47,141,47,126,9,247,59,95,195,9,132,0,209,19,207,159]},"announce":[],"urlList":[]}}