{"title":"Animorphs - Andalite Chronicles","uid":7941312,"size":999831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30b6bc3b79170bed080fbda5ed83a8027f3c6d87&amp;dn=Animorphs+-+Andalite+Chronicles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"loqstar04","files":3,"time":1355992203,"description":"So I've noticed no one has a proper ebook version of Animorphs so for my torrent debut I decided to use the low-quality text/pdf versions on here and edit them into epub formats that are actually readable. I used the original book as a guide for formatting so it's as close to the original as I could get. Please feel free to leave feedback and I'll try and incorporate them into future torrents. I will be continuing editing the series but wanted to see if anyone had an opinion on what I should do differently.\n\nLike I said, this is my first torrent uploeading so if it doesn't work, please be patient and I will try to fix whatever issues come up. My computer does shut down at night (western US time zone) so obviously no seeds at that time so please help me out there.\n\nI will seed this torrent during the day until I finish the next book or 2 and then I will stop seeding this torrent and seed the next one (which will include all finished books)\n\nSo please comment and let me know what you think of my editing and what changes if any you'd like to see in future releases. (and for copyright purposes i do not own the content of the ebook; however, i was the one to painstakingly edit that content into paragraphs and chapters.)","torrent":{"xt":"urn:btih:30b6bc3b79170bed080fbda5ed83a8027f3c6d87","amp;dn":"Animorphs+-+Andalite+Chronicles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b6bc3b79170bed080fbda5ed83a8027f3c6d87","infoHashBuffer":{"type":"Buffer","data":[48,182,188,59,121,23,11,237,8,15,189,165,237,131,168,2,127,60,109,135]},"announce":[],"urlList":[]}}