{"title":"Houswife Kelly Boston Guy Pt 1 &amp; 2","uid":7822166,"size":474552904,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3112356fc09f4d00666a8b75a72e91652ac0921d&amp;dn=Houswife+Kelly+Boston+Guy+Pt+1+%26amp%3B+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"decodeme","files":2,"time":1352848189,"description":"\nEnjoy the best Housewife on the internet, and probably the best in the world HousewifeKelly!\n\n\nThe Code -- ***** -- MUST HAVE!! If you are a fan of threesomes, or swining. Kelly is amazing in this clip. The way she lets the Boston guy fuck her will make you cream in your pants.\n\nI have a great video for you this week! Shawn and I were in Boston about three weeks ago and I met this guy named, Rob at the bar. We got to talking and as it turned out, he actually recognized me from my website. We got to talking and he told me that he would love to fuck me on camera if I was interested. Well, since we had the camera out in the car and I always like to be fucked after a night out on the town, I took him up on his offer. Rob followed Shawn and me to a local hotel where I sucked and fucked both of them all night. Shawn mostly held the camera while Rob and me fucked one on one, but he still managed to join in a little bit. Rob and Shawn did me all night that night. We didn't leave the hotel until about 5 A.M. I'll have to break this video into two parts since we got so much footage.  ","torrent":{"xt":"urn:btih:3112356fc09f4d00666a8b75a72e91652ac0921d","amp;dn":"Houswife+Kelly+Boston+Guy+Pt+1+%26amp%3B+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3112356fc09f4d00666a8b75a72e91652ac0921d","infoHashBuffer":{"type":"Buffer","data":[49,18,53,111,192,159,77,0,102,106,139,117,167,46,145,101,42,192,146,29]},"announce":[],"urlList":[]}}