{"title":"Stuart: A Life Backwards (With Greek Subs)","uid":8519931,"size":734080132,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:32af3f99aa29b4e0a73b385e6acdebafffa7966f&amp;dn=Stuart%3A+A+Life+Backwards+%28With+Greek+Subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toniarec","files":3,"time":1369883858,"description":"Stuart: A Life Backwards is a biography by Alexander Masters of his friend Stuart Shorter, formerly, at various times, a prisoner and a career criminal. It explores how a young boy, somewhat disabled from birth, became mentally unstable, criminal and violent, living homeless on the streets of Cambridge. As the title suggests, the book starts from Shorter's adult life, and works backwards to trace Shorter's through his troubled childhood, examining the effects his family, schooling and disability had on his eventual state.\n\nThe book was shortlisted for the Whitbread Book Awards in 2005 for biography, and the 2006 Hawthornden Prize. t won the 2005 Guardian First Book Award. Recently many secondary schools across the UK have included it in their higher education academic syllabus for English language.\n\nA television dramatisation with the same name, starring Tom Hardy as Shorter and Benedict Cumberbatch as Masters. It was co-produced by the BBC and HBO in 2007. Tom Hardy was nominated for a 2008 BAFTA for his portrayal of Stuart Shorter\t","torrent":{"xt":"urn:btih:32af3f99aa29b4e0a73b385e6acdebafffa7966f","amp;dn":"Stuart%3A+A+Life+Backwards+%28With+Greek+Subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32af3f99aa29b4e0a73b385e6acdebafffa7966f","infoHashBuffer":{"type":"Buffer","data":[50,175,63,153,170,41,180,224,167,59,56,94,106,205,235,175,255,167,150,111]},"announce":[],"urlList":[]}}