{"title":"Buttman.Focused.5.DiSC1.XXX.DVDRip.x264-CHiKANi","uid":8519190,"size":1872646158,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:36a66d5a7475e3950a6d2a86cc92b8a445296b8c&amp;dn=Buttman.Focused.5.DiSC1.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":3,"time":1369859406,"description":"\nCategory Anal Movies, Compilation, Big Butts, Toy Play \n  \nDirector John Stagliano \nStarring Alexis Texas, Chastity Lynn, Allie Haze, London Keyes, Kelly Divine, Jynx Maze, Amy Brooke, Brooklyn Lee, Liza Del Sierra, Lea Lexis, Aline, Franceska Jaimes, Alison Tyler, Claire Adams, Angel Vain, Kara Price, Aiden Aspen, Briella Bounce, Roxy Raye, Mariah Mars \n\n\nButtman Focused # 5 porn A 'Focused' Perspective Of What You Obsess Over!\n\nPlus 3 Hours Of Focused Ass!\n\nWhat Is Focused? Focused Is Concentrated Porn. Each Section Is One Theme, With Many Different Girls!\n\nJust Ass, Just Boobs, Just Camel Toes, Just Buttholes, Etc!\n\n15 Different Obsessions! No Chit Chat! Just The Good Stuff!\n\nFocused: The Best Fix For Your Fetish! -John 'Buttman' Stagliano\n\nPorn pioneer John 'Buttman' Stagliano has done amazing work in all aspects of adult entertainment, but over the last years he's been turning his attention toward enthusiastic, kinky sluts in intense solo tease and explicit masturbation. In the Focused series, he edits all the action from his Stretch Class movies according to fetish-specific subject matter, creating smoking-hot footage precisely classified for the particular obsessions of viewers. 'Buttman Focused 5' is the latest deluxe two-disc release to employ this inventive concept; fans will discover that the laser-sharp focus of John's detailed sexual showcase lets them concentrate deeply on their favorite perversions. \n\nThe director has laboriously separated clips into sections covering: Wedgie; Cameltoe; My Nose, Your Crack; Tight Clothes &amp; Ass; Boobs; Tit Torture; Pussy Tease; Pussy Close-Up; Sucking; Cute Babes; Mirror Kiss; and Orgasms. Disc Two is three hours specially dedicated to nothing but focused ass, under two categories: Ass &amp; Gapes and Buttholes. And the adorable starlets performing in these thematic categorizations are a who's who of adult industry talent - gorgeous, uninhibited women who love to tease the camera, get off on being watched and will go to all extremes to explore pleasure. Alexis Texas, Allie Haze, Brooklyn Lee, Jynx Maze, Kelly Divine, Alison Tyler, Roxy Raye, Aiden Aspen, Lea Lexis, Mariah Mars, Angel Vain, Claire Adams, Chastity Lynn, Liza del Sierra, Franceska Jaimes, London Keyes, Kara Price, Briella Bounce and Aline guide you through the obsessions of your choice. 'Buttman Focused 5' is the best fix for your fetish! \n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=8960256.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=8960256.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=896025600.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=896025600.jpg&lt;/a&gt;\n\n\ncd1 &lt;a href=&quot;\nhttp://www.fastpics.net/?v=cd1wfmdj5s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=cd1wfmdj5s.jpg&lt;/a&gt;\n\ncd2 &lt;a href=&quot;\nhttp://www.fastpics.net/?v=cd2kfkxzql.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=cd2kfkxzql.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:36a66d5a7475e3950a6d2a86cc92b8a445296b8c","amp;dn":"Buttman.Focused.5.DiSC1.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36a66d5a7475e3950a6d2a86cc92b8a445296b8c","infoHashBuffer":{"type":"Buffer","data":[54,166,109,90,116,117,227,149,10,109,42,134,204,146,184,164,69,41,107,140]},"announce":[],"urlList":[]}}