{"title":"Symphony of Science","uid":7881958,"size":585250297,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:374b7bdf05aea1c9276cce67370e26b6c2a39da7&amp;dn=Symphony+of+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sun32123","files":16,"time":1354522619,"description":"Welcome to the Symphony of Science:- \n\nThe Symphony of Science is a musical project of John D Boswell, designed to deliver scientific knowledge and philosophy in musical form. The project owes its existence in large measure to the classic PBS Series Cosmos, by Carl Sagan, Ann Druyan, and Steve Soter, as well as all the other featured figures and visuals. Continuation of the videos relies on generous support from fans and followers. You can make a donation if you wish to contribute support to the project. Thanks to everybody who has donated - enjoy what you find!\n\n\n\nFROM THE CREATOR (I just compiled the videos found in www.symphonyofscience.com all thanks to the creator and not me):-\n\n\n&quot; Hey - I'm John D Boswell, the musician and producer behind the Symphony of Science. The goal of the project is to bring scientific knowledge and philosophy to the public, in a novel way, through the medium of music. Science and music are two passions of mine that I aim to combine, in a way that is intended to bring a meaningful message to listeners, while simultaneously providing an enjoyable musical experience. \n\nInspiration from The Gregory Brothers and DJ Steve Porter, coupled with my experience with remixing, composition, and auto-tune, led to experiments with remixing scientists, culminating in Carl Sagan's &quot;A Glorious Dawn&quot; in Fall of 2009. \n\nThis first video's highly positive reception provided motivation to elaborate on the theme of remixing scientists, which spawned the Symphony of Science project. Although the methods of remixing and tuning spoken word, combined with original electronic music and similarly themed footage, are unorthodox in the context of other science-themed music, the results have often been inspiring, humbling, and of course humorous. \n\nThe project has now produced 15 full length music videos (see the home page)(www.symphonyofscience.com), and expanded to include and rely on input from the community and collaborations with peers. Since its launch in Fall 2009, Symphony of Science has been featured on NPR, Wired, Adult Swim, The Scientist, Attack of the Show, The Skeptics Guide to the Universe, Bad Astronomy, The Examiner, net@night, and many more outlets. The videos have attracted over 25 million views online, resulting in the release of A Glorious Dawn on a special 7&quot; 45rpm vinyl single through Jack White's record label Third Man Records, as well as a compilation album of all the songs to date.\n\nAfter the release of the tenth video, I released an album compiling all the songs, plus an unreleased track. It is updated with each new song and can be downloaded for free here.\n\nEverything on the site is provided for free; if you like what you see and hear, please consider contributing to the project, or following my work via the social networking links at the top of the page. Thanks for visiting the site. Enjoy what you find! &quot; \n[The above quoted paragraphs are directly pasted from the link: http://symphonyofscience.com/about.html]\n\n\nTHIS IS MY FIRST TORRENT SO PLEASE SEED GUYS, YOU WILL FIND IT INTERESTING!!!\nThank You!!\n","torrent":{"xt":"urn:btih:374b7bdf05aea1c9276cce67370e26b6c2a39da7","amp;dn":"Symphony+of+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"374b7bdf05aea1c9276cce67370e26b6c2a39da7","infoHashBuffer":{"type":"Buffer","data":[55,75,123,223,5,174,161,201,39,108,206,103,55,14,38,182,194,163,157,167]},"announce":[],"urlList":[]}}