{"title":"Crime Patrol - Episode 180 - 18th November 2012","uid":7853767,"size":132127380,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:37e46766c2eec139cd2b9aeb48ecd2bdfc60f29d&amp;dn=Crime+Patrol+-+Episode+180+-+18th+November+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"a.kasimji","files":1,"time":1353682805,"description":"Crime Patrol attempts to bring stories of crime happening all around the country. \nHowever the case presentation would be a story telling form that would have the interest of a fiction drama presentation. The prelude and finale to the case would make the case a complete story. \nInteractions with the analysts on the show would be treated with the audience interest point of view keeping it only as much as essential to the story telling. Going beyond the drama of police action in a crime situation, the show also aims to look into the &quot;why&quot; behind a crime. Police action on one hand gives the show the edge of how the law keepers bring the culprits to book or stop a crime from being committed. \nOn the other hand, the show will also be looking at the sociological aspect behind a crime- both from the victim as well as the criminal's side. The cases would be driven by cameras moving along with the police force from the time a crime is reported or when the police receive a call till the point the case is brought to a logical conclusion in the police records for further movement in the court of law.","torrent":{"xt":"urn:btih:37e46766c2eec139cd2b9aeb48ecd2bdfc60f29d","amp;dn":"Crime+Patrol+-+Episode+180+-+18th+November+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e46766c2eec139cd2b9aeb48ecd2bdfc60f29d","infoHashBuffer":{"type":"Buffer","data":[55,228,103,102,194,238,193,57,205,43,154,235,72,236,210,189,252,96,242,157]},"announce":[],"urlList":[]}}