{"title":"Criminal Minds S08E08 HDTV Nl subs DutchReleaseTeam","uid":7876692,"size":368989499,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:399e6d292c648b84fe12b157b5c21e5f2850cf9c&amp;dn=Criminal+Minds+S08E08+HDTV+Nl+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Koedje","files":-1,"time":1354367050,"description":" &lt;a href=&quot;http://img851.imageshack.us/img851/1084/criminalmindsi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img851.imageshack.us/img851/1084/criminalmindsi.jpg&lt;/a&gt;\n\n\nPlot:\n\nCriminal Minds lost problemen op rond het land. Dit team van elite FBI profilers analyse de meeste verdraaide criminale gedachten. Ze anticiperen hier op en reageren voor de volgende aanval is gebeurt. David Rossi (Joe Mantegna) komt terug van zijn pension om de Behavioral Analysis Unit terug te helpen. Deze unit geleidt bij Aaron Hotchner (Thomas Gibson) een familie man die capabele is om zijn mensen vertrouwen te winnen en het verkrijgen van al een geheimen. Ook in het team zitten Emily Prentiss (Paget Brewster) zij is de dochter van een ambassadrice en een verrassende toevoeging aan het team; Derek Morgan (Shemar Moore) een expert in dwangmatig crimineel gedrag; Dr. Spencer Reid (Matthew Gray Gubler) een klassiek voorbeeld van onbegrepen genie zijn sociaal IQ is zo laag als zijn intelligentie IQ hoog is. Ook is er Jennifer 'JJ' Jareau (A.J. Cook) een zelfverzekerde jonge agent, haar taak binnen het team is het uitzoeken van de zaken waar het team heen gaat zij verzorgt ook het contact met de verschillende bureaus. Dan is er nog Penelope Garcia (Kirsten Vangsness) zij helpt het team als geluid en beeld technicus. Elk team lid brengt zijn eigen expertise mee om de criminelen boven tafel te krijgen. Ze hebben allemaal hun eigen (emotionele) motivatie om de criminele tot een stop te brengen.\n\n\nVertaling: Sophie V en Laura F.\n\n\nSeizoen 8 Aflevering 8: The Wheels on the Bus\n\nHet BAU-team gaat in de achtervolging van een ontbrekende schoolbus vol met kinderen in de Washington, DC regio, en het wordt een race tegen de klok voor hen om ze veilig thuis te brengen.\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.org/\n\n\nFollow me on #Twitter @Koedje\n\n\nDutchReleaseteam = Hardcoded Dutch Sub","torrent":{"xt":"urn:btih:399e6d292c648b84fe12b157b5c21e5f2850cf9c","amp;dn":"Criminal+Minds+S08E08+HDTV+Nl+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"399e6d292c648b84fe12b157b5c21e5f2850cf9c","infoHashBuffer":{"type":"Buffer","data":[57,158,109,41,44,100,139,132,254,18,177,87,181,194,30,95,40,80,207,156]},"announce":[],"urlList":[]}}