{"title":"Quake 2 v3.24 Russian Edition w/ Server Browser &amp; SGM MOD","uid":8530600,"size":156790700,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3c09408c25380c00702a2294ff58146f81714751&amp;dn=Quake+2+v3.24+Russian+Edition+w%2F+Server+Browser+%26amp%3B+SGM+MOD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xbox06032","files":1,"time":1370136710,"description":"This is QUAKE 2 VERSION 3.24 RUSSIAN EDITION with SGM MOD (Stroggs Gone Mad) + Server Browser.\nFor being what typically Quake II is, this is a rather original appearing yet complex variant of the game. Many\nparts and subparts of the game has been updated, uprgraded or patched. Work has been done to all of the\ngamex86.dll from CTF, Baseq2, Rogue and Xatrix. The stack in the game's main executable has been increased \n16 x times. You also may enjoy some music as well now of yoru own.\n\n To hear Ogg Vorbis tracks in game, rip the Q2 CD's audio tracks (2-11) to track02-track11.ogg\nand put them in baseq2/music.  For the mission pack audio tracks, rip the Ground Zero CD's\naudio tracks (2-11) to track12-track21.ogg.  Don't bother ripping the tracks from the\nReckoning CD, as they're a mix of the tracks on the Q2 and Ground Zero CDs.  Everything else\nwill be taken care of internally.\n\nThe version 3.24 was a simple, no-frills patch that fixes bugs (including the nVidia 191.x driver\ncrash) and adds only meager tweaks aside from Ogg Vorbis support.  Intended for\nQuake2 purists who have been using the woefully out of date version 3.20, it is not\nintended to add new features or be an engine mod in its own right however it's\na great unofficial improvement. One accepted by the Quake II community and\ndown right welcomed.\n\nWe also fixed (Hopefully) all of the issues experienced with Russian Edition's\n3.20 thru 3.23. Went as far as to remove our 'Easter Eggs&quot; as well\nas our Audio and Texture additions. The MOD we included in 3.24\nyou are able to play the game WITH OR WITHOUT unlike before!\nYou now have shortcuts to the Original  game, game with MOD\nfor Single Player, COOP, DM etc. Keep on Fragging!!","torrent":{"xt":"urn:btih:3c09408c25380c00702a2294ff58146f81714751","amp;dn":"Quake+2+v3.24+Russian+Edition+w%2F+Server+Browser+%26amp%3B+SGM+MOD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c09408c25380c00702a2294ff58146f81714751","infoHashBuffer":{"type":"Buffer","data":[60,9,64,140,37,56,12,0,112,42,34,148,255,88,20,111,129,113,71,81]},"announce":[],"urlList":[]}}