{"title":"PUMP UP THE VOLUME [1990] COMPLETE by cheublawm","uid":7894660,"size":1423211988,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3cd5f2955aaad19b52bb1aaaa5c9f40684577c53&amp;dn=PUMP+UP+THE+VOLUME+%5B1990%5D+COMPLETE+by+cheublawm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cheublawm","files":-1,"time":1354806563,"description":"MOVIE TITLE:\tPump Up The Volume [2001]COMPLETE &amp; RE-EDITED\n\nFILE SIZE:\t1.33GB XVID (AVI)\n\nDURATION:\t2H 15MIN\n\nVIDEO: \t\t720x360, 2:1, 29fps\n\nAUDIO: \t\tMP3, 192kbps @ 48KHz, Stereo\n\nIMDb ID:\t \ttt0847411\n\nBAYIMG:\t\tHAGIBaaEn \n\nTAGS: \t\thouse music, movie, documentary, DJ,  Frankie Knuckles, Ron \n\nHardy, Marshall Jefferson, UK, Channel 4\n\nIMDb RATING:\t9.0\n\n\nSUMMARY:\n\nHouse Generation tells the story of the social and cultural explosion that was House. From its roots in Chicago, where it grew out of the ashes of Disco. House music has risen to become the soundtrack to every fashion show, after-show party, premiere and club opening around the world. Today, House is used by many of the leading mainstream music stars - Madonna, Kylie Minogue, U2, Boy George - to break new markets and update their sound, and has influenced more people than any style since rock 'n' roll. \nThe series will take the story from Chicago and New York via Ibiza to Britain, interviewing key players on both sides of the Atlantic including Alfredo. Paul Oakenfold, Carl Cox and the people behind the superclubs like Ministry of Sound and Cream. It will also consider the social effect of House - a sound that has transcended all class, race and cultural boundaries, to become the soundtrack of modern popular culture.\n\nREVIEW:\n\nIf you've ever been clubbing, this History of House Music is a must see. Starting out with the funky disco days of 70s New York, it goes in-depth and tells how house music was born, what it meant and how it evolved into a myriad of different genres and spread across the globe. We are shown locations of legendary clubs, record companies and shops, introduced to different ways of dj'ing, and get to see how advances in technology has influenced the music. Long interviews of household names like Paul Okenfold, Carl Cox, Pete Tong, Goldie, The Shamen, Leftfield, Underworld, Youth, Tony Wilson, and Armin van Helden to name just a few. \n\nEnjoy as always guys!!\n\ncheublawm","torrent":{"xt":"urn:btih:3cd5f2955aaad19b52bb1aaaa5c9f40684577c53","amp;dn":"PUMP+UP+THE+VOLUME+%5B1990%5D+COMPLETE+by+cheublawm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cd5f2955aaad19b52bb1aaaa5c9f40684577c53","infoHashBuffer":{"type":"Buffer","data":[60,213,242,149,90,170,209,155,82,187,26,170,165,201,244,6,132,87,124,83]},"announce":[],"urlList":[]}}