{"title":"Buttman.Focused.5.XXX.DVDRip.x264","uid":8524657,"size":3400726689,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3d0ec2dc86968f2b7a4b6e33006bb609ae9a3b4a&amp;dn=Buttman.Focused.5.XXX.DVDRip.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":2,"time":1369999761,"description":"Gallery and Description:\n &lt;a href=&quot;\nhttp://imgload.me/img-51a86d3e8f25c.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-51a86d3e8f25c.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://imgload.me/img-51a86d3e9418f.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-51a86d3e9418f.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://imgload.me/img-51a86d3ea789b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-51a86d3ea789b.html&lt;/a&gt; \n\n\nGenre: Gonzo\nDirected by: John Stagliano\nStarring: Alison Tyiler, Roxy Raye, Aiden Aspen, Lea Lexis, Mariah Mars, Angel Vain, Jynx Maze, Alexis Texas, Allie Haze, Brooklyn Lee, Kelly Divine, Claire Adams, Chastity Lynn, Liza Del Sierra, Franceska Jaimes, London Keyes, Kara Price, Briella Bounce, Aline\n\nAbout the film: Porn pioneer John Buttman Stagliano has done amazing work in all aspects of adult entertainment, but over the last years hes been turning his attention toward enthusiastic, kinky sluts in intense solo tease and explicit masturbation. In the Focused series, he edits all the action from his Stretch Class movies according to fetish-specific subject matter, creating smoking-hot footage precisely classified for the particular obsessions of viewers. Buttman Focused 5 is the latest deluxe two-disc release to employ this inventive concept; fans will discover that the laser-sharp focus of Johns detailed sexual showcase lets them concentrate deeply on their favorite perversions. The director has laboriously separated clips into sections covering: Wedgie; Cameltoe; My Nose, Your Crack; Tight Clothes and Ass; Boobs; Tit Torture; Pussy Tease; Pussy Close-Up; Sucking; Cute Babes; Mirror Kiss; and Orgasms. Disc Two is three hours specially dedicated to nothing but focused ass, under two categories: Ass and Gapes and Buttholes. And the adorable starlets performing in these thematic categorizations are a whos who of adult industry talent gorgeous, uninhibited women who love to tease the camera, get off on being watched and will go to all extremes to explore pleasure. Alexis Texas, Allie Haze, Brooklyn Lee, Jynx Maze, Kelly Divine, Alison Tyler, Roxy Raye, Aiden Aspen, Lea Lexis, Mariah Mars, Angel Vain, Claire Adams, Chastity Lynn, Liza del Sierra, Franceska Jaimes, London Keyes, Kara Price, Briella Bounce and Aline guide you through the obsessions of your choice. Buttman Focused 5 is the best fix for your fetish!\n\nIssued: USA / Evil Angel\nDuration: 6:21:55\nLanguage: English\n\nFile\nQuality: DVDRip\nFormat: MP4\nVideo: MPEG4 Video (H264) 672x378 29.97fps 1174kbps\nAudio: AAC 48000Hz stereo 95kbps","torrent":{"xt":"urn:btih:3d0ec2dc86968f2b7a4b6e33006bb609ae9a3b4a","amp;dn":"Buttman.Focused.5.XXX.DVDRip.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d0ec2dc86968f2b7a4b6e33006bb609ae9a3b4a","infoHashBuffer":{"type":"Buffer","data":[61,14,194,220,134,150,143,43,122,75,110,51,0,107,182,9,174,154,59,74]},"announce":[],"urlList":[]}}