{"title":"Evil Angel - Gape Me [Split Scenes] [720p] [mp4]","uid":7872363,"size":6188320223,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3e96c1d2ba08f4d5fa503ffe0c176e2f26099836&amp;dn=Evil+Angel+-+Gape+Me+%5BSplit+Scenes%5D+%5B720p%5D+%5Bmp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"R0thschild","files":7,"time":1354243632,"description":"Director Jonni Darkko`s XXX films are known for artful photographic prowess, model-quality beauties and wet, graphic sexual filth! His newest DVD plunges deeply into the hot sexual niche du jour: Jonni`s Gape Me presents some of the world`s hottest current female porn talent in lust-dripping anal scenes that leave the tight bungholes splayed, stretched and widely dilated. The disc includes a solo bonus scene starring Adrianna Nicole, behind-the-scenes footage, cast list, filmographies, and trailers. Nasty, young cutie Jynx Maze shows why she`s becoming porn`s latest it girl, taking a huge prick up her ass in her spunky, incorrigible style, and holding her gaping anus open for the camera. Delectable Asian beauty Asa Akira doesn`t just look stunning on the box cover; she gets worked over by three hard pricks, and a rectal reaming makes her expansive anus gape spectacularly. Big-assed blonde Phoenix Marie can handle more than a glass butt plug... A cock-and-dildo double-penetration leaves.\n\nAsa Akira, Phoenix Marie, Mark Ashley, Chanel Preston, Jynx Maze, Prince Yahshua, Jordan Ash, Jonni Darkko, Winston Burbank, Tori Lux\n\nScene 1 - Tori Lux\n\nTori Lux, a tattooed brunette with a great ass, was up first as she  teased during the thumping loud soundtrack, a glass dildo slowly worked  into her perfect pucker with ease. The tease led to a brief verbal  exchange with Prince Yahshua, the gal sitting him down to admire his  cock leading to the man eating her out and using some large toys to  stretch her out while she slobbed his knob in sloppy fashion. While  there did not appear to be a lot of chemistry between them, I did sense a  connection of sorts while the two gave a performance for the camera,  the anal tricks and taste testing being the dominant sexual acts before  he beat out a round of spunk to her face. She gave him some post coital  head and ended up with a semen goatee too, not a bad opener at all. \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=966626&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=966626&lt;/a&gt;\n\nScene 2 - Phoenix Marie\n\nPhoenix Marie, a popular blond anal queen wearing a gray retile print  dress with no panties on, was up next as she briefly masturbated anally.  Jordan Ash walked in too early to start pounding her ass, the short  changing of tease footage weakening the scene for me substantially.  Phoenix did provide some great dirty talk and easily handled his pecker  anally (and orally), a technical DP pushing her limits no further than  his modest member as the toys grew larger and she ended up with a wad of  genetic juice to her face.\n &lt;a href=&quot;\nhttp://imagedomino.com/?g=981814&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=981814&lt;/a&gt;\n\nScene 3 - Asa Akira\n\nAsa Akira, the sexy Asian babe featured on the front cover, was up next as she took on Mark Ashley, Winston Burbank, and Jonni Darkko;  all pretenses of building heat and chemistry disposed of early on as  they hammered her ass and mouth. Mark did get her off with his hand but  he was more open to her sitting on his face and doing some 69 as well  before he rewarded her with a facial of population pudding. That was  followed by her oral efforts on the others who dropped loads of sperm on  her mug, the glazed look seemingly working for her. \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=809065&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=809065&lt;/a&gt;\n\nScene 4 - Jynx Maze\n\nJynx Maze, a sultry Latina with a sweet fleshy ass and  attractive face, was up next as she teased the camera before strutting  her stuff for Mark Ashley. Her booty shaking was mesmerizing and the  fishnet top worked for my libido too, the subdued music an upgrade over  the headache inducing material the director tends to favor. He ate her  ass and fingered it before tearing her ass up with his pecker, Jynx  giving some dirty talk to drive him ever harder. He dove into her pussy  as well but the emphasis was on the anal antics, Mark tossing off a  round of spunk all over her body.\n &lt;a href=&quot;\nhttp://imagedomino.com/?g=164010&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=164010&lt;/a&gt;\n\nScene 5 - Chanel Preston\n\nChanel Preston, a curvy babe that has been winning all  sorts of awards since joining the industry, was up last as she caressed  her curvy ass and other body parts to a light beat in the house. She  wore bikini underwear and fingered her asshole on the stairs, moving to  the bedroom where she was sitting on the face of Mark Ashley in a rather  abrupt edit. The 69 and other oral tricks led to various penetrative  acts using her pussy and ass, some pearls and other toys used as a  sideshow of sorts until her wonderfully solid hummer left streamers  hanging from her mouth. More pounding led to him rubbing out a facial  and then the credits rolled, something missing from this scene as well  making me want to dissect it more.\n &lt;a href=&quot;\nhttp://imagedomino.com/?g=687116&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=687116&lt;/a&gt;\n\n\nScene 6 - Adrianna Nicole\n\nAnd tasty-but-nasty blonde Adrianna Nicole gets down in a bonus solo scene\n &lt;a href=&quot;\nhttp://imagedomino.com/?g=580621&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=580621&lt;/a&gt;","torrent":{"xt":"urn:btih:3e96c1d2ba08f4d5fa503ffe0c176e2f26099836","amp;dn":"Evil+Angel+-+Gape+Me+%5BSplit+Scenes%5D+%5B720p%5D+%5Bmp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e96c1d2ba08f4d5fa503ffe0c176e2f26099836","infoHashBuffer":{"type":"Buffer","data":[62,150,193,210,186,8,244,213,250,80,63,254,12,23,110,47,38,9,152,54]},"announce":[],"urlList":[]}}