{"title":"Murder.Files.S01E03.Killer.On.The.Run.VeroVenlo","uid":7940407,"size":418880502,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ec9dc420d4353973323de202f20df315989fd15&amp;dn=Murder.Files.S01E03.Killer.On.The.Run.VeroVenlo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verovenlo","files":1,"time":1355964518,"description":"In this episode of Murder Files, friends of the Entwistles reveal their thoughts on an apparently happy family. There is also exclusive scientific analysis of Neil Entwistle's voice patterns from audio footage of a telephone call between him and a US State Trooper, while he was back in the UK at his parents' house in Worksop.\n\nEntwistle had flown back to his parents' home in Nottinghamshire after discovering the bodies, without even raising the alarm. After a two-week stalemate, US authorities received an extradition warrant and Entwistle stood trial for murder in 2008.\n\nHe claimed that his wife had killed both the baby and herself in a fit of depression. Remarkably, when shown a video of his murdered family during the trial, he appeared to smile.\n\nHis story simply did not fit with the one he gave police on the phone 18 months earlier. He now claimed that when he found his wife and daughter there had been a gun beside them and that he returned that gun to his father-in-law's property to protect his wife's name.\n\nExclusive expert analysis of his evidence by one of Britain's leading firearms experts confirms that it would have been nearly impossible for Rachel to have killed herself with the weapon he described.\n\nAfter hearing more on Entwistle's finances and use of escort services, the jury found him guilty and he was sentenced to life without parole. His parents still protest his innocence.","torrent":{"xt":"urn:btih:3ec9dc420d4353973323de202f20df315989fd15","amp;dn":"Murder.Files.S01E03.Killer.On.The.Run.VeroVenlo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec9dc420d4353973323de202f20df315989fd15","infoHashBuffer":{"type":"Buffer","data":[62,201,220,66,13,67,83,151,51,35,222,32,47,32,223,49,89,137,253,21]},"announce":[],"urlList":[]}}