{"title":"Paranormal v1.0,1 Final [DRM Free]","uid":7875306,"size":486083863,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:44714299764c49690e748cd2041b3fd8f08a175b&amp;dn=Paranormal+v1.0%2C1+Final+%5BDRM+Free%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SSJASON","files":-1,"time":1354321960,"description":"Screens: &lt;a href=&quot;\nhttp://i.imgur.com/zPb1T.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/zPb1T.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/1LM17.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/1LM17.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/eEmTk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/eEmTk.jpg&lt;/a&gt;\n\nExperience the horrors of a haunting that's never the same twice.\nParanormal is a 3D fully dynamic haunting experience. The player takes the role of Mattel Clark, an artist who has a haunted house. Mattel decides to film the hauntings with his camera, which is the viewpoint of the game.The player controls the camera as the hauntings slowly but surely escalate into something far worse and more horrific. \n\nWith multiple endings, a different experience every time, top-notch graphics and sound, Paranormal is a constantly evolving indie horror game. \nRELEASE DATE: October 19th 2012 (currently available on Desura, will be on Steam as soon as allowed).\nEvery vote counts! Let's get Paranormal on Steam! Thank you so much for supporting the game! \n\nFeatures:\nFree Content Updates: Paranormal will receive free content updates that add new locations, stories, scenarios, scares, gameplay mechanics, and more! You will NEVER have to pay for DLC in Paranormal. The game's content is planned to double or even triple with each major content update.\nCollectibles: In your bedroom, there's a shelf where all the collectibles you find are displayed.\nSleep System: Sleeping in your bed recharges your camera's batteries and also has a chance of triggering other events.\nFlashlight (camera light): Creates a bright, short ranged light that casts dynamic shadows.\nNewer sound effects: I've totally redone the sound in the game, optimizing it for surround sound or headphones.\nController support: The game will launch with full XBOX 360 Controller support, as well as native Mouse + Keyboard.\nDynamic Haunting: I've revamped the dynamic haunting features from the tech demo I released, adding multiple outcomes, dynamic triggers, countless variables, and an action-reaction system. This will make your experience with the game much more unique and memorable, without missing out on anything important.\nFirst-Person Camera: Much like in the movies 'Paranormal Activity' or 'The Blair Witch Project', the viewpoint will be that of a camera being held by a person (the player). Effects like camera shake, pixelation, video distortion, audio distortion, and motion blur will all be present thanks to the camera screen-space shader I built for everything.\nHorrific Story: Uncover the house's troubled and gruesome past through hauntings, journal entries from the previous owner, and more.\nPC and Mac Support: Paranormal will launch with both PC and Mac support. Nobody is spared from the haunting.\nAchievements: Steam Achievements are planned for the game and there will be plenty to chase after!\nIndie In Every Sense Of The Word: The game itself is designed by one guy: Matt Cohen (me). I have a 3D modeller and voice actors. That's it. No huge team. No huge budget. Just a lot of ambition and late nights.","torrent":{"xt":"urn:btih:44714299764c49690e748cd2041b3fd8f08a175b","amp;dn":"Paranormal+v1.0%2C1+Final+%5BDRM+Free%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44714299764c49690e748cd2041b3fd8f08a175b","infoHashBuffer":{"type":"Buffer","data":[68,113,66,153,118,76,73,105,14,116,140,210,4,27,63,216,240,138,23,91]},"announce":[],"urlList":[]}}