{"title":"Doug Tennapel: Gear # 1-6","uid":8606357,"size":100161148,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:454c114b30f8af00516cea027abf23df55f05387&amp;dn=Doug+Tennapel%3A+Gear+%23+1-6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fudoh101","files":6,"time":1372025365,"description":"6 issues series published by Firewood Press in 1998. Art and writing by Doug Tennapel.\n\nDoug TenNapel is a Californian comic artist, as well as a musician, animator and film maker. Born in Norwalk and raised in Denair, he got his Bachelor's Degree in arts from the Point Loma Nazarene University in 1988. He started his career as an animator on 'Attack of the Killer Tomatoes' and then began working in the video game industry in the early 1990s.\n\nHe participated in the development of games for the Sega Genesis and Super Nintendo and is best known for creating 'Earthworm Jim' for Shiny Entertainment. The character not only got its own video game, but also a toy line and cartoon series. created the game and comic series 'Earthworm Jim'. Another popular game he invented is 'The Neverhood' (1998) for Dreamworks, as well as its follow-up 'Skullmonkeys'. He also remained active in the TV world, developing and creating shows for CBS, ABC and Nickelodeon.\n\nTenNapel's first comic book was 'GEAR', a epic tale of a cat war against dogs and insects, published by Firewood Press in 1998. The cats from the series, that were based on his real-life cats, later starred in the Nickelodeon series 'Catscratch'.","torrent":{"xt":"urn:btih:454c114b30f8af00516cea027abf23df55f05387","amp;dn":"Doug+Tennapel%3A+Gear+%23+1-6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"454c114b30f8af00516cea027abf23df55f05387","infoHashBuffer":{"type":"Buffer","data":[69,76,17,75,48,248,175,0,81,108,234,2,122,191,35,223,85,240,83,135]},"announce":[],"urlList":[]}}