{"title":"Prison Pit: Book One","uid":7832981,"size":70068621,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:46ce9765738645bff0e8fbc1b9dbcb28fa16eddb&amp;dn=Prison+Pit%3A+Book+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353116515,"description":"Prison Pit is an original graphic novel from the pen of Johnny Ryan, best known for his humor comic, Angry Youth Comix. Prison Pit represents a marked departure from AYC or his Blecky Yuckerella weekly comic strip, combining his love for WWE wrestling, Gary Panter's &quot;Jimbo&quot; comics, and Kentaro Miura's &quot;Berserk&quot; Manga into a brutal showcase of violence, survival and revenge. Imagine a blend of old-fashioned role playing fantasy games like Dungeons &amp; Dragons crossed with contemporary adult video games like Grand Theft Auto, filtered through Ryan's sense of humor. The book begins with C.F. (his full-name would be too horrifying to reveal here) being thrown into the Prison Pit, a barren negative-zone populated by intergalactic, violent monster criminals. In this first volume, C.F. gets into a bloody slorge war (a slorge is a giant slug that excretes a steroid-like drug called &quot;fecid&quot; that all the monster men are addicted to) with ultraprisoner Rottweiler Herpes and his henchmen Rabies Bloodbath and Assrat. The ensuing bloodbath is an over-the-top, hyperviolent yet hilarious farce worthy of Ryan's inspiration, Kentaro Miura. ","torrent":{"xt":"urn:btih:46ce9765738645bff0e8fbc1b9dbcb28fa16eddb","amp;dn":"Prison+Pit%3A+Book+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46ce9765738645bff0e8fbc1b9dbcb28fa16eddb","infoHashBuffer":{"type":"Buffer","data":[70,206,151,101,115,134,69,191,240,232,251,193,185,219,203,40,250,22,237,219]},"announce":[],"urlList":[]}}