{"title":"OVER FIELDS OF FIRE: Flying the Sturmovik in Action on the Easte","uid":8650230,"size":4968306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48913f4a3e838d8428d2b3b9cb634b6ec3b09dd7&amp;dn=OVER+FIELDS+OF+FIRE%3A+Flying+the+Sturmovik+in+Action+on+the+Easte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Djofullinn","files":1,"time":1373077517,"description":"During the 1930s the Soviet Union launched a major effort to create a modern Air Force. That process required training tens of thousands of pilots. Among those pilots were larger numbers of young women, training shoulder to shoulder with their male counterparts. A common training program of the day involved studying in 'flying clubs' during leisure hours, first using gliders and then training planes. Following this, the best graduates could enter military schools to become professional combat pilots or flight navigators. The author of this book passed through all of those stages and had become an experienced training pilot when the USSR entered the war.Volunteering for frontline duty, the author flew 130 combat missions piloting the U2 biplane in a liaison squadron. In the initial period of the war, the German Luftwaffe dominated the sky. Daily combat sorties demanded bravery and skill from the pilots of the liaison squadron operating obsolete, unarmed planes. Over the course of a year the author was shot down by German fighters three times but kept flying nevertheless.In late 1942 Anna Egorova became the first female pilot to fly the famous Sturmovik (ground attack) plane that played a major role in the ground battles of the Eastern Front. Earning the respect of her fellow male pilots, the author became not just a mature combat pilot, but a commanding officer. Over the course of two years the author advanced from ordinary pilot to the executive officer of the Squadron, and then was appointed Regimental navigator, in the process flying approximately 270 combat missions over the southern sector of the Eastern Front initially (Taman, the Crimea) before switching to the 1st Belorussian Front, and seeing action over White Russia and Poland.Flying on a mission over Poland in 1944 the author was shot down over a target by German flak. Severely burned, she was taken prisoner. After surviving in a German POW camp for 5 months, she was liberated by Soviet troops. After experiencing numerous humiliations as an 'ex-POW' in 1965 the author finally received a top military award, a long-delayed 'Golden Star' with the honorary title of 'Hero of the Soviet Union'. This is a quite unique story of courage, determination and bravery in the face of tremendous personal adversity. The many obstacles Anna had to cross before she could fly first the Po-2, then the Sturmovik, are recounted in detail, including her tough work helping to build the Moscow Metro before the outbreak of war. Above all, Over Fields of Fire is a very human story - sometimes sad, sometimes angry, filled with hope, at other times with near-despair, abundant in comradeship and professionalism - and never less than a large dose of determination! \n\nABOUT THE AUTHOR\n\nAnna Alexandrovna Timofeeva-Egorova was born on 23 September 1916. After attending school she had hoped to learn to fly but this wish was delayed due to one of her brother's becoming a victim of the Communist security system, which deemed him an 'enemy of the people'. After a number of setbacks Anna learned to fly, and during the first part of the Great Patriotic War flew Po-2 biplanes for the 130th Aviation Signals Squadron, being shot down three times. She then switched to flying the fearsome Ilyushin Il-2 Sturmovik ground-attack aircraft with the 805th Ground Attack Regiment (805 ShAP), 197th Ground Attack Division. Anna flew approximately 270 combat missions before being shot down in the summer of 1944, being severely injured and taken prisoner by the Germans. Thanks to her determination, and the skill, dedication, care and kindness of numerous individuals, she made a remarkable recovery and was liberated when the Soviets overran her POW camp near Kustrin in 1945. However, her troubles were not over, as the Soviet authorities initially believed her to be a traitor and collaborator and subjected her to 11 days of continuous interrogations. She was released, although her injuries were such that was medically discharged from the Air Force in 1945. She continued to fight to clear her name after the war - she was eventually reinstated into the Communist Party and in 1965 finally received the award of 'Hero of the Soviet Union'. She died in October 2009.\n &lt;a href=&quot;\nhttp://www.amazon.com/OVER-FIELDS-FIRE-Sturmovik-Memories/dp/1906033277/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373069219&amp;sr=1-1&amp;keywords=over+fields+of+fire&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/OVER-FIELDS-FIRE-Sturmovik-Memories/dp/1906033277/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373069219&amp;sr=1-1&amp;keywords=over+fields+of+fire&lt;/a&gt;","torrent":{"xt":"urn:btih:48913f4a3e838d8428d2b3b9cb634b6ec3b09dd7","amp;dn":"OVER+FIELDS+OF+FIRE%3A+Flying+the+Sturmovik+in+Action+on+the+Easte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48913f4a3e838d8428d2b3b9cb634b6ec3b09dd7","infoHashBuffer":{"type":"Buffer","data":[72,145,63,74,62,131,141,132,40,210,179,185,203,99,75,110,195,176,157,215]},"announce":[],"urlList":[]}}