{"title":"A Good Day to Die Hard (2013) - HD Bluray Rip X264 English - AC3","uid":8670520,"size":2540372845,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:48af99774ada61464a75d9960ad6e96f6cc004e3&amp;dn=A+Good+Day+to+Die+Hard+%282013%29+-+HD+Bluray+Rip+X264+English+-+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KidAtomic","files":1,"time":1373488139,"description":"Ripped from Blu Ray. High Quality Video\n\nA Good Day to Die Hard is a 2013 American action film directed by John Moore and written by Skip Woods. Featuring the John McClane character that was based on the protagonist of Nothing Lasts Forever by Roderick Thorp, it is the fifth installment in the Die Hard film series. Bruce Willis reprises the lead role of John McClane, who travels to Russia to help his estranged son, Jack (Jai Courtney), out of prison, but is soon caught in the crossfire of a terrorist plot.\n\nTalks of a fourth sequel to Die Hard (1988) began before the release of Live Free or Die Hard (2007), with Willis affirming that the latter would not be the last in the series, but pre-production did not start until September 2011, when John Moore was officially announced as the director. Filming began in April 2012, primarily in Budapest, Hungary.\n\nA Good Day to Die Hard premiered in Los Angeles on January 31, 2013, coinciding with the unveiling of a Die Hard mural at the Fox Lot,[2] and was released in certain East and Southeast Asian territories on February 7 and in the United States and Canada on the Wednesday night of February 13.[3] It is the first Die Hard film to use Dolby Atmos Surround Mixing and the first to also be released in IMAX theaters.\n\nIconoclastic, take-no-prisoners cop John McClan efor the first time finds himself on foreign soil after traveling to Moscow to help his wayward son Jack -- unaware that Jack is really a highly-trained CIA operative out to stop a nuclear weapons heist. With the Russian underworld in pursuit, and battling a countdown to war, the two McClanes discover their opposing methods make them unstoppable heroes.\n\nStarring:\nBruce Willis\nJai Courtney\nSebastian Koch\nYuliya Snigir\nRadivoje BukviÄ‡\nCole Hauser\n\n","torrent":{"xt":"urn:btih:48af99774ada61464a75d9960ad6e96f6cc004e3","amp;dn":"A+Good+Day+to+Die+Hard+%282013%29+-+HD+Bluray+Rip+X264+English+-+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48af99774ada61464a75d9960ad6e96f6cc004e3","infoHashBuffer":{"type":"Buffer","data":[72,175,153,119,74,218,97,70,74,117,217,150,10,214,233,111,108,192,4,227]},"announce":[],"urlList":[]}}