{"title":"POtHS 2 - Bible Study - Part 115 - New Age Emerging Church One W","uid":7868454,"size":5566668502,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:49b0d2cce763a4f46e0d5874ae77c28e44901a0f&amp;dn=POtHS+2+-+Bible+Study+-+Part+115+-+New+Age+Emerging+Church+One+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1354124967,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Bible Study - 115 - New Age Emerging Church One World Religion Vol 8 - Legend of Atlantis, Roots of Deception\n\n\nPOtHS Comment: His BLOOD is the only thing that Redeems us.\n\nDescription:\n\nLegend Of Atlantis - Roots of Satans Deceptions:\nCivilizations around the world are full of mythologies about many strange God like beings. Are they really just mythology? Or could there be some truth to what they say? Could these mythologies in reallity be the twisted version of truth? Could they be the beginning place, for Satans many deceptions? Connect the dots, do you see what I see?\n\nThe Legend of Atlantis is a five part documentary series on the advanced civilization of Atlantis which thrived 11,000 years ago and the occult, esoteric mysticism associated with the legend. Many eons ago extraterrestrial beings came to Earth and settled inside the core of the planet with the purpose of developing higher forms of biological life on the surface of Earth. The civilization of Atlantis arose as the fourth root race of humanoids living in the 4th dimension succeeded by the 'Aryans' of the Vedas. They lived during a time when Power and Love were united and human beings did not live with an ego, separate from the higher self, the divinity within and all around.\n\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:49b0d2cce763a4f46e0d5874ae77c28e44901a0f","amp;dn":"POtHS+2+-+Bible+Study+-+Part+115+-+New+Age+Emerging+Church+One+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49b0d2cce763a4f46e0d5874ae77c28e44901a0f","infoHashBuffer":{"type":"Buffer","data":[73,176,210,204,231,99,164,244,110,13,88,116,174,119,194,142,68,144,26,15]},"announce":[],"urlList":[]}}