{"title":"9 - The Last Resort","uid":7892308,"size":731518657,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:49cf8389ed2977757152820f0d5bf75a2f5e4e28&amp;dn=9+-+The+Last+Resort&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"burt777","files":29,"time":1354753077,"description":"9 : The Last Resort (aka NINE)\n\nAn adventure game from 1996, based on artwork by Mark Ryden\n\n See http://en.wikipedia.org/wiki/9:_The_Last_Resort\n\nThis game was lying around in some discount box ages ago (imagine how old it\nis! '96!). I bought it really cheap because the monkey on the cover got my\nattention. I didn't get it to run, and completely forgot about it. Recently i\nrediscovered the box and decided to give it another go.\n\nGetting the game to run is the first real puzzle. I had to reinstall a couple\nof versions of Quick Time, and do some trial and error with the Run settings\n(right-click the shortcut, properties, 3rd tab compatibility). I did get it to\nrun this time, but not very stable. Especially towards the end, the game\ncrashed a lot. Remember to save often and prepare for some frustration.\n\nThat being said, i loved the shit out of this game!! The atmosphere, sound,\nstory and puzzles are all great. The voices are a bit goofy at times (there\nwasn't a lot of speech in games back then!) but the dialog is very good. The\npuzzles are insanely challenging, there's hints everywhere, and they merge\nseamlessly with all the artwork, which made me inspect every centimeter of the\nentire mansion! Eventually, i just got my camera and made a picture of\neverything i saw, which saved me lots of in-game walking around and probably\nquite some crashes.\n\nI intend to throw the box away because it takes too much space, but i do wish\nto keep a backup of this game and all the stuff (a lot!) that came with it.\nSince it wasn't on TPB yet, here seems like the right place to keep my copy. \n\n* The iso file \n* Some screenshots \n* Scans of the stuff that came with it\n\nNote i did not mess up the scan of the letter, it 's really that badly\nwritten. You do need it however, because it contains the combination of the\nlock on the front door. Or use the AutoHotKey script (press F12) i made when i\ngot tired of manually clicking through the entire code every time. It still\ntakes long, but at least you can get a cup of coffee or something.\n\nAmong some other stuff in the AutoHotKey script is the auto save (ctl-s), that\nmakes an autosave game and a backup. 99% of the time you'll be loading the most\nrecent save game, but i urge you to save often and keep them all, in case you \nsave in a spot where the game is about to freeze, no matter what you do! (And \nthe save-as menu is tedious!)","torrent":{"xt":"urn:btih:49cf8389ed2977757152820f0d5bf75a2f5e4e28","amp;dn":"9+-+The+Last+Resort","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49cf8389ed2977757152820f0d5bf75a2f5e4e28","infoHashBuffer":{"type":"Buffer","data":[73,207,131,137,237,41,119,117,113,82,130,15,13,91,247,90,47,94,78,40]},"announce":[],"urlList":[]}}