{"title":"FootWorship----FW-23844 Kimberly Kane, Andy San Dimas and Kelly ","uid":7848072,"size":482350134,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4a7475fd2c00d2520926c3ea8123d5be034f6141&amp;dn=FootWorship----FW-23844+Kimberly+Kane%2C+Andy+San+Dimas+and+Kelly+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1353522658,"description":"Uber Foot Babes\n\nOct 12, 2012 - Performers: Kimberly Kane , Andy San Dimas and Kelly Slayer \n\n\nWMV + Pics.\n\n\nWhat's most important in the life of youthful, hip San Francisco denizens? Sex, drugs, rock and roll and FEET! Yes, I said feet! Young wild women in this town need more than your average girl when it comes to sex. Foot fetish is just what they desire to feel they aren't conforming with the norms of society! Kimberly Kane and Andy San Dimas show off their peds taunting and teasing you with perfectly placed foot poses, hyper colored pantyhose, toe wiggles, toe spreads, self sucking and saliva covered tootsies. The best friends dyke out with each other and can't control their sexual urges as each try to one up the other to see who's the dirtiest foot slut of them all. The two sick and dirty foot freakettes invite over some tattooed surf dude they found scouring their beloved foot freak forums and know just how to push everyone of his foot fanatic buttons. He worships their feet, sucks, kisses, licks and sniffs them. A dirty hardcore foot fetish sex threesome ends with our foot worshiping surfer boy begging to drip his sticky mess over all 20 toes from a 4 foot footjob! Just another day in the life of the underground foot fetish scene! \n\nKick ass soundtrack provided by The Mallard an inside-out-echo-laser-garage-psych-rock four-piece from San Francisco!\n\nScreens &lt;a href=&quot;\nhttp://www.footworship.com/site/shoot/23844-Uber-Foot-Babes.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.footworship.com/site/shoot/23844-Uber-Foot-Babes.html&lt;/a&gt;\n\nAlmost 9000 uploads, and if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)    \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:4a7475fd2c00d2520926c3ea8123d5be034f6141","amp;dn":"FootWorship----FW-23844+Kimberly+Kane%2C+Andy+San+Dimas+and+Kelly+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a7475fd2c00d2520926c3ea8123d5be034f6141","infoHashBuffer":{"type":"Buffer","data":[74,116,117,253,44,0,210,82,9,38,195,234,129,35,213,190,3,79,97,65]},"announce":[],"urlList":[]}}