{"title":"Fuck.my.Ass.XXX.DVDRip.x264-CHiKANi","uid":8594591,"size":1506587618,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4ff4a37a07cd777bad6aae101b6fe1c04fee5379&amp;dn=Fuck.my.Ass.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxlavalxxx","files":3,"time":1371727671,"description":"The classic French master of lesbian lewdness and anal perversion, director Christoph Clark, is well known for his propensity to combine gorgeous, high-glamour European models with the filthiest of explicit sex acts. The title of his latest all-girl masterpiece says it all: a five-scene smorgasbord of Sapphic smut centered on the alluring rectal region. These stunning ladies know exactly which tools and techniques - fingers, big toys, probing tongues - will satisfy the sensual cravings of a beautiful woman's backside. Submissive Spanish darling Leyla Black squats over an enormous anal dildo, bouncing up and down under orders from Italian domme Valentina Nappi!\n\n Valentina plunders her girlfriend's colon using a massive dildo until the poor girl's sphincter is wrecked and gaping, then demands similar treatment for her own butthole. Thick, young, black-haired Wild Devil partners with sultry redhead Liliana for a romantic session of tushy-targeted finger banging. Anita Bellini, an exotic teenage beauty in sexy lingerie, masturbates for the camera. After slender, slutty Sophie Lynx does the same, the girls share a play date with phallic toys and plenty of feverish pussy licking and brown-nosing. Leyla returns for some female empowerment with lovely Lyen, expanding their rear portals through rude insertions. Finally, blonde Lucy Heart, dressed in sheer nylons, and Nina, a shorthaired goddess with big, natural jugs, anally stimulate each other to climax. These classy babes lose all inhibitions when they're alone together. \n\nNina, Sophie Lynx, Leyla Black, Valentina Nappi, Lyen, Liliana, Anita Bellini, Wild Devil, Lucy Heart\n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=wofsambeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=wofsambeb.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=qhwmajx1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=qhwmajx1.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4ff4a37a07cd777bad6aae101b6fe1c04fee5379","amp;dn":"Fuck.my.Ass.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff4a37a07cd777bad6aae101b6fe1c04fee5379","infoHashBuffer":{"type":"Buffer","data":[79,244,163,122,7,205,119,123,173,106,174,16,27,111,225,192,79,238,83,121]},"announce":[],"urlList":[]}}