{"title":"Ronnie Lane - Anymore For Anymore (1974)","uid":8675400,"size":77663910,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:53d1f6de450432b4b7b5414d89cbaa500db98e77&amp;dn=Ronnie+Lane+-+Anymore+For+Anymore+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"arunachala","files":13,"time":1373579023,"description":"Ronnie Lane - Anymore For Anymore (1974)  VBR245\n\n\n\nRonnie Lane had to fight with the other Faces to get his songs on their albums and included in their concert set lists. The Faces were seen as an unabashed, hard-driving rock 'n' roll band; whereas Lane was at heart a traditional, music hall-inspired folkie. So in 1973 he left the Faces and formed Slim Chance. This band would eventually record three albums--this was the first and best.\nAnymore for Anymore was recorded in conjucntion with plans to put together a travelling circus to be called the Passing Show, which was to feature musicians, clowns, jugglers, dancers and fire eaters. Their music fit the carnival atmosphere perfectly.\n\nWhile the band could cook on songs like &quot;Chicken Wired&quot; (a more raucus version than that found on the Lane/Wood collaboration for the Mahoney's Last Stand soundtrack), a majority of the songs were more rooted in the folk tradition complete with fiddle, banjo and mandolin.\n\nThe album kicks off with &quot;Careless Love&quot; with its rollicking piano, followed by &quot;Don't You Cry for Me&quot;--a lovely Lane-penned love song. Other highlights include &quot;Bye and Bye (Gonna See the King), &quot;The Poacher&quot; (one of Ronnie's signature songs which first appeared on The Faces' debut and on Pete Townshend's first solo LP), &quot;Amelia Earhardt's Last Flight&quot; and the title track &quot;Anymore for Anymore.&quot;","torrent":{"xt":"urn:btih:53d1f6de450432b4b7b5414d89cbaa500db98e77","amp;dn":"Ronnie+Lane+-+Anymore+For+Anymore+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53d1f6de450432b4b7b5414d89cbaa500db98e77","infoHashBuffer":{"type":"Buffer","data":[83,209,246,222,69,4,50,180,183,181,65,77,137,203,170,80,13,185,142,119]},"announce":[],"urlList":[]}}