{"title":"The Ipcress File 1965 Michael Caine DvDRip x264 AAC-miKem","uid":8514650,"size":1268934485,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56b5f8119dd4ee7ad5b80c948733688ad1294de9&amp;dn=The+Ipcress+File+1965+Michael+Caine+DvDRip+x264+AAC-miKem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mikem777","files":5,"time":1369689212,"description":"The Ipcress File (1965)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0059319&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0059319&lt;/a&gt;\n\nSAMPLE file included\n\nA number of leading Western scientists have been kidnapped only to reappear a fews days later. Unfortunately, each scientist has been brainwashed and is now completely useless. The British send their agent, Harry Palmer, to investigate. Palmer is surprised to be selected for such a mission (considering his past) and believes he has been chosen because he is expendable.\n\nMichael Caine's first outing as secret agent Harry Palmer is set in 60's London. This is not the Psychedelic London of Austin Powers or the Beatles, neither is it the sophisticated aristocratic London of James Bond. This London is drab and populated by civil servants &amp; bedsits. This London is still coming to terms with the end of World War II and the advent of a modern world. Working Class Palmer is an unwilling Home Office agent with criminal tendencies who is more interested in a pay rise so that he can indulge his true passion, gourmet cooking, than serving his country. His superiors, Ross (played by Guy Doleman) &amp; Dalby (Played by Nigel Green) represent a microcosm of the British Upper &amp; Lower Middle Classes. Palmer is clearly more cultured in his appreciation of food, music (Mozart &amp; Bach) &amp; women, &quot;I like Birds Best&quot; Palmer admits to Courtney played by Sue Lloyd (of Crossroads fame in UK). Palmers superiors appear uninterested in the fate of their subordinates and this is one reason why the character of Palmer works so well, we are him, he lives our lives and we want him to win through. This perspective is aided by the stunning photography that uses every conceivable camera angle (even views from a light bulb!) to see the world from the characters perspective. Look out for the supermarket scene between Ross and Palmer, my vote for the most violent use of a supermarket Trolley in a movie. As Palmer slowly unravels the mysterious disappearance of top government scientists it becomes clear that there is someone close to the top of the British Secret service acting as a double agent. Who is it, Ross or Dalby? Who is Courtney, Palmers love interest, working for? In the background is a rather sinister looking CIA, who always appear to be one step ahead of the Brits. (A reference to the decline of Britain as a world power and its reliance on America?) Wether intentional or not, this film has captured a London of the 60's that was going through substantial social change, gone are the class paradigms that suggest that the working class could never be cultured, gone is is the unquestioning loyalty to the upper class. This world was forever changed after the war. This is a film I can watch time and time again, if only to watch the title sequence as Palmer gets up for work as if he is going to just another office job. This is a stylish movie and one of the greatest British films ever made. If you haven't seen it watch it now!\n\n*** General Parameters ***\n- Name:  ipcress.m4v \n- Container:  M4V - QuickTime \n- Size:  1.256 GB \n- Duration:  1h 43mn \n- Bitrate:  1 624 Kbps \n\n*** Video Track Parameters ***\n- Format:  H.264/MPEG-4 AVC \n- Bitrate:  Max.: Undefined / Average: 1 500 Kbps / Min.: Undefined \n- Frame rate (fps):  Max.: --- / Average: 25.000 / Min.: --- \n- Encoding profile:  &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d994b8b0b79995eaf7e9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n- Image size:  710*432 \n- Pixel Aspect Ratio:  Undefined \n- Display Aspect Ratio:  2.35:1 \n- Interlacing:  Progressive \n\n*** First Audio Track Parameters ***\n- Format:  AAC - MPEG-4 audio \n- Bitrate:  120 Kbps \n- Resolution:  Undefined \n- Rate:  48.0 KHz \n- Channel(s):  2 (stereo) \n- Position:  Front: L R\n\ntags: brainwashing, mind control, hypnosis, mkultra, mk-ultra, Michael Caine, Harry Palmer, drama, thriller, scientist, cia, secret service, spy, agent, British, 1960s, cold war, conspiracy","torrent":{"xt":"urn:btih:56b5f8119dd4ee7ad5b80c948733688ad1294de9","amp;dn":"The+Ipcress+File+1965+Michael+Caine+DvDRip+x264+AAC-miKem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56b5f8119dd4ee7ad5b80c948733688ad1294de9","infoHashBuffer":{"type":"Buffer","data":[86,181,248,17,157,212,238,122,213,184,12,148,135,51,104,138,209,41,77,233]},"announce":[],"urlList":[]}}