{"title":"SmartSMS v2.1.4 ","uid":8559552,"size":1701067,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:571dde993fe77c5400f6dc93abb1c00c9bb39f2d&amp;dn=SmartSMS+v2.1.4+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":-1,"time":1370850605,"description":"\nWelcome to SmartSMS, the next generation SMS app: fast, lightweight and smart!\nSmartSMS has the following features:\n\n- complete support for SMS: reading/writing, sending, receiving\n- partial support for MMS (reading/deleting/locking)\n- conversation list grouped by contacts (with multiple addresses) and message list with bubbles style or simple style\n- pictures of contact from address book, number of received/sent/unread messages, draft and smart date of last message (e.g., 'yesterday' instead of the full date)\n- compact messages arrived in short time, smart ordering (never have messed up messages like in other apps!)\n- complete customizable notifications: sound, vibration, LED color, icon, notifications for individual address and reminders\n- expandable status bar notifications (JellyBean) with contact pictures and actions (mark as read, delete, call), or privacy mode with only sender or completely anonymous\n- nice notification popup supporting multiple messages with quick reply, delete, close, view, call and text-to-speech\n- nice UI themes with possibility to fully customize colors and sizes with animation of sent/received/deleted messages and conversations for each address\n- automatically re-send messages on error\n- fast integrated backup/restore messages on SD (the fastest on Google Play! Backup just 3000 messages in less than three seconds [on HTC Desire])\n- batch delete/quick actions menu by long press conversation or message\n- different emoticon themes and Emoji* IOS6 support also from popup!\n- big editor for long messages and compose activity by long press search key\n- privacy hidden inbox with privacy notifications and black list for unwanted senders\n- widget with last unread message\n- (PRO) app locker with password\n- (PRO) widget to fast lock/unlock\n\nPRO version has the following additional features:\n- no ads!\n- features released earlier\n- 7 free themes!\n- app lock with password\n- unlimited black list senders (2 in Free version)\n- unlimited backups (3 in Free version)\n- unlimited privacy inbox address (1 in Free version)\n- global privacy (make all notifications private until disabled)\n\nNOTE: Before installing the Pro version please remove the Free one since they cannot run together on the same phone or errors may appear\nThis app can send crash report for helping us improve the app or fix bugs. You will be notified before submitting any data.\nIf you have some problems in upgrade please uninstall and reinstall it\nIf you receive double notifications or have double messages uninstall GOSMS or Handcent that cause the issue\nIf you still receive errors or crashes you may have an incompatible device\n\nWhat's in this version:\nAdded LightFlow support (soon in LightFlow)\nAdded option to show return key on message keyboard\nFixed message grouping option\nBug fixes and enhancements\nAdded custom ticker text for private message notification\nFixed delivered notification appearance\nSending in popup closes it only if all messages have been seen\nPrivacy notification brings you to the conversation list instead of password lock\nFixed &quot;Retry&quot; from notification\nFixed bugs in popup\nFixed side bar appearing when rotating\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.smartdevapps.sms&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.smartdevapps.sms&lt;/a&gt;\n","torrent":{"xt":"urn:btih:571dde993fe77c5400f6dc93abb1c00c9bb39f2d","amp;dn":"SmartSMS+v2.1.4+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"571dde993fe77c5400f6dc93abb1c00c9bb39f2d","infoHashBuffer":{"type":"Buffer","data":[87,29,222,153,63,231,124,84,0,246,220,147,171,177,192,12,155,179,159,45]},"announce":[],"urlList":[]}}