{"title":"Stealth (2005) DVD - Multisub","uid":7911338,"size":6991816292,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5761ab1325978ec6b63470ea9db0debf7f995430&amp;dn=Stealth+%282005%29+DVD+-+Multisub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rootkit","files":82,"time":1355184652,"description":"Stealth (2005) DVD - http://www.imdb.com/title/tt0382992/\n---------------------------------------------------------------\nAudio:                                     Subtitles:\n- Enlish                                   - Enlish\n- Czech                                    - Arabic\n- Hungarian                                - Bulgarian\n- Polish                                   - Croatian\n                                           - Czech\n                                           - Dansih\n                                           - Finnish\n                                           - Greek\n                                           - Hebrew\nFilsize: 7.95 GB                           - Hindi\nFilsize: 6.51 GB (compression)             - Hungarian\nFiletype: ISO                              - Icelandic\nDecryption and Ripped by: AnyDVD           - Norwegian\nCompressed by: WinRAR                      - Polish\n                                           - Romanian\n                                           - Serbian\n                                           - Slovene\n                                           - Swedish\nDescription:                               - Turkish\n---------------------------------------------------------------\nThe world's three best pilots are partnered with a state-of-the-art, fully-automated, pilotless, super stealth warplane - unhuman and invincible. But once in the air it goes haywire, leaving them with one final mission - bring it down. Josh Lucas, Jessica Biel, Jamie Foxx, and Sam Shepard star in this film directed by Rob Cohen. Extras include documentary, in-depth scene deconstruction, Incubus music video, featurette, and 2 MX multi-angle scene breakdowns. This release is a Blu-ray disc.\n\nThis high-action flight movie centers on a team of three sexy stealth bomber pilots who are forced to fly with EDI (Extreme Deep Invader), a computer-manned prototype plane that specializes in extra-precision bombing. The brainchild of a Bill Gates-esque wunderkind (Richard Roxburgh), EDI has the ability to learn at a fantastic rate, talks like HAL from 2001 A SPACE ODYSSEY, and likes to listen to hard rock before going into combat. Before long, a freak accident causes it to question authority and launch an attack on Russia. W.D. Richter's script probes big issues involving man, machine, and the nuclear fate of the free world (Read: DR. STRANGELOVE meets THE TERMINATOR). But this is also an action thrill ride from Rob Cohen--the man responsible for THE FAST AND THE FURIOUS and XXX--replete with some truly tremendous explosions and speeds that outdo any mph records set in Cohen's past ouevre. Jessica Biel (TEXAS CHAINSAW MASSACRE) is tough and surprisingly believable as the token female fighter pilot, while Jamie Foxx (RAY) makes a fine wingman to the daredevil squadron leader played by Josh Lucas. Sam Shephard (THE RIGHT STUFF) is their commanding officer, with Joe Morton playing a shady politician.","torrent":{"xt":"urn:btih:5761ab1325978ec6b63470ea9db0debf7f995430","amp;dn":"Stealth+%282005%29+DVD+-+Multisub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5761ab1325978ec6b63470ea9db0debf7f995430","infoHashBuffer":{"type":"Buffer","data":[87,97,171,19,37,151,142,198,182,52,112,234,157,176,222,191,127,153,84,48]},"announce":[],"urlList":[]}}