{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":7955109,"size":6554854763,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:576d225a317b2ac996e0fb3db517bc5897819bd6&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1356396544,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 37 - The Occult Explosion Pt2\n\n \n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh.\n\nDescription:\n\nJohn Todd Highest Ranked ex-Illuminati Explains How They Work and Exposing The Satanic Illuminati videos:\nHis name was John Todd, a former member of the illuminati. ... who when delivered from a life of Satanic bondage and sin, expose Satan's works of darkness.  The words that he left on his audio tapes are still coming to pass which puts lots of credibility on his claim that he was an insider.\nThis audio tape speaks about the evil plans of the illuminati for world control.\nThis is just another piece of the puzzle that explains what's going on today's world.\nJohn Todd a Former Illuminatist: (Explaining The Illuminati)\n\n----------------------------------------------------------\n\nJohn Todd - The Illuminati and Witchcraft - His Talk (1978)\n\n\nTape 1A):\nJohn Todd's testimony of deliverance from the occult, evils of witchcraft - 24.5 megabytes in MP3 format with 43 minutes of audio. The sound quality will improve after the first couple minutes.\n\nTape 1B) Music and Spells, 44 minutes - 4.3 megabytes\n\nTape 2A) Dangers of fortune telling, familiar spirits, CS Lewis, JRR Toiken, etc. - 43 minutes - 4.2 megabytes\n\nTape 2B) Charles Manson, Sharon Tate murder, Process Church, epilepsy, UFOs, demon possession, Jimmy Carter etc. - 40 minutes - 3.8 megabytes\n\nTape 3A) What is the Illuminati? CFR, Trilateral Commission, what 33rd. degree Masons believe about Lucifer, etc. - 43 minutes - 4.2 megabytes\n\nTape 3B) Continuation of what is the Illuminati? Who leads it? The Charismatic movement - Chuck Smith - Jesus Rock - John Birch Society - Freemasons, purpose of Rock Music, etc. - 40 minutes - 4.4 megabytes\n\nTape 4A) How to survive, etc. - 43 minutes - 4.6 megabytes\n\nTape 4B) Masons, Salvation message by pastor 1 hour 16 minutes - 9.1 megabytes. The audio quality is not very good but still audible.\n\nTape 5A) Todd's testimony about the occult world, the Illuminati, the Collins family, introduction of witchcraft to America, etc. - 41 minutes - 6.1 megabytes\n\nTape 5B) Salvation testimony, deliverance from fear based on 2Tim1:7, Rock Music, Book of Mormon based on the witchcraft bible &quot;Book of Shadows&quot;, witchcraft symbols used in jewelry, Catholic mass compared to witchcraft, why JFK was killed, etc. - 39 minutes - 4.3 megabytes\n\nTape 6A) History as a witch, doctrine, evils of television, 43 minutes - 4.7 megabytes (was 24.4 megabytes)\n\nTape 6B) More details of his life in the occult, evils and addiction of rock music, purpose of rock music - to get Christians cast spells on themselves! etc. - 36 minutes - 3.5 megabytes\n\nTape 7A) John Todd - Ex Council of 13 Member Exposing the Illuminati (1978) - 32.2 megabytes - 1 hour 6 minutes\n\n\ncomment: These talks were given probably in 1978 or shortly before. They were originally recorded on analog audio tape. The audio quality therefore is rather mediocre. The value of this information is considerable.\n----------------------------------------------------------\n\n   \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n\n\nundefined","torrent":{"xt":"urn:btih:576d225a317b2ac996e0fb3db517bc5897819bd6","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"576d225a317b2ac996e0fb3db517bc5897819bd6","infoHashBuffer":{"type":"Buffer","data":[87,109,34,90,49,123,42,201,150,224,251,61,181,23,188,88,151,129,155,214]},"announce":[],"urlList":[]}}