{"title":"Tony Robinson - Cunning Night Out 2007 DVDRip XviD-iTeM","uid":7825456,"size":733923328,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:57cb86c4443b4279bd3b28b22bfd95477541a1fd&amp;dn=Tony+Robinson+-+Cunning+Night+Out+2007+DVDRip+XviD-iTeM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pongydog","files":2,"time":1352917220,"description":"In the great British comedy series Blackadder, Tony Robinson was the dim-witted Baldrick, who always had a &quot;cunning plan&quot; to escape any dire situation. Performing before a live audience, Robinson careens through the story of his life and the course of history, sharing hilarious tales, family stories, and anecdotes that champion the little guy. &quot;Tony Robinson is a god of history&quot;--Eddie Izzard.\n\n\n\n----------\nTony Robinson's Cunning Night Out! is the uproariously funny DVD of a stand-up comedy performance by British television actor Tony Robinson, perhaps best known for his role of Baldrick in the hilarious British sitcom &quot;Black Adder&quot;, and his infamous refrain, &quot;I have a cunning plan!&quot; Tony Robinson gives the snigger-inducing scoop on everything from the secrets hidden within common surnames (many last names indicate that our ancestors worked horrible jobs, such as &quot;Kellogg&quot;, which can be traced back to hog butchering), to the creation of the &quot;Maid Marian&quot; television show (ostensibly a children's program but so popular that one college closed its bar when &quot;Maid Marian&quot; aired), to when Robinson worked with John Wayne and was literally pushed into a river of liquid filth as part of the shoot. Fans of &quot;Black Adder&quot; will not be disappointed; he gives plenty of hysterical anecdotes from the series, including one particularly raunchy &quot;Black Adder&quot; joke that never aired (because the actress was too mortified and refused to say the line)! Truly a laugh-out-loud viewing experience, seasoned with just a dash of history for personal enrichment, highly recommended for comedy lovers everywhere and a &quot;must-have&quot; for &quot;Black Adder&quot; fans\n\n\n\n\n\n\n\n\n\nXviD rip from retail DVD\n\n\nVideo: 640x398 (16:9), 25fps, 1000kbps\nAudio: 128kbps, 2 Channels, MP3","torrent":{"xt":"urn:btih:57cb86c4443b4279bd3b28b22bfd95477541a1fd","amp;dn":"Tony+Robinson+-+Cunning+Night+Out+2007+DVDRip+XviD-iTeM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57cb86c4443b4279bd3b28b22bfd95477541a1fd","infoHashBuffer":{"type":"Buffer","data":[87,203,134,196,68,59,66,121,189,59,40,178,43,253,149,71,117,65,161,253]},"announce":[],"urlList":[]}}