{"title":"9th Dawn RPG v1.18 Android","uid":7826370,"size":21907303,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:5c9275a41426059795e918a7178cfb90a4e3b555&amp;dn=9th+Dawn+RPG+v1.18+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":-1,"time":1352937107,"description":"9th Dawn RPG v1.18\nRequirements: Android 1.6+\nOverview: Are you a fan of oldschool RPGs like Ultima, but crave the openness and exploration in modern games? \n\n\nWe are proud to present 9th Dawn, a game that's a blend of modern and traditional design and gameplay and sports the largest open world experience available today in a mobile RPG!\n\nExplore the large island continent of Montelorne, a land far detached from the mainland, but filled with mystery, danger, and last but not least, adventure. You begin your journey in the small village of Agaria, but once you gain your bearings, you'll find yourself immersed in a world of its own.\nPlay as one of three of the traditional classes: The sturdy knight, skilled in the art of combat and possessing the ability to wield heavy armour and weapons; the nimble archer, capable of swiftly dispatching a foe from afar or up close with his daggers; the wise mage, master of the elements and capable of utilizing powerful magic spells and summoning abilities to obliterate the enemy.\n\nWhether it's searching for hidden artifacts and treasure, helping the troubled Montelornians with the rising undead armies, or simply exploring the massive world and its many towns, dungeons, and forests, there is no shortage of fun for a bold adventurer to partake of!","torrent":{"xt":"urn:btih:5c9275a41426059795e918a7178cfb90a4e3b555","amp;dn":"9th+Dawn+RPG+v1.18+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c9275a41426059795e918a7178cfb90a4e3b555","infoHashBuffer":{"type":"Buffer","data":[92,146,117,164,20,38,5,151,149,233,24,167,23,140,251,144,164,227,181,85]},"announce":[],"urlList":[]}}