{"title":"Incredible PBX 3.6 for the 256MB and 512MB Raspberry Pi","uid":7865012,"size":1205113940,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:60a7b9161446fbb9c76dc753ac812064838bdc21&amp;dn=Incredible+PBX+3.6+for+the+256MB+and+512MB+Raspberry+Pi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"magna.vis","files":1,"time":1354035226,"description":"Incredible Pi is a bootable image for the $35 Raspberry Pi. It features \nRaspbian 7, Asterisk 1.8, and FreePBX 2.10. It includes many of the best features of Incredible PBX including Google Voice for free calling in the U.S. &amp; Canada. \n\nIncredible PBX 3.6 feature summary:\n\n1. New kernel with automatic memory allocation and management for 256MB and 512MB Raspberry Pi devices.\n2. Integrated update service for retrieval and installation of updates and fixes: /root/update-my-pi.\n3. For those with SD cards &gt; 4GB, you now can resize them on the fly after first boot. Just run raspi-config.\n4. While you're in raspi-config, set the overclocking desired. We run it at full tilt 1GHz with no problems. You need a very good power adapter!\n5. Status program has been reworked to support new SMTP mail server, Exim.\n6. Exim replaces SendMail for more flexibility. SendMail commands (service sendmail restart) still work. Exim Cheatsheet: http://nerd.bz/Vru2fe\n7. All Timezone file locations for Linux and PHP now are configured the first time you log in as root. To rerun: /root/timezone-setup.\n8. Do NOT use raspi-config to set time zone as it will NOT update PHP!!!\n9. Networking initialization has been tweaked a bit more. You also can: /root/restart-eth0 or /root/restart-wlan0.\n10. Learn everything about WiFi on Your Pi by running: /root/wifi-check.\n11. Clearing cache now happens automatically every night and after first login as root. You also can do it yourself: /root/clear-cache.\n12. Gmail script in /root is gone for good. Run /root/email-setup and plug in the entries shown here: http://nerd.bz/UJa9M6\n13. Default WiFi network setup (/etc/wpa.conf) now looks for open networks automatically but sets open WiFi as lowest priority (1). \n14. clear-logs in /root has been expanded to do more evening housecleaning.\n15. In order to support SD card expansion on the fly, the swap partition is no more. Now it's just a file. \n16. Asterisk log rotation bug has been fixed.\n17. Quirky network failure with duplicate DHCP address handout is fixed.\n18. Check the current CPU Frequency setting of your device: /root/cpu-freq.\n19. For 512MB Raspberry Pi owners, version 3.6 adds Incredible Fax featuring HylaFax server. Tutorial: http://nerd.bz/Wu2GGj\n\nTake the Incredible Pi for a spin on our Raspberry Pi. Dial 1-843-284-6844.\n\nCAUTION: Always run Incredible Pi behind a hardware-based firewall with NO\nInternet port exposure to your server. It's your phone bill.\n\nFIRST STEPS:\nInsert a 4GB or 16GB SanDisk Type 4 SDHC card into the SDHC slot or reader\non your PBX in a Flash or Linux server. Then reboot the machine.\n\nDownload the Incredible Pi 3.6 tarball and transfer it to a Windows, Mac, or Linux server. \n\nDecompress the tarball: tar zxvf incrediblepi-3.6.tar.gz\n\nCompare the md5sum result for .img download to the included .md5 file.\n\nAccept license agreement and run installer: ./make-sdhc or make-sdhc-mac \n\nFor Windows fans, use Win32 Disk Imager to create SD card: http://nerd.bz/UnYxmc\n\nRemove SDHC card, insert into Raspberry Pi, and boot the server.\n\nSECURITY ALERT: Before using the software, log in as root with password raspberry and run: /root/update-my-pi\n\nRead the latest Quick Start Guide on Nerd Vittles: http://nerd.bz/QuwC14\n\nIncredible PBX Apps Guide, see this article: http://nerdvittles.com/?p=2750\n\nBug Fixes and Troubleshooting Tips on PIAF Forum: http://nerd.bz/RduTcz","torrent":{"xt":"urn:btih:60a7b9161446fbb9c76dc753ac812064838bdc21","amp;dn":"Incredible+PBX+3.6+for+the+256MB+and+512MB+Raspberry+Pi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a7b9161446fbb9c76dc753ac812064838bdc21","infoHashBuffer":{"type":"Buffer","data":[96,167,185,22,20,70,251,185,199,109,199,83,172,129,32,100,131,139,220,33]},"announce":[],"urlList":[]}}