{"title":"POtHS - Creation - 55 - Persuaded by the Evidence","uid":7953964,"size":2961621725,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:637cf733a9f2ab47dcbdee5f8cf3b96bbefc1c17&amp;dn=POtHS+-+Creation+-+55+-+Persuaded+by+the+Evidence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1356361131,"description":"POtHS - Creation 55\n\nPersuaded by the Evidence\n\n\nDescription:\nPOtHS - Creation - 55 - Persuaded by the Evidence\n\n\nPersuaded by the Evidence, Part I, Volume I: &lt;a href=&quot;\nhttp://persuadedthemovie.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://persuadedthemovie.com&lt;/a&gt; Part I of Volume I in this series, Creation speaker Ian Juby interviews six scientists who abandoned the evolutionary dogma in favour of the young earth, Biblical creation model, because of their own research.  Imagine that you were a trained scientist who was taught the status quo:  evolutionary dogma was a &quot;fact.&quot;  What would you do if your own research compelled you to conclude that evolution couldn't possibly be true?  Their backgrounds are wide and varied, their stories take many twists and turns.  In this episode: Doug Sharp and David Bradbury.\n----------------------------------------------------------\n\nPersuaded by the Evidence, Part 2, Volume I:\nin this series, Creation speaker Ian Juby interviews six scientists who abandoned the evolutionary dogma in favour of the young earth, Biblical creation model, because of their own research. Their backgrounds are wide and varied, their stories take many twists and turns.  In this episode: Former atheist Dr. Jerry Bergman and Mathematician Alan Montgomery. With open captions for the hearing impaired.\n----------------------------------------------------------\n\nCreation Evangelism - Impacting our Culture, parts 1&amp;2 by Skip Tilton: &lt;a href=&quot;\nhttp://denvercreation.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://denvercreation.org&lt;/a&gt; Ç€ For their July 13, 2012 meeting, Rocky Mountain Creation Fellowship hosted Skip Tilton of Day One Ministries. A native of New England, Skip became a Christian while in the Navy. He completed a B.A. in Bible with a minor in Pulpit Speech, and later earned a Master of Ministry in 1993 from Bob Jones University. He then became pastor of Finger Lakes Baptist Church in Geneva, NY. The Lord led Skip to join the staff of AiG/Kentucky in 1997, where he served as an evangelistic speaker and supervised the design and construction of the Creation Museum. Following, as an evangelist with CMI-US, Skip continued to minister to Christians providing the understanding needed to strengthen their faith and equipping then with a stronger biblical worldview. In December of 2010, the Lord led Skip to form his own ministry, From Day One Ministrieswhose role is to support the local church in proclaiming the total authority and absolute truth of the Bible.\n----------------------------------------------------------\n\n    \n:thankyou:    :thankyou:     Thank You JESUS  \n\n\n \n\n\n\n","torrent":{"xt":"urn:btih:637cf733a9f2ab47dcbdee5f8cf3b96bbefc1c17","amp;dn":"POtHS+-+Creation+-+55+-+Persuaded+by+the+Evidence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637cf733a9f2ab47dcbdee5f8cf3b96bbefc1c17","infoHashBuffer":{"type":"Buffer","data":[99,124,247,51,169,242,171,71,220,189,238,95,140,243,185,107,190,252,28,23]},"announce":[],"urlList":[]}}