{"title":"Stossel.2013.07.11.[Trouble with Lawyers].Fox Business.CF.avi","uid":8685850,"size":348379036,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:64697b18e8538628fc52ca84f387cbed37a06c7b&amp;dn=Stossel.2013.07.11.%5BTrouble+with+Lawyers%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1373760180,"description":"----------\n\nSTOSSEL - [Trouble with Lawyers] - Fox Business Network\n2013, July 11, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n[comment: new content, revisiting subjects done in prior shows]\n----------\n\n[excerpted from John Stossel's blog:]\n\nAmerica drowns in law. There are 175,000 pages of federal regulations that you must obey, or some lawyer can wreck your life.\n\nFor every pound of good the regulations do, they do a ton of harm. 175,000 pages alone strangles life.\n\nGeorge Washington University Law Professor John Banzhaf loves &quot;public interest&quot; lawsuits. His students sue bars that hold &quot;ladies' nights.&quot; Chapman University business professor Tibor Machan says: &quot;Is it right to manipulate people all the time? To treat them like they're little children... Who appointed you the czar?... The whole point of government is to protect our rights, not to order us around.&quot;\n\nADA Exploitation: Most laws are well intended. But all laws get abused. &quot;Disability rights&quot; lawyers troll shopping malls seeking (or making up) violations from the Americans with Disability Act. David Peters tries to fight that through his group Lawyers Against Lawsuit Abuse.\n\n&quot;Patent Trolls&quot;: I call them parasites. Patent troll Rob Berman will argue with me.\n\nWorker's Comp Abuse: Insurance companies hire people like Paul Colbert, Meridian Investigative Group CEO, to secretly videotape people who file phony claims. He usually finds deceit.\n\nWarning Labels: Companies pathetically try to protect themselves from lawsuits by smearing warning labels on everything. Bob Dorigo Jones runs the Wacky Warning Label contest. Our studio audience votes for the stupidest warning label out of these 5:\n\nThe glass cleaner that warns &quot;not for contact lenses... or direct use in eye.&quot;\n\nThe rubber worm fishing bait that says &quot;not for human consumption.&quot;\n\nThe extension cord that says &quot;wash hands after handling.&quot;\n\nThe pedometer that says &quot;not responsible for any illness or injury incurred while using the step counter.&quot;\n\nAnd the matches that say &quot;combustion... results in carbon monoxide... known... to cause cancer, birth defects, reproductive harm.&quot;","torrent":{"xt":"urn:btih:64697b18e8538628fc52ca84f387cbed37a06c7b","amp;dn":"Stossel.2013.07.11.%5BTrouble+with+Lawyers%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64697b18e8538628fc52ca84f387cbed37a06c7b","infoHashBuffer":{"type":"Buffer","data":[100,105,123,24,232,83,134,40,252,82,202,132,243,135,203,237,55,160,108,123]},"announce":[],"urlList":[]}}