{"title":"2012","uid":7855390,"size":1468782782,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:64b64c534bb2b617998f076d07c430ff12e3302d&amp;dn=2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thira1998","files":-1,"time":1353742635,"description":"Movie - 2012\nRelease - 13 November 2009 (USA)\nLength - 02:31:23 min\nSize - 1.36 GB (1,468,803,695 bytes)\nFormat - avi\nResolution - 640x272 25fps\n\n2012 is a 2009 American science fiction disaster film directed by Roland Emmerich. It stars John Cusack, Chiwetel Ejiofor, Amanda Peet, Oliver Platt, Thandie Newton, Danny Glover, and Woody Harrelson, among others. It was produced by Emmerich's production company, Centropolis Entertainment, and was distributed by Columbia Pictures. Filming began in August 2008 in Vancouver, although it was originally planned to be filmed in Los Angeles.\n\nThe plot follows Jackson Curtis (John Cusack) as he attempts to bring his children, Noah and Lilly (Liam James and Morgan Lily respectively), ex-wife Kate Curtis (Amanda Peet) and her boyfriend, Gordon Silberman (Thomas McCarthy) to refuge and attempt to escape the heightened change in the elements. The film includes references to Mayanism, the Mesoamerican Long Count calendar and the 2012 phenomenon in its portrayal of cataclysmic events unfolding in the year 2012. Emmerich has announced that the film will be his last involving disasters.\n\nAfter a prolonged marketing campaign comprising the creation of a website from the point of view of the main character, Jackson Curtis, and a viral marketing website on which filmgoers could register for a lottery number to save them from the ensuing disaster, the film was internationally released on November 13, 2009. Critics gave 2012 mixed reviews, praising its special effects and tone but criticizing its length and screenwriting. Despite this, the film, budgeted at $200 million, has a worldwide theatrical revenue that reached approximately $770 million.\n        -Wikipedia \n\nIf You Enjoy The Movie Don't Forgot To Rate &amp; Comment.\nAlso Please Seed!\n","torrent":{"xt":"urn:btih:64b64c534bb2b617998f076d07c430ff12e3302d","amp;dn":"2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64b64c534bb2b617998f076d07c430ff12e3302d","infoHashBuffer":{"type":"Buffer","data":[100,182,76,83,75,178,182,23,153,143,7,109,7,196,48,255,18,227,48,45]},"announce":[],"urlList":[]}}