{"title":"Top.Wet.Girls.12.XXX.DVDRiP.XviD-DivXfacTory","uid":7887781,"size":1464981873,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:67f2d38402c1e00d52eb8d47d065bfb9f37f1981&amp;dn=Top.Wet.Girls.12.XXX.DVDRiP.XviD-DivXfacTory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"R0thschild","files":4,"time":1354655856,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=645018&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=645018&lt;/a&gt;\n\nTop Wet Girls porn Ten Of Christoph's Gaping Angels Get Off... On Spreading Their Wings For Each Other And Their Toys!Christoph Clark, Evil Angel's director of classic European hard-core porn, is a wizard at capturing glamorous models in nasty lesbian action. 'Top Wet Girls 12' features 10 exquisite women in raunchy sex play focused on big toys and yielding assholes. Blonde vamp Valentina Valenti has a special treat for her equally stunning and naturally huge-breasted girlfriend, Sheila Grant. She brings gorgeous, shorthaired brunette Stella Johanssen over for some butt licking fun. The girls drill one another's bunghole to wide gaping with large dildos and rim dilated derrieres with eager tongues. Next, sultry Sandra Romain and sleek, seductive Mira Sunset share a huge black phallus, sucking the invader ass-to-mouth and reaming their buttholes open with rubber-gloved fingers!Exotic beauty Angel Rivas applies make-up alongside her friend Brenda ... when the dark-haired sweethearts start kissing, sparks fly. The sexy young ladies do each other on the bathroom floor, getting extremely intimate with an array of imposing anal tools. Lastly, knockout Teena Lipoldino, lovely Alice Romain and blonde fox Pamela enjoy separate solo masturbation sessions, then come together for a volcanic, ass-plunging threesome. The nasty femme-flavored filth in 'Top Wet Girls 12' is all-girl, all anal, all wet!This is the only Stella Johanssen video. Adult stars also making their debut in this video: Teena Lipoldino, Alice Romain, Alice Romainee, Mira Sunset, Valentina Valenti.","torrent":{"xt":"urn:btih:67f2d38402c1e00d52eb8d47d065bfb9f37f1981","amp;dn":"Top.Wet.Girls.12.XXX.DVDRiP.XviD-DivXfacTory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67f2d38402c1e00d52eb8d47d065bfb9f37f1981","infoHashBuffer":{"type":"Buffer","data":[103,242,211,132,2,193,224,13,82,235,141,71,208,101,191,185,243,127,25,129]},"announce":[],"urlList":[]}}