{"title":"[1999] Interceptors, with Olivier Gruner","uid":7868180,"size":1465978840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:687628d56576023ce5e99adf160d61706e2bdd85&amp;dn=%5B1999%5D+Interceptors%2C+with+Olivier+Gruner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bodybuilder1989","files":-1,"time":1354117586,"description":"In the near future, the government has created an elite team of soldiers specially trained in the event of a hostile alien encounter. A multi-national force of the world's best, they are known as the Interceptor Force. A covert early warning satellite network tracks an object crash landing in a town in the Pacific Northwest. Within minutes of the impact, all communication with the town is mysteriously severed. The news sources are given a false story of contamination and the area is sealed off. AWAC's and fighters patrol the perimeter. As the silence from the town continues, the Interceptor team lead by Lieutenant Sean Lambert (Gruner) is sent in to investigate. An MC 130 Talon is scrambled for Lambert and his team to make the high altitude air drop. Once inside, the team encounters an alien race capable of assuming human likeness, hiding their reptilian form. Simultaneously the government has given the team less than 24 hours to terminate this alien force before launching an air strike with tactical nukes to completely sterilize the area. Lambert and his team now must battle this alien military force as the clock ticks and a squadron carrying certain death approaches.","torrent":{"xt":"urn:btih:687628d56576023ce5e99adf160d61706e2bdd85","amp;dn":"%5B1999%5D+Interceptors%2C+with+Olivier+Gruner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"687628d56576023ce5e99adf160d61706e2bdd85","infoHashBuffer":{"type":"Buffer","data":[104,118,40,213,101,118,2,60,229,233,154,223,22,13,97,112,110,43,221,133]},"announce":[],"urlList":[]}}