{"title":"D,N, Angel Complete","uid":7869097,"size":5946847901,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6c9acab912181f3f42ea70786c115008c4e94026&amp;dn=D%2CN%2C+Angel+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dedrack1","files":27,"time":1354147261,"description":"D.N.Angel follows the adventures of Daisuke Niwa, an average teenage boy. At the story's opening, Daisuke declares love for his crush, a girl named Risa Harada, on his fourteenth birthday. She rejects him, and later that day, the heart-broken Daisuke undergoes a strange mutation that changes him into another person. He is told calmly by his mother Emiko that, because of a strange genetic condition, all the males in Daisuke's family gain the countenance of Dark Mousy, a famous phantom thief. The transformation occurs every time Daisuke has romantic feelings for his crush or whenever he thinks too long about her. Dark changes back into Daisuke the same way. Daisuke is forced to keep his family's secret and control his alter ego, Dark (who Risa, Daisuke's crush, has fallen for), while dashing his way out of being caught by the commander of the police. Daisuke learns that in order to return to normality, he must have his unrequited love returned.\n\nThe aforementioned commander of the police is a classmate of Daisuke's named Satoshi Hiwatari. Hiwatari suffers from his own version of the phantom-thief curse, and a bond forms between Hiwatari and Daisuke because of their similar afflictions. Hiwatari carries the alter-ego named Krad. However, though Dark and Krad hate one another, Hiwatari and Daisuke maintain a strained but genuine friendship, despite Dark's constant moaning. Dark steals certain artistic objects of value, works made by Satoshi's ancestors, because they contain dangerous magical properties. Some of them, such as &quot;The Second Hand of Time&quot; and &quot;Argentine&quot; also have personalities of their own. Some of the objects that he steals are quite dangerous. Dark's method of stealing is based on garnering attention; before stealing, Emiko will send out a warning of what will be stolen. -Wikipedia","torrent":{"xt":"urn:btih:6c9acab912181f3f42ea70786c115008c4e94026","amp;dn":"D%2CN%2C+Angel+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c9acab912181f3f42ea70786c115008c4e94026","infoHashBuffer":{"type":"Buffer","data":[108,154,202,185,18,24,31,63,66,234,112,120,108,17,80,8,196,233,64,38]},"announce":[],"urlList":[]}}