{"title":"How to Drink","uid":7833017,"size":7403952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ced9a23a002990b7450a304a749d522ed592ac2&amp;dn=How+to+Drink&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1353118527,"description":"How to Drink By Victoria Moore\n2009 | 344 Pages | ISBN: 0740785745 | EPUB \n\n\n\nIn the past few decades, many of us have become sophisticated about food, but we have not given the same attention to what we drink. In How to Drink, Victoria Moore aims to redress the balance, by showing how to drink well throughout the seasons and at all times of day.\nShe explains how to make the most delicious coffee and juices; how to choose wine that complements your food; and how to make cocktails for every occasion--whether to serve a garden barbecue, as a cold weather aperitif, or just to unwind with at the end of the day.\nHere are recipes for mint juleps in the spring, sloe gin in the autumn, hot buttered rum in the winter, and year-round showstoppers including the world's best gin and tonic. Moore is also an impassioned advocate of unfairly maligned drinks such as sherry, Campari and saki, and gives fascinating historical background on different spirits as well as invaluable advice on creating your home bar.\nHow to Drink is a hugely readable, browseable and authoritative handbook, whose aim is to inform, entertain and crucially, make sure you can find the right drink at the right time.","torrent":{"xt":"urn:btih:6ced9a23a002990b7450a304a749d522ed592ac2","amp;dn":"How+to+Drink","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ced9a23a002990b7450a304a749d522ed592ac2","infoHashBuffer":{"type":"Buffer","data":[108,237,154,35,160,2,153,11,116,80,163,4,167,73,213,34,237,89,42,194]},"announce":[],"urlList":[]}}