{"title":"Glamsmoke","uid":7882959,"size":2522097260,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6fedf65efaaec08d9ef93f50017e899568468c45&amp;dn=Glamsmoke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":-1,"time":1354543441,"description":"Year: 2011\nCountry: USA\nGenre: Lesbians, Toys, Smoking\nDuration: 1:57:15\nLanguage: English\nDirected by:\nStudio: Bluebird\n\nDescription:\n10 girls, 5 scenes and a whole lot of smoke and flames as these beautiful women light up their cigarettes and light each other up with desire. If you like a smoke and you like beautiful sensuous women, you'll be absolutely addicted to GLAMSMOKE!\n\nScene 1 Drag\nDrags and licks are whats in order when two beautiful women light up there utterly addictive cigarettes. The best of both worlds will fill your eyes in this scene with the beautiful big tit Jasmine Black and the stunning hard body blonde Paige Ashley. This scene is anything but a drag.\n\nScene 2 Chain\nWhen one just isn't enough, go right for the next one. If the first scene didn't satisfy you (and we're sure it did), then here is another one for you to light up. We love the light mixed with the dark so here is another blonde and brunette to satisfy both sides of your desire. We know you can stop here though!\nScene 3 French Inhale\nAnd now for the darker side of your desire, Tammie Lee and Charlie Monaco, two drop dead gorgeous brunnettes are going to smoke you out with their sensuous licks.\n\nScene 4 Secondhand\nIf you enjoy a smokey room, then you're going to love this jaw dropping scene. Two beautiful blondes light up and take it off. Is that smoke in your eyes or are you crying because you can't believe how lucky you are seeing these two beautiful women soke themselves into ecstasy?\n\nScene 5 Addict\nAnd now that we have you addicted to watching beautiful women pleasure each other with they're lips and tongues, we're going to send you off to the stratosphere with the dark beauty of your dreams, Emma Butt and Heavenly can't stop once they get their hands on each other.\nScene 6 Bonus\nThese girls are living it up in style while they light us up with their sensuous bodies! Cast:\n\nPAIGE ASHLEY, JASMINE BLACK, LOU LOU, LEILA BEE, TAMMIE LEE, CHARLIE MONACO, CINDY BEHR, MEL ROOK, EMMA BUTT, HEAVENLY, CHARLEY ATWELL, BROOKE LEE\n\nQuality: VODRip\nFormat: wmw\nVideo codec: Windows Media\nAudio Codec: wma\nVideo: Windows Media Video 9 960x540 23.98fps 2700kbps 0.217 bit / pixel\nAudio: Windows Media Audio 44100Hz stereo 128kbps\n &lt;a href=&quot;\nhttp://imgload.me/img-50bca31a7d409.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50bca31a7d409.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://imgload.me/img-50bca31a95aa0.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50bca31a95aa0.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:6fedf65efaaec08d9ef93f50017e899568468c45","amp;dn":"Glamsmoke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fedf65efaaec08d9ef93f50017e899568468c45","infoHashBuffer":{"type":"Buffer","data":[111,237,246,94,250,174,192,141,158,249,63,80,1,126,137,149,104,70,140,69]},"announce":[],"urlList":[]}}