{"title":"Instructions to Install Adobe Master CS6 (X-force &amp; instruct","uid":8650260,"size":54540,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:705c5fcddf2cf54a4efd20616359110a437d7928&amp;dn=Instructions+to+Install+Adobe+Master+CS6+%28X-force+%26amp%3B+instruct&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CarbonPhoto","files":1,"time":1373078027,"description":"Included are instructions that work as of 7/5/13 to install and have updates for Adobe CS6 Master Suite for Mac. No trial is included but is needed for this. All that's included is the X-Force Keygen and Instructions.txt.\n\nOther torrents worked previously, but Adobe updates and adds hosts which connect to your PC after installation to prevent activation. Note, after activation, adobe updater will tell you that there's no updates available but for example, Photoshop will stay version 13.0 and Illustrator 16.0. Therefore, update is not working correctly.\n\nTo fix this problem, I downloaded 'Private Eye.app' which allows to see the incoming and outgoing connections. I opened adobe updater and Private Eye showed me the incoming connections adobe was using. So I uninstalled everything but added those adobe connections to my hosts (you can use Gas Mask.app or through terminal to edit hosts) and it finally updated successfully.\n\nSo as of the date listed above, those adobe connections are blocked and the included instructions work. But, if adobe adds more connections, activation will fail. If that happens, use private eye and do what I did. Also, add that 127.0.0.1 xxx.xxx.com to the comments of this torrent to help others out.\n\nHopefully this make sense and helps people out.\n\nAnother tip, to fully uninstall CS6 (if you screw up or doesn't work), go to Utilities/Adobe Installers/Adobe Creative Suite 6 Master Collection.app and uninstall through that. Next, go to Library/Application Support and delete the whole Adobe folder. Also go to Library/Preferences and delete any folder or file with the name Adobe in it. Last, go to Library/Caches and delete any folder or file with the name Adobe in it. This should allow you to reinstall the trial.","torrent":{"xt":"urn:btih:705c5fcddf2cf54a4efd20616359110a437d7928","amp;dn":"Instructions+to+Install+Adobe+Master+CS6+%28X-force+%26amp%3B+instruct","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"705c5fcddf2cf54a4efd20616359110a437d7928","infoHashBuffer":{"type":"Buffer","data":[112,92,95,205,223,44,245,74,78,253,32,97,99,89,17,10,67,125,121,40]},"announce":[],"urlList":[]}}