{"title":"POtHS - Christmas Special 2012 -  The Star of Bethlehem &amp; St","uid":7942454,"size":6289000991,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70f137525a4fad68d52974ab7e1b41bed089d643&amp;dn=POtHS+-+Christmas+Special+2012+-++The+Star+of+Bethlehem+%26amp%3B+St&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1356027251,"description":"POtHS\nPouring Out the Holy Spiritruth\n\nPOtHS - Christmas Special 2012 - The Star of Bethlehem &amp; Starry Night Software\n\n\nPOtHS says: This is a spectacular presentation on The Birth of Jesus and The Celestial Happenings in the skies at that time. This presentation, The Star of Bethlehem, is based on Data from Starry Nights Software that is included in this Folder. (Use Win XP compatibility mode when installing)\n\nDescription:\n\nThe Star of Bethlehem\n\nFor centuries, skeptics and seekers alike have pondered the star of Bethlehem. The Bible describes unusual or even impossible astronomical events at Christ's birth. Was it a miracle or mere myth? This compelling DVD - from producer Stephen McEveety (&quot;The Passion of the Christ&quot;) - examines Scripture, ancient writings, indisputable astronomical facts and more. Learn nine specific features of the star recorded in the Gospel of Matthew, how it established a date for Jesus' birth and death . . . and its significance for you today! Running time is approximately 65 minutes.\n\nStarry Night Software\n\nI just started working with Starry Night Pro and am simply amazed with how comprehensive it is and how simple it is to use. After reading just four or five pages of instructions, I am able to research the universe from my desktop (too much light pollution in my neighborhood to do it from my backyard).\n\nHere are just some of the things that you can do within minutes of installing the software...\n1) View and track progression of stars, quasars, man-made satellites, planets and constellations from your (or any) location and time zone\n2) View the starry night as if you were in another location (or time) in the universe (e.g. the Moon, Pluto, Sirius, or last week or a thousand years from now)\n3) Export Starry Night images to other applications\n4) Make quicktime movies of celestial events described by the Starry Night software\n\nNet/net:\n* Easy to use but POWERFUL astronomy tool\n* Excellent instruction manual\n* Good tie in from the Starry Night application to astronomy resources on the web\n* Obviously created by folks with a love and passion for the science of astronomy\n* MUST HAVE for anyone interested in astronomy\n\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:70f137525a4fad68d52974ab7e1b41bed089d643","amp;dn":"POtHS+-+Christmas+Special+2012+-++The+Star+of+Bethlehem+%26amp%3B+St","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70f137525a4fad68d52974ab7e1b41bed089d643","infoHashBuffer":{"type":"Buffer","data":[112,241,55,82,90,79,173,104,213,41,116,171,126,27,65,190,208,137,214,67]},"announce":[],"urlList":[]}}