{"title":"[NubileFilms] Sophie Lynx (Take It Outside / 07.09.2013)","uid":8667302,"size":341269821,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7370463017a25123468e66bce04b0e93318942da&amp;dn=%5BNubileFilms%5D+Sophie+Lynx+%28Take+It+Outside+%2F+07.09.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":2,"time":1373424462,"description":"[NubileFilms] Sophie Lynx (Take It Outside / 07.09.2013)\n\nAs she wanders outside and stops to pick a dandelion, Sophie Lynx indulges in a secret smile in anticipation of the pleasure that she will reap from her planned seduction. She spies her man Renato and pauses to get a good look at him before proceeding with her plans.\nRenato is amiable to Sophie's advances. Pulling her shirt and panties off, he presses his woman down to the outdoor bench and presses his mouth to the sweetness between her legs.\nThis is Sophie's seduction, so although she enjoys her man's oral ministrations she doesn't let it continue for long. Instead, she falls to her knees in front of him and opens her mouth to wrap her soft lips around the hardness of his erection. She is soon lost in the rhythm of the blowjob, using her hands, lips, and tongue to elicit enormous pleasure.\nAfter Renato makes sure that Sophie's twat remains wet and ready by delivering a loving, thorough pussy licking, Sophie mounts him cowgirl style and impales herself fully on his pulsing dick. She soon shifts to reverse cowgirl style, and then stands up so that her man can thrust into her warm hole from behind.\nThe deep penetration of doggy-style fucking hits just the right spot, and soon Sophie is moaning as she closes in on her orgasm. The couple shifts to their final position, with Sophie's bottom held high in the air while Renato drives into her from above, and she flies over the edge with a gasp.\nWishing her man the same pleasure she has just experienced, Sophie wraps her small hand around her beau's long cock and strokes him hard and fast. Her movements don't slow when he cums all over her face as she milks him for every last drop of jizz and then lovingly licks his dick clean\n\nScreens; &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=27ngt8z1kn4cts6d9swv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=27ngt8z1kn4cts6d9swv.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=s1t8vm108fmxouposzgh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=s1t8vm108fmxouposzgh.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7370463017a25123468e66bce04b0e93318942da","amp;dn":"%5BNubileFilms%5D+Sophie+Lynx+%28Take+It+Outside+%2F+07.09.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7370463017a25123468e66bce04b0e93318942da","infoHashBuffer":{"type":"Buffer","data":[115,112,70,48,23,162,81,35,70,142,102,188,224,75,14,147,49,137,66,218]},"announce":[],"urlList":[]}}