{"title":"Sexually Broken-18yr old rides the sybian Mattie Borders  Matt W","uid":8588323,"size":797149063,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:74d56b87c6b2d35f2d44235a8122b0bdc77f5466&amp;dn=Sexually+Broken-18yr+old+rides+the+sybian+Mattie+Borders++Matt+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1371580250,"description":"Southern 18yr old rides the sybian and swallows black cock for the first time. Brutal orgasms! | Mattie Borders | Matt Williams\n\nJune 17, 2013\n\n  \nMP4 only\n\n\nWe love firsts at Sexually Broken. In keeping with our tradition of not only offering the best and brightest stars in porn, we also offer the very freshest and newest of models. They don't get any fresher then Mattie Borders. She couldn't wait until she turned 18 so she could get the proper dicking down that only Sexuallybroken offers. She hunted us down and asked, no BEGGED, to work with us.\n\nWhen 18 year olds beg for cock, who are we to say no? We have given her her first cock on camera, now it is time for her very first sybian ride. The sybian is the world's most powerful vibrator. Strapped onto it, no pussy stands a chance. The orgasms will be ripped out of them, over and over, and there isn't a thing they can do to stop it. The sybian is the atomic bomb of vibrators. Let's see how Mattie handles her first sybian ride, shall we?\n\nNot content with just putting Mattie through her paces on the sybian, we add another first to the mix-her first BBC (big black cock). Once she is firmly tied down with no hope of escape, the two cocks begin to work her over. No chance to get on top of it, no chance to cheat, no escape. Mattie's air is cut off, her head is spinning, she is reduced to an animalistic state, just trying to survive. 10 inches of big black cock drill the back of her tender young throat. Drool pours out as her eyes glaze over. And all the while the sybian is working it's magic, causing her to become even more undone. Will she survive the massive cock and orgasms or is it all too much for her to take?\n\nBe careful what you wish for, it just might come true here at \nSexually Broken...\n\nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/06_17mborders2/SexuallyBroken-Mattie-Borders-Matt-Williams-Southern-18yr-old-rides-the-sybian-and-swallows-black-cock-for-the-first-time-Brutal-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/06_17mborders2/SexuallyBroken-Mattie-Borders-Matt-Williams-Southern-18yr-old-rides-the-sybian-and-swallows-black-cock-for-the-first-time-Brutal-orgasms.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:74d56b87c6b2d35f2d44235a8122b0bdc77f5466","amp;dn":"Sexually+Broken-18yr+old+rides+the+sybian+Mattie+Borders++Matt+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d56b87c6b2d35f2d44235a8122b0bdc77f5466","infoHashBuffer":{"type":"Buffer","data":[116,213,107,135,198,178,211,95,45,68,35,90,129,34,176,189,199,127,84,102]},"announce":[],"urlList":[]}}