{"title":"Michael Blanding - The Coke Machine [V8] Unabridged","uid":7821471,"size":325218851,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:762d1b538df0c043be6ff1768940dc837eb99611&amp;dn=Michael+Blanding+-+The+Coke+Machine+%5BV8%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"rambam1776","files":-1,"time":1352834013,"description":"Michael Blanding - The Coke Machine: The Dirty Truth Behind the World's Favorite Soft Drink\n\nUnabridged, V8, Read by George K. Wilson\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/coke-machine-michael-blanding/1100482599?ean=9781400188949&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/coke-machine-michael-blanding/1100482599?ean=9781400188949&lt;/a&gt;\n\nOverview\nThe Coke Machine takes readers deep inside the Coca-Cola Company and its international franchisees to reveal how they became the number one brand in the world, and just how far they'll go to stay there.\n\nEver since its &quot;I'd like to teach the world to sing&quot; commercials from the 1970s, Coca-Cola has billed itself as the world's beverage, uniting all colors and cultures in a mutual love of its caramel-sweet sugar water. The formula has worked incredibly well-making it one of the most profitable companies on the planet and &quot;Coca-Cola&quot; the world's second- most recognized word after &quot;hello.&quot; However, as the company expands its reach into both domestic and foreign markets, an increasing number of the world's citizens are finding the taste of Coke more bitter than sweet.\n\nJournalist Michael Blanding's The Coke Machine probes shocking accusations about the company's global impact, including:\n\n? Coca-Cola's history of winning at any cost, even if it meant that its franchisees were making deals with the Nazis and Guatemalan paramilitary squads\n\n? How Coke has harmed children's health and contributed to an obesity epidemic through exclusive soda contracts in schools\n\n? The horrific environmental impact of Coke bottling plants in India and Mexico, where water supplies have been decimated while toxic pollution has escalated\n\n? That Coke bottlers stand accused of conspiring with paramilitaries to threaten, kidnap, and murder union leaders in their bottling plants in Colombia\n\nA disturbing portrait drawn from an award-winning journalist's daring, in-depth research, The Coke Machine is the first comprehensive probe of the company and its secret formula for greed.\n\nCOKE is a registered trademark of The Coca-Cola Company.\nThis book is not authorized by or endorsed by The Coca-Cola Company.\n\nLibrary Journal\nIn his first book, Boston magazine contributing editor Blanding (www.michaelblanding.com) provides an inside look at the Coca-Cola Company and its international franchises, tracking the company's century-long history and continuing growth, revealing relatively unknown facts about the famous formula and its pioneering creators, and exploring accusations regarding the company's negative global impact. George K. Wilson's (A Dog's Purpose) steady and solid narration sustains listeners' attention throughout this detailed case analysis that follows in the footsteps of The Jungle, Upton Sinclair's classic work of muckraking. Blanding's approach to the story of this important business is tough and unsweet, and he adds many revealing details not covered in Mark Pendergrast's For God, Country, and Coca-Cola or Valerie Bodden's The Story of Coca-Cola. Highly recommended for all business students.","torrent":{"xt":"urn:btih:762d1b538df0c043be6ff1768940dc837eb99611","amp;dn":"Michael+Blanding+-+The+Coke+Machine+%5BV8%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"762d1b538df0c043be6ff1768940dc837eb99611","infoHashBuffer":{"type":"Buffer","data":[118,45,27,83,141,240,192,67,190,111,241,118,137,64,220,131,126,185,150,17]},"announce":[],"urlList":[]}}