{"title":"Alex Jones Show - 2013 Jun 17 MO [sebaygo1]","uid":8585290,"size":64417505,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:773432016901bb0a50be4b6825d26812f10b6b8a&amp;dn=Alex+Jones+Show+-+2013+Jun+17+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1371513132,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nMonday, 17 June 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Monday, June 17 edition of The Alex Jones Show, Alex analyzes the accelerating trend towards transhumanism, or the merging of man with machine, as a Russian multimillionaire announces he's quite serious immortality can be achieved by 2035. \n\nWe'll also continue discussing the subversion of the Constitution, as one student's First Amendment rights are trampled upon for wearing a shirt supporting the Second, up to and including being accused of making &quot;terroristic threats.&quot; \n\nOn today's show, Alex welcomes television broadcaster and economic analyst Max Keiser to break down the fallout from Bilderberg 2013 coverage and the collapse of the current bankster regime, as well as the goal of G8 protests in Belfast. \n\nAlex will also touch on other important news items like Obama's plunging approval rating, the controversial amnesty bill, and news that IRS targeting of Conservative groups was further widespread than previously reported.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:773432016901bb0a50be4b6825d26812f10b6b8a","amp;dn":"Alex+Jones+Show+-+2013+Jun+17+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773432016901bb0a50be4b6825d26812f10b6b8a","infoHashBuffer":{"type":"Buffer","data":[119,52,50,1,105,1,187,10,80,190,75,104,37,210,104,18,241,11,107,138]},"announce":[],"urlList":[]}}