{"title":"In search of the lost colour -The story of natural dyes","uid":7809190,"size":2052051578,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:78328b38301c45afd4d557311cb5c45fb48fb7bf&amp;dn=In+search+of+the+lost+colour+-The+story+of+natural+dyes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"LochDhueDude","files":-1,"time":1352481057,"description":"In search of the lost colour -The story of natural dyes\n\nTrailer\n\nVideo MPEG H264 640x480\nAudio Stereo 48 KHz\n\nDescription\n\n\nModern synthetic dyes can colour almost any material in a vast range of hues. So powerful and far reaching is this technology that it comes as a surprise to learn that only 150 years ago absolutely everything was dyed naturally.\n\nThe film travels the world to document the growing, harvesting, extraction and use of natural dyes. From the Bogolanfini mudprintÂ­ing of Mali to the madder-root of Turkey, from the cochineal insects to the rare shellfish purple, this documentary provides a look at some of the most exotic colours in existence.\n\nThe feature-length documentary looks at an astonishing range of dye techniques - from the caracol purpura snail in Mexico to the lac insects of laos, from jackfruit root to the most famous root of all: madder. The resurgence of natural dyes and our contemporary ideas of colour will be explored in a historical context and in relation to the rise of a global colour industry.\n\nIn many areas the use of natural dyes is perilously close to extinction and yet traditional techniques and cultures often use processes which are environmentally sound and economically beneficial. Join us for an unforgettable exploration into the history of colour and its use.\n\nBorn from a need to document the evanescent world of craft the film is part of a 4 film series of compelling and insightful documentaries.\n\nWorking mainly with India, but also with several other areas, the films document the production of embroidered, block printed, hand-woven, and naturally dyed textiles. Focusing on areas where excellence is still the tradition, these documentaries are deeply concerned with the viability of craft and the lives of the artisans.","torrent":{"xt":"urn:btih:78328b38301c45afd4d557311cb5c45fb48fb7bf","amp;dn":"In+search+of+the+lost+colour+-The+story+of+natural+dyes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78328b38301c45afd4d557311cb5c45fb48fb7bf","infoHashBuffer":{"type":"Buffer","data":[120,50,139,56,48,28,69,175,212,213,87,49,28,181,196,95,180,143,183,191]},"announce":[],"urlList":[]}}