{"title":"Coast to Coast AM December 03 2012","uid":7887088,"size":56693693,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:78a45bbd4bee93b042da21f4cb9f293d2d18558d&amp;dn=Coast+to+Coast+AM+December+03+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1354637919,"description":"A Godless Cosmos\nShow Audio\nListen with Windows Player  High  Low\nListen with Custom Player\n(Pop-up blockers may need to be disabled)\nDownload MP3s\nHour 1   Hour 2   Hour 3   Hour 4   \nIMPORTANT: Some mobile devices do not download MP3s. Please use your desktop computer if this is the case.\nDate: \t12-03-12\nHost: \tGeorge Noory\nGuests: \tJim Sparks, Craig R. Smith, Howard Bloom\n\nSurprise main guest, author Howard Bloom discussed his new book The God Problem. &quot;If you've got a universe without a god, how does it make itself?&quot; he pondered. An atheist, who doesn't decry religion as some well-known atheists do, Bloom said he searched for truths in a material cosmos inhabited by immaterial things, without going off into the realm of the spiritual. He cited a wave in the ocean as an example of the material power in immaterial things in that it retains its shape even as it's continually changing and made up of shifting water particles, and that when it arrives on shore, its particles are completely different than what it was composed of earlier.\n\nBloom shared several scientific heresies that he uncovered. The idea of randomness in the development of the universe is wrong-- quarks came out in only 16 different forms-- &quot;that's not wild and abandoned randomness, that's just a very small number of choices coming out of the universe,&quot; he commented. The concept of entropy is also mistaken, he continued. &quot;The universe is not falling apart, the universe is constantly falling together.&quot; He also cited the power of attraction in molecules as a kind of miracle, and suggested that the power of prayer works because if a person knows they're being prayed for, it helps them to realize that their existence is necessary.\nJim Sparks Update\n\nAlien abductee Jim Sparks appeared only during first half of the second hour, due to problems with his phone line. He noted that the first six years of his experience with the ETs were traumatizing and terrible. Unlike most other abductees, his memories of the encounters were conscious, and these troubled him as he went about his life. He worked with researcher Budd Hopkins, and was one of the first abductees that didn't need hypnosis to recall incidents. The ETs use telepathy to communicate, and have the technology to cloak themselves, and their craft, said Sparks, adding that they also have the ability to time travel, and some beings have visited us from 300-500 years in the future. For more, check out a documentary video excerpt Sparks shared with us.\nAmerica's Economy\n\nFirst hour guest, author and tangible asset expert Craig R. Smith addressed the economic problems facing the US, including the 'fiscal cliff.' If the tax cuts aren't reinstated, it would generate a large amount of revenue that could go toward the federal deficit, even though it would bring on a recession, he noted. Smith cited the &quot;debasement&quot; of the dollar, and how its value has been gradually siphoned away, as one of America's biggest financial issues. Returning to the gold standard could be a very viable option as a long term fix for this problem, he suggested.\n\nNews segment guests: Katherine Albrecht, Nick Begich\nWebsite(s):\n\n    jim-sparks.com\n    craigrsmith.com\n    HowardBloom.net\n    bigbangtango.net\n\nVideo(s):\n\n    The Visitor Phenomenon\n\nBook(s):\n\n    The Keepers: An Alien Message for the Human Race\n    The Great Debasement\n    Crashing the Dollar\n    The God Problem\n\n","torrent":{"xt":"urn:btih:78a45bbd4bee93b042da21f4cb9f293d2d18558d","amp;dn":"Coast+to+Coast+AM+December+03+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78a45bbd4bee93b042da21f4cb9f293d2d18558d","infoHashBuffer":{"type":"Buffer","data":[120,164,91,189,75,238,147,176,66,218,33,244,203,159,41,61,45,24,85,141]},"announce":[],"urlList":[]}}