{"title":"TSSeduction---TS-31492 TS Foxxy and Tony Orlando WMV","uid":8592713,"size":530234942,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:797be08fdad21987093f59563be3b83fd22ca322&amp;dn=TSSeduction---TS-31492+TS+Foxxy+and+Tony+Orlando+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1371681942,"description":"The New Gaping Hole: When Your Model Application Becomes Reality\n\nJun 19, 2013 - Performers: TS Foxxy  and  Tony Orlando \n\n\nWMV only. MP4 + Pics later.\n  \n\nTony filled out his model application, took naked pictures of himself with his cock nice and hard and even went out and got tied up in a few other porn movies. He's ready, he thinks. But how ready can you be for your fantasy to come to life? \n\nThe worst thing that could happen is that those vivid images that have driven every boner, every orgasm either alone or with someone else for so long, would finally become a reality but only to be a disappointment. \n \nWhat if she doesn't slap as hard as you dreamed, or her cock doesn't stretch your hole in a way that made you feel totally helpless. Maybe she would not be able to pin you down with rope and domination enough to keep the intense feeling of udder submission on the tip of your tongue. \n\nYes that's a fear, but not today. Not with Foxxy how will fuck you until your ass gapes and milk a load so big out of your hard cock that when she slips back into your ass hole to fuck you more you don't even have time to think about anything else - everything is happening to your body and happening fast. It's relentless and real and Foxxy's hard cock is cumming all over you and she's feeding you her cum and this is more than you could have EVER fantasized about, THIS is TsSeduction.com\n\nScreens &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=31492&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=31492&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:797be08fdad21987093f59563be3b83fd22ca322","amp;dn":"TSSeduction---TS-31492+TS+Foxxy+and+Tony+Orlando+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"797be08fdad21987093f59563be3b83fd22ca322","infoHashBuffer":{"type":"Buffer","data":[121,123,224,143,218,210,25,135,9,63,89,86,59,227,184,63,210,44,163,34]},"announce":[],"urlList":[]}}