{"title":"Up with Chris Hayes 12-1-12.mp4","uid":7884512,"size":360901644,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7b8a74c9a0bebe549e1ae1aaaa53181724e96c29&amp;dn=Up+with+Chris+Hayes+12-1-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1354581738,"description":"Up with Chris Hayes; Saturday, December 1, 2012.\n\nJoining Chris on Saturday were:\n\nRichard Arenberg (co-author of Defending the Filibuster: The Soul of the Senate&quot;), Alan Frumin (former Senate Parliamentarian and author of  &quot;Riddicks Senate Procedure&quot;), Akhil Amar (Yale Law School professor and author of &quot;America's Unwritten Constitution: The Precedents and Principles We Live By&quot;), Victoria DeFrancesco Soto (MSNBC contributor, senior analyst at Latino Decisions and fellow at the LBJ School of Public Affairs at the University of Texas-Austin) joined to discuss how the filibuster works, and how it affects the Senate's ability to function.\n\nSen. Jeff Merkley (D-OR), a leading advocate of filibuster reform) joined via satellite to discuss what the senate intends to do to fix the filibuster.\n\nThen, Sam Seder (host of The Majority Report on majority.fm and co-host of, Ring of Fire) replaced Alan Frumin on the panel, and Don Peebles (chairman and CEO of The Peebles Corporation and member of President Obama's National Finance Committee) joined and replaced Akhil Amar on the panel which examined the White House's deficit reduction offer (to evade the fiscal curve) to Congressional Republicans, and what those proposals could mean for the future of social insurance programs like Social Security and Medicare.\n\nDanielle Brian (executive director for the Project On Government Oversight), Eyal Press (author of &quot;Beautiful Souls: Saying No, Breaking Ranks and Heeding the Voice of Conscience in Dark Times&quot;), Ed Pilkington (chief reporter for guardiannews.com, former national and foreign editor of the paper and author of &quot;Beyond the Mother Country&quot;), Zachary Iscol (Trumand Natl. Security Project, Frmr. Marine) discussed Whistle-blowers and the case of Bradley Manning, the army private accused of leaking thousands of classified documents to the website WikiLeaks. Manning testified for the first time in military court this week on the conditions of his detention over the past two years.\n\nThe latest panel stayed for 'You Should Know'.\n","torrent":{"xt":"urn:btih:7b8a74c9a0bebe549e1ae1aaaa53181724e96c29","amp;dn":"Up+with+Chris+Hayes+12-1-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b8a74c9a0bebe549e1ae1aaaa53181724e96c29","infoHashBuffer":{"type":"Buffer","data":[123,138,116,201,160,190,190,84,158,26,225,170,170,83,24,23,36,233,108,41]},"announce":[],"urlList":[]}}