{"title":"POtHS - Modern Martyers Vol 8 - Harvest of Despair","uid":8567915,"size":4754421863,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7f7f04e47149caa36e12a15ffa62140e13036bbe&amp;dn=POtHS+-+Modern+Martyers+Vol+8+-+Harvest+of+Despair&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1371066596,"description":"\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nModern Martyers Vol 8\n\n\nHarvest of Despair\n\n\n\n\nPOtHS - Modern Martyers Vol 8 - Harvest of Despair\n\n\nPOtHS Comment:   No info on this one.\n\nDescription\n\nHarvest of Despair Silent Genocide of 10 Million Christians in 1932:\nIt is called the forgotten holocaust - a time when Stalin was dumping millions of tons of wheat on Western markets, while in Ukraine, men, women, and children were dying of starvation at the rate of 25,000 a day, 17 human beings a minute. Seven to ten million people perished in a famine caused not by war or natural disasters, but by ruthless decree.\n\n\nTo commemorate the 50th anniversary of this tragedy the Ukrainian Famine Research Committee (former name of UCRDC) gathered materials, sought out eye-witnesses and documented this horrific event. Harvest of Despair is the product of this effort.\n\n\nThe documentary probes the tragic consequences of Ukraine's struggle for greater cultural and political autonomy in the 1920s and 1930s. Through rare archival footage, the results of Stalin's lethal countermeasures unfold in harrowing detail....\n---------------------------------------------------------------------------------------------------------------------\n\nThe Great Controversy Chapter 5 John Wycliffe:\nBefore the Reformation there were at times but very few copies of the Bible in existence, but God had not suffered His word to be wholly destroyed. Its truths were not to be forever hidden. He could as easily unchain the words of life as He could open prison doors and unbolt iron gates to set His servants free. In the different countries of Europe men were moved by the Spirit of God to search for the truth as for hid treasures. Providentially guided to the Holy Scriptures, they studied the sacred pages with intense interest. They were willing to accept the light at any cost to themselves. Though they did not see all things clearly, they were enabled to perceive many long-buried truths. As Heaven-sent messengers they went forth, rending asunder the chains of error and superstition, and calling upon those who had been so long enslaved, to arise and assert their liberty...\n\nIn the fourteenth century arose in England the &quot;morning star of the Reformation.&quot; John Wycliffe was the herald of reform, not for England alone, but for all Christendom. The great protest against Rome which it was permitted him to utter was never to be silenced. That protest opened the struggle which was to result in the emancipation of individuals, of churches, and of nations...\n--------------------------------------------------------------------------------------------------------------------\n\nThe Persecution of The Christians has already begun:\nAmerica has already begun persecuting Christians , Very soon there will be pain and sorrows even death for true believers in Jesus.I guess people of America needs to strengthen their spiritual side of life in Christ and prepare for the worst that to come.FEAR NOT LORDS PEOPLE. JESUS IS WITH YOU EVEN UNTIL THE END.\n\nLet us return to John 15: 18-21 If the world hate you, ye know that it hated \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:7f7f04e47149caa36e12a15ffa62140e13036bbe","amp;dn":"POtHS+-+Modern+Martyers+Vol+8+-+Harvest+of+Despair","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f7f04e47149caa36e12a15ffa62140e13036bbe","infoHashBuffer":{"type":"Buffer","data":[127,127,4,228,113,73,202,163,110,18,161,95,250,98,20,14,19,3,107,190]},"announce":[],"urlList":[]}}