{"title":"The Ed Show 11-8-12.mp4","uid":7807810,"size":189631024,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:845d025202a9933dfdad64c3d1e495b5a7cd1273&amp;dn=The+Ed+Show+11-8-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1352451336,"description":"The Ed Show; November 8, 2012.\n\n\nAfter winning the popular vote for the White House, Senate and House, President Obama and the Democrats are promising to stand strong on the fiscal cliff.\n\nBut Republicans in Congress won't go down easy.\n\nEd welcomed Sen. Bernie Sanders (I-VT) to remind the president that he has the upper hand.\n\nThen, the Citizens United disaster continues to unfold for Republicans.  Sen. Sherrod Brown (D-OH) discussed his victory over dark money in the Buckeye State.\n\nWhite people get to vote while African American and Hispanic voters wait in line. Ed reported on a shocking new study with reaction and analysis from Krystal Ball (Co-host, The Cycle and Former Candidate for U.S. Congress),  and Ari Melber (Correspondent for The Nation).\n\nRighties continued to freak out over the death of &quot;traditional America.&quot; Eugene Robinson (MSNBC Analyst and Associate Editor and Pulitzer Prize winning columnist for the Washington Post), reported on the conservative panic over minority voters.\n\nThe CEO who threatened to fire his workers if Obama was elected is reacting to the big win for the Democrats. Ed explained what was said.\n\nAnd in the Big Finish, it turns out the entire Romney campaign thought all the polls were skewed. Ed went go inside the Republican bubble with Michael Tomasky (Special Correspondent,The Daily Beast).","torrent":{"xt":"urn:btih:845d025202a9933dfdad64c3d1e495b5a7cd1273","amp;dn":"The+Ed+Show+11-8-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"845d025202a9933dfdad64c3d1e495b5a7cd1273","infoHashBuffer":{"type":"Buffer","data":[132,93,2,82,2,169,147,61,253,173,100,195,209,228,149,181,167,205,18,115]},"announce":[],"urlList":[]}}