{"title":"Train Simulator 2013 - Sherman Hill","uid":7820657,"size":721095787,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:868d6c4106f676e9dd822abb36cb59a178d852a4&amp;dn=Train+Simulator+2013+-+Sherman+Hill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IiTraxiI","files":-1,"time":1352813289,"description":"About the Game\nSherman Hill is a fantastic North American freight route, and now you can be the engineer on your own trains on this great railroad line in Train Simulator.\n\nRunning 60 miles between Cheyenne and Laramie, Wyoming, the route is well-known for the tough grades which resulted in the Union Pacific Railroad building new heavy freight locomotives to work the line. The first single track railroad was laid in 1868, passing over the summit at 8,247 feet, and the route was steadily upgraded with double tracks and stronger bridges in the following decades.\n\nThe Sherman Hill route for Train Simulator features a superb fleet of Union Pacific diesel locomotives including the SD70M, SD40-2, ES44C and SW10, plus some seriously long freight trains for you to haul over the grades. Six scenarios will help you explore this great railroad line, and drivers also have the option of taking Track #3 to Laramie.\n\nIncludes:\nSherman Hill route from Laramie to Cheyenne, Wyoming featuring Track #3 and the famous Dale Rocks, plus realistic storm effects. Union Pacific ES44AC, SD70M, SD40-2 and SW10 locomotives and appropriate rolling stock.\n\n6 scenarios:\nIntroduction to Sherman Hill Welcome to Cheyenne Granite via Wycon Running the #3 Track The Midnight Magnet Arrival of the Thunderheads\n\nOur thanks to Train Simulator player Tim Major who suggested the concept for The Midnight Magnet.","torrent":{"xt":"urn:btih:868d6c4106f676e9dd822abb36cb59a178d852a4","amp;dn":"Train+Simulator+2013+-+Sherman+Hill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"868d6c4106f676e9dd822abb36cb59a178d852a4","infoHashBuffer":{"type":"Buffer","data":[134,141,108,65,6,246,118,233,221,130,42,187,54,203,89,161,120,216,82,164]},"announce":[],"urlList":[]}}