{"title":"Core FTP Pro 2.2.1765 Portable (registred)","uid":7902782,"size":4782825,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:86f6ea4ceda1bb2bc3c6ed37b32791754a4e4ce4&amp;dn=Core+FTP+Pro+2.2.1765+Portable+%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1354999874,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnassasary regestry changes,\nThis makes a portable version a better version.\n\nFeatures like SFTP (SSH), SSL, TLS, FTPS, IDN, browser integration, site to site transfers, FTP transfer resume, drag and drop support, file viewing &amp; editing, firewall support, custom commands, FTP URL parsing, command line transfers, filters, and much, much more! \n\nThis free, secure FTP client gives you a fast, easy, reliable way to update and maintain your website via FTP. It also provides a secure method (via SSL, TLS, FTPS, HTTPS, or SFTP) to upload / download files to and from FTP servers. Check out the list of features and you'll find almost every feature you need, all in a free ftp program. There are no popup ads, advertising or spyware and you're never asked or reminded to register. \n\nFor advanced users, Core FTP Pro is available with advanced features you need. Our goal is simply to bring you the best FTP software on the internet. Look at the list of features you get with Core FTP Pro - solve all your current and future ftp client needs for one low price... \n\nWith Core FTP Pro, now you can:\n\nEncrypt and decrypt files to servers using the latest encryption methods. \nSchedule ftp transfers (unattended) without additional services. \nIBM Information Exchange support with command line updates. \nEmail notification, external program execution, &amp; Ping/TraceRoute included. \nView thumbnails images of remote directories (in 4 different sizes). \nZip support - Compress, password protect, and backup to FTP securely.","torrent":{"xt":"urn:btih:86f6ea4ceda1bb2bc3c6ed37b32791754a4e4ce4","amp;dn":"Core+FTP+Pro+2.2.1765+Portable+%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f6ea4ceda1bb2bc3c6ed37b32791754a4e4ce4","infoHashBuffer":{"type":"Buffer","data":[134,246,234,76,237,161,187,43,195,198,237,55,179,39,145,117,74,78,76,228]},"announce":[],"urlList":[]}}