{"title":"Vinux 4.0","uid":8530187,"size":5236183084,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:8985cf7a31dce9d1478631c4102cfc7d0610b595&amp;dn=Vinux+4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kvark112","files":-1,"time":1370127659,"description":"Vinux is a Ubuntu derived distribution optimised for the needs of blind and partially sighted users. By default Vinux provides two screen-readers, Braille display support and a friendly community.\nWhen you boot the live Vinux image, you will be greeted by the Orca screen reader enabling you to navigate the graphical Gnome desktop using keyboard commands. Finally, Brltty provides Grade 1 and 2 Braille output via Orca.\n\nThis is the first Vinux release featuring the Unity-2d Desktop which improves on transition to Vinux and introduces newer and increasingly stable accessibility features.\nWe now recommend that when possible users perform updates on a regular basis. This will enable the Vinux team to update packages, and introduce new features.\n\nSome of the highlights in Vinux 4.0:\nBrand new build process: Vinux now uses the same method to produce our images as Cannonical produces Ubuntu.\nConsole speech just works. Much time and work has taken place to meet our blueprint goal https://blueprints.launchpad.net/vinux/+spec/vinux-4-functional-console-screen-reader\nVoxin is easy to set-up. Vinux has taken one step further in making Voxin easier to install.\nQuantal kernel: We are using a newer 3.5 kernel back ported to Precise offering better hardware support than ever.\nClassic menu. Vinux now has a Classic menu indicator which provides the old style menu whilst in a Unity environment.\nVinux wiki. Our community is highly committed to providing clear and easy to follow documentation. http://wiki.vinuxproject.org/\nVinux easy install scripts converted to meta packages.\nPico voices. We are shipping with the Pico voices once again.\n\nFixes:\nImages now work on optical and USB media instead of separate builds in the past.\nWeather indicator fixed, previously stopped working due to API changes.\nGnome login sound fixed, Ubuntu set to be disabled by default.\nFresh and clean sound theme added.\nPC speaker beep removed from blacklist, console users can again use it.\nConsole branding. Vinux will identify itself at a virtual terminal and upon login offer tips of the day.\nFlite and Pico now available as separate packages.\nCicero moved to a separate package also, will stop loss of speech from the curious.\nRevised keyboard shortcuts.\n\nSoftware:\nunity-2d 5.14\nLibreOffice 3.5.7 &lt;DVD only&gt;\nSpeech-dispatcher 0.8\n Gnome-orca 3.4.2\nEspeak 1.47\nFirefox 21.0\nThunderbird 17.0\nCry for help, remote assistance by Vinux gurus.\nJust to mention a few.\n\nKnown bugs:\nThe indicator panel is not accessible from Firefox and Thunderbird.\nConsole speech has been completed, but it probably needs some stability improvement.\n\nAvailability:\nVinux 4.0 is now available in the AMD64 and i386 architectures and available in both CD and DVD versions.\n\nDVD:\nThis contains everything necessary to install the Vinux operating system and a collection of pre-defined packages aimed at visually impaired users. This should be all you need if you can burn and use DVD-sized media.\n\nCD:\nThis also contains everything necessary to install the Vinux operating system and a collection of pre-defined packages aimed at visually impaired users. Use this image if you can only burn and use CD-sized media.\n\nVinux 4.0 can be installed from optical media or from a USB memory stick. The required files can be downloaded via HTTP as described below.\n\nSupport:\nThe Vinux development team currently plans on supporting 4.0 until June 2015.\nOur mailing list has a supportive community on Google groups at http://groups.google.com/group/vinux-support or you can subscribe by sending an email to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f4829d9a818cd9878184849b8680df8781968797869d9691b4939b9b93989193869b818487da979b99&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:8985cf7a31dce9d1478631c4102cfc7d0610b595","amp;dn":"Vinux+4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8985cf7a31dce9d1478631c4102cfc7d0610b595","infoHashBuffer":{"type":"Buffer","data":[137,133,207,122,49,220,233,209,71,134,49,196,16,44,252,125,6,16,181,149]},"announce":[],"urlList":[]}}