{"title":"Red dead redemption ps3","uid":8651341,"size":7978264082,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:8b7e138473a1100a49930788ab50524353dcc5a4&amp;dn=Red+dead+redemption+ps3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"salh7890","files":-1,"time":1373071092,"description":"Red Dead Redemption is a 2010 open world Western action-adventure video game, developed by Rockstar San Diego and published by Rockstar Games. It was released for the PlayStation 3 and Xbox 360 on May 18, 2010. It is a spiritual successor to 2004's Red Dead Revolver. Most of the game's story takes place in the year 1911, during the decline of the American Frontier. The game follows John Marston, a former outlaw whose wife and son are taken hostage by the government in ransom for his services as a bounty hunter. Having no other choice, Marston sets out to bring the three members of his former gang to justice.\nUpon its release, Red Dead Redemption was met with universal critical acclaim, averaging approximately 95/100, 94% and 9.3/10 on review aggregate websites Metacritic, GameRankings, and GameStats, respectively, making it one of the highest-rated video games of all time. It won several Game of the Year awards. Reviewers praised the visuals, music, voice acting, open world gameplay and the story. As of February 2012, the Red Dead franchise has sold over 13 million copies. IGN also praised the game highly, ranking it third on their list of best games of this generation.\nAfter the game's release, several downloadable content (DLC) additions were released. Red Dead Redemption: Undead Nightmare, which was also released as a standalone game, added a new single-player experience in which John Marston searches for a cure for an infectious zombie plague that has swept across the Old West. A Game of the Year Edition containing all additional content was released in October 2011.","torrent":{"xt":"urn:btih:8b7e138473a1100a49930788ab50524353dcc5a4","amp;dn":"Red+dead+redemption+ps3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b7e138473a1100a49930788ab50524353dcc5a4","infoHashBuffer":{"type":"Buffer","data":[139,126,19,132,115,161,16,10,73,147,7,136,171,80,82,67,83,220,197,164]},"announce":[],"urlList":[]}}