{"title":"WinRAR 4.20 Final","uid":8587318,"size":10118832,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8bde6f2054937fd40e5bfd4a4f1cb2fe2d721611&amp;dn=WinRAR+4.20+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erwin001","files":7,"time":1371565245,"description":"WinRAR 4.20 Final - Year / Date of Release: 2012\nVersion: 4.20\n\nDeveloper: Copyright Â© 1993-2012 Alexander Roshal\n\nWebsite Developer: http://www.rarlab.com/ - Bit: 32bit +64 bit\n\nLanguage: English + Russian + Ukrainian\n\nTablet: - Compatible with Windows XP: complete (all editions)\n\nCompatible with Windows Vista: complete (all editions)\nCompatible with Windows 7 full time (all editions)\nCompatible with Windows 8: complete (all editions) - System requirements:\nProcessor: Intel Pentium (or compatible)\nOperating system: Windows 95, 98, Me, NT 4.0, 2000, 2003, XP, Vista, 7, 8\nMemory: 64MB\n\nFree disk space: 3MB - Description: WinRAR - is a powerful utility for creating and managing archives, containing a range of additional useful features.\nWith WinRAR you can compress files by 8-15% better and often faster than do competing products. This will save disk space and transmission costs, and most importantly, expensive time.\nWinRAR supports all popular archive formats (RAR, ZIP, CAB, ARJ, LZH, ACE, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip).\nWinRAR is ideal for multimedia files compression. The program automatically recognizes the format of the file and selects the optimum method of packaging.\nWinRAR allows you to split archives into separate volumes for their records to removable media.\nWinRAR is ideal for the transmission of sensitive data over the Internet and other unprotected channels. 128-bit encryption and electronic signatures archives do not give criminals a chance to learn your secrets.\nWinRAR - it's shareware-product that gives the opportunity to try the product before you buy within 40 days.\nOne license WinRAR offers the ability to use the product on all platforms and languages.\n\nExtras. Information:\nMain features of WinRAR:\n&quot;Full support for RAR and ZIP.\n&quot;Using the original high-performance data compression algorithm.\n&quot;Having a graphical environment that supports drag and drop (drag &amp; drop).\n&quot;You can use the command line interface.\n&quot;Managing the archives of other formats (CAB, ARJ, LZH, TAR, GZ, TAR.GZ, BZ2, TAR.BZ2, ACE, UUE, JAR, ISO, 7Z, Z).\n&quot;Support for the method of continuous backup for better compression.\n&quot;Support of multivolume archives.\n&quot;Creating self-extracting (SFX) conventional and multivolume archives with a standard or optional modules SFX.\n&quot;The ability to recover physically damaged archives.\n&quot;The ability to create and use of recovery volumes, allowing to reconstruct missing parts of multivolume archives.\n&quot;Support for Unicode encoding in filenames.\n&quot;Additional functions (data encryption and file names in the archive, add comments archival, management protocol error).\n\n","torrent":{"xt":"urn:btih:8bde6f2054937fd40e5bfd4a4f1cb2fe2d721611","amp;dn":"WinRAR+4.20+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bde6f2054937fd40e5bfd4a4f1cb2fe2d721611","infoHashBuffer":{"type":"Buffer","data":[139,222,111,32,84,147,127,212,14,91,253,74,79,28,178,254,45,114,22,17]},"announce":[],"urlList":[]}}