{"title":"Space Warriors (2013) DR2DVD DD 5.1 NL Subs TBS TBS","uid":8648000,"size":4627157389,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8df69f8d4ba1a0a260ff605571b77ba79269eb27&amp;dn=Space+Warriors+%282013%29+DR2DVD+DD+5.1+NL+Subs+TBS+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Marjanb","files":-1,"time":1373038352,"description":"Space Warriors (2013) DR2DVD DD 5.1 NL Subs TBS TBS\n\nSpace Warriors (2013)\n\n\nVerenigde Staten\nFamily\n93 minuten\n\ngeregisseerd door Sean McNamara\nmet Josh Lucas, Dermot Mulroney, Mira Sorvino\n\n\nJimmy Hawkins (Thomas Horn, Extremely Loud and Incredibly Close) has always dreamed of traveling to outer space. The son of a retired NASA astronaut who lived on the International Space Station, Jimmy has lived and breathed astrophysics his entire life.\n\nWhen an opportunity arises to compete and win a seat on the next space shuttle, Jimmy desperately wants to apply. But Jimmys parents, Capt. Andy Hawkins (Dermot Mulroney) and Sally Hawkins (Oscar Winner Mira Sorvino) have strong reservations about their son becoming an astronaut.\n\nJimmy, knowing his parents would not approve, secretly applies to attend a special space camp at the Space &amp; Rocket Center. The summer camp, run by tough but kind-hearted former astronaut, Col. Roy Manley (Josh Lucas), is designed to pull teens with scientific specialties from across the globe to create an elite team, The Warriors. This team will battle for the chance to win a seat on the next shuttle into space. Together they test their skills against a strong but devious opposition, The Titans. In the process, Jimmy also falls for the beautiful and talented pilot, Lacey, who has secrets of her own. Near the conclusion of the competition, there is an urgent crisis aboard the International Space Station. When the high-ranking NASA official, Commander Phillips (Danny Glover), has run out of options, it becomes clear that it will be up to these kids to solve the problem and save the lives of astronauts and cosmonauts 200 miles from earth. Using their skills and ability to work together as a team, this group of kids hatches a brilliant plan that just might save the day. Filmed on locations at the Space Camp in Huntsville, Alabama on the 43rd anniversary of Apollo 11 landing on the moon and incorporating historic events, archival footage and amazing special effects, this film will take your family on an inspirational journey through space and directly into the hearts of kids. Space Warriors is directed by Sean McNamara (Soul Surfer, Disney TV) Produced by Jason Netter of Kickstart Entertainment and Trevor Drinkwater of ARC Entertainment in collaboration with the U.S. Space &amp; Rocket Center Space Camp. Developed to rekindle an interest and excitement in space travel and research, the film also hopes to inspire a country to invest again in the infinite adventure and possibility of the world outside our own.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2328745/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2328745/&lt;/a&gt;\n\nMovie..............: Space Warriors (2013)\nGenre..............: Family\nSource.............: Space Warriors 2013 DVDRip Xvid AC3 UnKnOwN\nRuntime............: 93 minuten.\nFormat.............: DVDR\nMenu...............: Nope\nVideo..............: Mpeg.Enc.@.2.Pass\nAudio..............: English DD 5.1\nSubtitles.NL.......: Vertaald door: RedRose en Romarijn, Heel goed Klasse job \nControle...........: Suurtje\nBewerking+Resync...: Suurtje, very nice Job thanx m8innetje.\n\nEnjoy The Movie\n\nBenieuwd naar ons? Kom eens kijken\n\n\n","torrent":{"xt":"urn:btih:8df69f8d4ba1a0a260ff605571b77ba79269eb27","amp;dn":"Space+Warriors+%282013%29+DR2DVD+DD+5.1+NL+Subs+TBS+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8df69f8d4ba1a0a260ff605571b77ba79269eb27","infoHashBuffer":{"type":"Buffer","data":[141,246,159,141,75,161,160,162,96,255,96,85,113,183,123,167,146,105,235,39]},"announce":[],"urlList":[]}}