{"title":"Martin Dillon - The Trigger Men (mobi + epub)","uid":7887810,"size":1044532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:910a6e6c14bed6c94e2a5263f7f741c3c58e0120&amp;dn=Martin+Dillon+-+The+Trigger+Men+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kevinkray","files":-1,"time":1354656049,"description":"In The Trigger Men bestselling author Martin Dillon delves into the dark and sinister world of Irish terrorism and counter-terrorism. Over three decades he has interviewed and investigated some of the most professional dangerous and ruthless killers in Ireland. Now Dillon explores their personalities motivations and bizarre crimes.Many of Ireland's assassins learned their trade in fields and on hillsides in remote parts of Ireland while others were trained in the Middle East or with Basque separatist terrorists in Spain. Some were one-target-one-shot killers like the sniper who terrorised the inhabitants of Washington State in the autumn of 2002 while others were bombers skilled in designing the most sophisticated explosive devices and booby traps. Another more powerful group of 'trigger men' were the influential figures in the shadows who were experts in motivating the killers under their control. All of these men whether they squeezed the trigger on a high-powered rifle set the timer on a bomb or used their authority to send others out to commit horrific and unspeakable acts of cruelty are featured in this book. The Trigger Men takes the reader inside the labyrinthine world of terrorist cells and highly classified counter-terrorism units of British Military Intelligence. The individual stories are described in gripping unflinching detail and show how the terrorists carried out their ghastly work. Dillon also explores the ideology of the cult of the gunmen and the greed and hatred that motivated assassins in their killing sprees. There are penetrating insights into the mindset of the most infamous assassins: their social and historical conditioning their callousness...... ","torrent":{"xt":"urn:btih:910a6e6c14bed6c94e2a5263f7f741c3c58e0120","amp;dn":"Martin+Dillon+-+The+Trigger+Men+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"910a6e6c14bed6c94e2a5263f7f741c3c58e0120","infoHashBuffer":{"type":"Buffer","data":[145,10,110,108,20,190,214,201,78,42,82,99,247,247,65,195,197,142,1,32]},"announce":[],"urlList":[]}}