{"title":"YouTubeGet 5.9.11+keyG[Mazuki] by Senzati.rar","uid":7831555,"size":4794919,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:921f9dc0abac37ea8dc74f3659e0c539e580f0c3&amp;dn=YouTubeGet+5.9.11%2BkeyG%5BMazuki%5D+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BySenzati","files":-1,"time":1353026658,"description":"\n\nYouTubeGet is an all-in-one software designed to make quick and easy work to download YouTube videos and convert them. Offering a multitude of methods to acquire the video, this application has all the power you need while still remaining small and easy to use. After downloading videos it will auto convert FLV files to MP4, 3GP, AVI, WMV, MOV etc. Soon, you can see YouTube videos on your MP4 or Cell phone.\n\nDownload YouTube HD/HQ Video\nWith YouTubeGet You can download HD(High Definition) and HQ(High Quality) Video format from YouTube\nResume Broken Download\nYouTubeGet will auto resume broken download. No matter your net speed is stable or not, YouTubeGet will download the best quality videos.\nDownload YouTube Videos to Cell Phone\nYouTubeGet will auto convert YouTube Videos to 3GP Cell Phone Format, then you can see all YouTube videos on your Cell Phone!\nDownload YouTube Videos to iPod\nYou can download YouTube videos and save them as iPod MOV or MP4 format, and play them anywhere!\nDownload YouTube Videos to PSP\nAfter playing games on your PSP, would you like to see some cool videos? YouTubeGet will download YouTube videos and save them as PSP format!\nDownload YouTube Videos and Burn to a CD/DVD\nDownload YouTube videos and save as AVI or WMV. It is much easier to burn these funny videos to a CD/DVD by this two formats.\nClipboard Monitor Helps You to Download YouTube Videos Much Easier\nYouTubeGet monitors your Clipboard all the time. when you are copying a YouTube Video URL, immediately the Add New Download window will auto pop up.\nFLV Converter (Free in YouTubeGet V5 Suite)\nYou can convert your local FLV files to AVI, WMV, MOV, 3GP, MP4 etc by YouTubeGet FLV Converter for FREE! You Save $29.95 !\nYouTube Browser \nSearch YouTube Videos and Preview them before downloading. When you want to download them you just one-click on Download Now Button.\n\nOS: Windows 2000/XP/2003/Vista/Win7/Win8","torrent":{"xt":"urn:btih:921f9dc0abac37ea8dc74f3659e0c539e580f0c3","amp;dn":"YouTubeGet+5.9.11%2BkeyG%5BMazuki%5D+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921f9dc0abac37ea8dc74f3659e0c539e580f0c3","infoHashBuffer":{"type":"Buffer","data":[146,31,157,192,171,172,55,234,141,199,79,54,89,224,197,57,229,128,240,195]},"announce":[],"urlList":[]}}