{"title":"Thief 2 v1.19","uid":7932050,"size":48325148,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9251e89bfb9e59485f7c5dc2300331077e560ede&amp;dn=Thief+2+v1.19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fixxxxxer","files":2,"time":1355702708,"description":"The files contained in this torrent will allow you to enjoy the PC game &quot;Thief 2 - The Metal Age&quot; on any modern machine. Included are some very important updates. All you have to do is to download this torrent http://thepiratebay.se/torrent/4487740/Thief_2_The_Metal_Age_%5BEnglish%5D_%5BPC%5D and apply the 1.18 patch included in my torrent. Then open t2_v119.zip, read the info and voila! The game was tested on a Windows 7 64bit PC.\nMany thanks to all the wonderful people responsible for this update!\n\nA small sample of changes and fixes\n-----------------------------------\n\nRenderer:\n - Added windowed mode\n - Added single display mode option - no resolution change between menus and game\n - Added ingame support for all common resolutions, including widescreen\n - Added support for 32-bit color\n - Textures can now be automatically promoted to 32-bit, improving quality and effectively eliminating the palette limit\n - Added UI framerate cap option to avoid GPU fan spinning up in UI\n - Added DDS/PNG image support\n - Added full 24/32-bit TGA/BMP image support\n - Increased the maximum number of frames allowed in animated textures from 20 to 99, and increased the allowable filename length for animated textures (before the underscore) to support more than 7\n - Animated texture rate can now be specified via a material file for that texture\n - Fixed a bug where Transparency property didn't (correctly) apply on objects that contain transparent polys\n\nGeneral:\n - Replaced video player lib with an FFMpeg based one to play cutscenes. LGVid.ax or other codecs are no longer required\n - Option to use OpenAL (if available) instead of DirectSound. Includes support for audio effects in Windows 7 without an EAX-enabled driver (e.g. ALchemy)\n - Added &quot;head_bob&quot; config var to control amount of head bob\n - Added mousewheel support to options menu\n - Fixed player ground contact tracking when walking off an object (caused footstep sounds to get &quot;stuck&quot; on previous material)\n - Fixed sound cap per schema type bug and upped max sound channels to 48\n - Changed screenshot output format to BMP and also added support for PNG screenshots\n - Changed mouselook sensitivity to be resolution independent\n - Added check to avoid trying to open files with reserved system name like com ports\n - AIs now breathe from their head instead of their stomachs. They will no longer drown when up to their waist in water.\n - Lowered player crouch height by a tiny fraction so he's less likely to get stuck on 4 unit tall spaces\n - Added better support for binding actions to the mouse wheel (can bind wheel up and wheel down as separate actions, with modifier key support)\n - Fixed star rendering\n - Added &quot;log_player_pos&quot; command that dumps current player pos to log file (when enabled)\n - Added the ability to detach from ladders by crouching\n - Improved mantling a bit and added optional new mantling algorithm with lower failure rate\n - Fixed a bug which limited number of sound channels to 16 even if more were selected\n - Fixed a bug that sometimes caused doors to float away into infinity\n - Fixed (or at least greatly improved) a bug with edge triggered OBBs sometimes failing to detect collision (in particular for slow moving objects)\n - Fixed framerate dependent speed issue for camvators/moving terrain (with collision type: none)\n - Added &quot;fixed_star_size&quot; option for resolution independent star size\n - Fixed some bugs when attaching to a ladder from water.\n - AIs who are facing very close to a wall will no longer turn to face south when the game begins\n - Health bar drawing adjusted in widescreen\n - Added option to fix arm rendering\n - Added AA to rendering of loadout screen items\n - Fixed pickpocket count bug that would always show 1 more maximum pickpocket than there actually was.\n - Added &quot;Blocks frobs&quot; property, allowing objects to block frobs of objects behind them (e.g. to stop frobbing items through safe doors)\n - Added option to left-align map notes text\n - Made navigation of map/objectives screen a little bit more in-game friendly (screen can also be closed with space, arrow key navigation and return to switch map/obj)","torrent":{"xt":"urn:btih:9251e89bfb9e59485f7c5dc2300331077e560ede","amp;dn":"Thief+2+v1.19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9251e89bfb9e59485f7c5dc2300331077e560ede","infoHashBuffer":{"type":"Buffer","data":[146,81,232,155,251,158,89,72,95,124,93,194,48,3,49,7,126,86,14,222]},"announce":[],"urlList":[]}}