{"title":"Peter Walsh - Cocky (mobi + epub)","uid":7898317,"size":760703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:925fe59d30813427a1fd6f8b9d9e93a5b0550f62&amp;dn=Peter+Walsh+-+Cocky+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kevinkray","files":-1,"time":1354898919,"description":"Curtis Warren is an underworld legend, the Liverpool scally who took the methods of the street-corner drug pusher and elevated them to an art form. He forged direct links with the cocaine cartels of Colombia, the heroin godfathers of Turkey, the cannabis cultivators of Morocco and the Ecstasy manufacturers of Holland and Eastern Europe. His drugs went around the world, from the clubs of Manchester, Glasgow and Dublin to the golden beaches of Sydney.\n\nHis underlings called him the Cocky Watchman. His pursuers called him Target One.\n\nThis best-selling biography uncovers his meteoric rise from Toxteth mugger to `the richest and most successful British criminal who has ever been caught.' It relates how the Liverpool mafia became the UK's foremost drug importers; tells how Warren survived gang warfare and how he corrupted top-level police officers; unveils the inside story of the biggest UK law enforcement operation ever undertaken; and reveals the explosive contents of the covert wiretaps that brought his global empire crashing down.\n\nThoroughly revised and updated, Cocky is a shocking insight into organised crime and an important investigation into the workings of the international drugs trade.","torrent":{"xt":"urn:btih:925fe59d30813427a1fd6f8b9d9e93a5b0550f62","amp;dn":"Peter+Walsh+-+Cocky+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"925fe59d30813427a1fd6f8b9d9e93a5b0550f62","infoHashBuffer":{"type":"Buffer","data":[146,95,229,157,48,129,52,39,161,253,111,139,157,158,147,165,176,85,15,98]},"announce":[],"urlList":[]}}