{"title":"S360X v4.1 (EXE)","uid":7861319,"size":51802,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:932afa30bcbb5433c6ccf80b29d1054008c32013&amp;dn=S360X+v4.1+%28EXE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eletrom","files":2,"time":1353939347,"description":"======================================Magaiver====================================\nSchtrom released a new version of Schtrom360Xtract(info), a tool that will allow you to easily dump Xbox/Xbox360 gamedata, extract/patch the Security Sectors, PFI and DMI and fully prepare the image for burning in 1 step.\n\nWhat's new/fixed:\n* support for iXtreme V1.6\n* stealth check updated to work with wave 3 and wave 4 games, the wave type is now displayed\n* new Correct SS V1 option added in options dialog for XBOX360 discs. This option is deactivated by default, you need to enable it in the options dialog. If activated this option does correct the security sector at disc extraction, image extraction/injection and also during the stealth check. Pay attention that the stealth check will already fail if one challenge/response byte starting at offset 0x200 has a different value than the calculated ss V1. Keep in mind that this will only correct the security sector based on version 1. At the moment no ss version 2 games are out. But if MS is changing to ss V2 it is recommended to deactivate this option until an update of S360X is released. On iXtreme V1.6 firmware and XBOX360 backup disc extraction the Correct SS V1 option is always used no matter what is selected in the options dialog. This is because I haven't found a way until today to read the ss with C/R data from a XBOX360 backup disc on the new iXtreme V1.6 firmware.\n* defaut XBOX360 drive speeds changed for better error correction TS-H943A, VAD6038 and DG-16D2S set to 12x. During tests with the new iXtreme V1.6 it seems that scratched discs have less read errors with increased speeds on XBOX360 drives.\n* Send Custom CDB dialog buffer size field changed to support also hexadecimal values. The cdb cmd presets are now changed to hexadecimal values. Three new presets for LiteOn DG-16D2S iXtreme V1.6 fw added.\n* inquiry detection of retail XBOX360 drives added. This gives you the opportunity to test cdb cmds on retail drives if your atapi.sys is patched. The patching of atapi.sys has to be done by yourself.\n* fixed bug in directory listing for XDVDFS dialog on newer games like Damnation and Batman: Arkham Asylum, games can now be viewed and extracted correctly\n* stealth.ini updated\n\nOfficial Site: n/a, by Schtrom\nDownload: here\nFull Readme: xbins.org\nimagem: &lt;a href=&quot;\nhttp://bayimg.com/cAGEOAaEH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAGEOAaEH&lt;/a&gt;","torrent":{"xt":"urn:btih:932afa30bcbb5433c6ccf80b29d1054008c32013","amp;dn":"S360X+v4.1+%28EXE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"932afa30bcbb5433c6ccf80b29d1054008c32013","infoHashBuffer":{"type":"Buffer","data":[147,42,250,48,188,187,84,51,198,204,248,11,41,209,5,64,8,195,32,19]},"announce":[],"urlList":[]}}