{"title":"Extreme Movie Manager 8.0.2.6","uid":7856792,"size":74162956,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9519bb174e050e71f4fbe24e47dc1a21b580eee1&amp;dn=Extreme+Movie+Manager+8.0.2.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mabay","files":-1,"time":1353788705,"description":"eXtreme Movie Manager is probably the most advanced Movies/TV Series/Actors collection manager around. It can catalog movies stored in your Hard Disk and removable devices in seconds with all information about codecs, resolutions etc. automatically. XMM import movie information and covers directly from online databases, take a look at supported websites.\n\nKey features:\n\n- Organize your Movie/DVD collection automatically, lookup your Hard Disks, CD/DVD, portable devices in search for files, import movies list directly from CSV, TXT files\n\n- Organize your TV Shows collection automatically, lookup your Hard Disk, CD/DVD in search for Episodes files, download all data from internet, including all episode plot, images, cats with just a click!\n\n- Manage your BoxSets collection automatically, with an easy interface to assign movies to boxSets with just a click.\n\n- Read Codec data directly from movie files, like bitrate, audio, channels, codec used, screen resolution...\n\n- Extract frames directly from your movie files, to have a preview of the video quality, take a look at film scene\n\n- Download all data, images, trailers automatically from internet from many sources in many languages, including casts, crew, DVD details\n\n- Browse your Movies and TV Shows collection on screen with a powerful interface, with rich search options\n\n- Export all your collection in several format, including CSV, TXT, HTML and the exclusive (x)HTML-DATABASE technology\n\n- Learn how to use eXtreme Movie Manager with a short and concise Video Tutorials, read our Quick Tour of XMM features and get support from our Forum\n\nSoft-Go is not responsible for the content of eXtreme Movie Manager publisher's description. We encourage you to determine whether this product or your intended use is legal. We do not encourage or condone the use of any software in violation of applicable laws.\n\nAny form of support or technical problems regarding eXtreme Movie Manager must be addressed to its developer/publisher. Please be aware that we do NOT provide eXtreme Movie Manager cracks, serial numbers, registration codes or any forms of pirated software downloads. ","torrent":{"xt":"urn:btih:9519bb174e050e71f4fbe24e47dc1a21b580eee1","amp;dn":"Extreme+Movie+Manager+8.0.2.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9519bb174e050e71f4fbe24e47dc1a21b580eee1","infoHashBuffer":{"type":"Buffer","data":[149,25,187,23,78,5,14,113,244,251,226,78,71,220,26,33,181,128,238,225]},"announce":[],"urlList":[]}}