{"title":"BBC Breakfast, Lunch And Dinner 2 of 3 Lunch 2012","uid":7945767,"size":734912240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95296e9383f6949a713510565875c86074771179&amp;dn=BBC+Breakfast%2C+Lunch+And+Dinner+2+of+3+Lunch+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1356123091,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/bo1nvwr2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/bo1nvwr2&lt;/a&gt;\n\nIn the second part of her latest culinary adventure, Clarissa Dickson Wright \ninvestigates the history of lunch, a meal that we now eat in a speedy average \nof 12.49 minutes. But 300 years ago lunch didn't exist at all - for centuries \nour daytime meal was called, as it still is in some parts of the country, \ndinner, a long-standing confusion that Clarissa attempts to unravel.\n\nLunch is the workhorse meal of the day and the story of its origins and \nevolution is really a history of our working lives across the centuries. \nMedieval farm labourers used to sit down to eat as early as 10am, but they had \nbeen toiling in the fields since daybreak. As she tucks into some of the dishes \nof the day, Clarissa explodes some common myths about our ancestors and their \neating habits. Not all their fish was salted and people didn't eat rotten meat \nflavoured with spices, but they certainly did eat vegetables - and, back then, \ncarrots were purple.\n\nMoving forward through history, Clarissa tries a 17th-century recipe for \nvenison that was a favourite of the diarist Samuel Pepys and discovers that the \nlong business lunch of the 1980s already existed in the 1660s. By Victorian \ntimes, office workers were sitting down to steaming hot plates of mutton chops \nand oxtail stew in a chophouse, and Clarissa calls in to one of the last \nsurviving examples in the City of London. \n\nHowever, it is the Earl of Sandwich's famous convenience food invention from \nthe 1750s that has come to dominate our modern lunchtime menu. All the same, \nthe ubiquitous sandwich can still be an opportunity for creativity and \ninventiveness, and as she comes towards the end of her journey through history, \nClarissa meets Britain's most celebrated sandwich designer and samples his most \nstunning original creation, which has been officially declared to be the \nworld's greatest sandwich.","torrent":{"xt":"urn:btih:95296e9383f6949a713510565875c86074771179","amp;dn":"BBC+Breakfast%2C+Lunch+And+Dinner+2+of+3+Lunch+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95296e9383f6949a713510565875c86074771179","infoHashBuffer":{"type":"Buffer","data":[149,41,110,147,131,246,148,154,113,53,16,86,88,117,200,96,116,119,17,121]},"announce":[],"urlList":[]}}