{"title":"Gold Silver Price Calculator v1.1.7","uid":8513518,"size":267223,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:99da092fb76e2dd8361f5b4cbb6a2f3daa114efc&amp;dn=Gold+Silver+Price+Calculator+v1.1.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":1,"time":1369644727,"description":"\nThis is the paid and ads-free version.\n\nFrom the developer of the popular and highly rated Gold Silver Live Prices.\n\nThis app lets you know instantly how much your gold and silver are worth in market value. No matter you are a jewelry store, precious metal store, precious metal investor, or individuals who want to sell your jewelry, you will find this app handy.\n\nJust enter the weight in one of the 10 supported units and see market value instantly in 176 currencies. As soon as you change any settings, the value is updated automatically. The app is quick, powerful, and simple to use.\n\nIt also comes with Kitco charts just so you have the option to show your customer how well gold and silver have been performing. Exchange rates are downloaded at every refresh together with the gold &amp; silver prices. And don't forget you have the option to hide the percentage of spot before showing the prices to your customer.\n\nUnlike other similar apps, this one has all the flexibility you possibly need.\n\n- FAST &amp; ACCURATE up to the second live gold and silver prices.\n\n- 10 common weight units: troy oz, gram, kg, troy pound, pennyweight (dwt), Indian toal, Chinese mace troy, Chinese tael troy, and Thai baht for both 96.5% and 100% pure gold.\n\n- 176 currencies.\n\n- Any gold karat from 1K to 24K.\n\n- Silver fineness in 100% pure, 999.9 Ultra-fine silver, 999 Fine silver, 980, 958 Britannia silver, 950 French 1st Standard, 925 Sterling silver, 900 Coin silver/one nine fine, 835, 833 Continental silver, 830 Scandinavian silver, 800, 800, and 750.\n\n- Gold and silver Kitco charts.\n\n- Option to hide percentage of spot price so your customer will not see it.\n\n- Easy switch between gold and silver calculators.\n\n- Independent gold and silver calculators with their own currency, units, and everything.\n\n- All data is saved between sessions.\n\nWhat's in this version:\n- Asset calculator allows saving and loading metal weights using up to 5 decimal places.\n- Added asset calculator that tells you how much your precious metal are worth in total.\n- Added 350 US War Nickels and 400 US Half Dollars to silver fineness options.\n- Added a lot of different silver fineness as option.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.terrylau.goldsilvercalculator&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.terrylau.goldsilvercalculator&lt;/a&gt;\n","torrent":{"xt":"urn:btih:99da092fb76e2dd8361f5b4cbb6a2f3daa114efc","amp;dn":"Gold+Silver+Price+Calculator+v1.1.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99da092fb76e2dd8361f5b4cbb6a2f3daa114efc","infoHashBuffer":{"type":"Buffer","data":[153,218,9,47,183,110,45,216,54,31,91,76,187,106,47,61,170,17,78,252]},"announce":[],"urlList":[]}}