{"title":"Handlaunch Building Clinic","uid":8688133,"size":2475765768,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:99fb1e161eb28579d0eb2dfd2b32d0ac2f477a68&amp;dn=Handlaunch+Building+Clinic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lionate","files":-1,"time":1373840349,"description":"Your handlaunch/F3K glider needs to be built straight, light, and strong or it is just not going to perform as the designer intended it to. The Handlaunch Building Clinic training DVD is a four hour comprehensive guide to assembling and preparing most modern HLG kits like a pro. The building skills taught can be applied to most r/c glider kits and not just HLG's.\n\nI've built, prepared and flown over 50 HLG's of all types and I share with you my pro techniques and tips for building the perfect handlaunch glider. Every building step is covered in clear detail on camera with additional diagrams added to illustrate the technical details.\n\nIn my 4 hour Handlaunch Building Clinic, you will watch me build not one, but two composite HLG kits, start to finish, every step, from glassing the wing halves, to making a light weight wiring harness. I show you 2 builds because both planes have unique construction needs, and they cover the most widely used assembly techniques.\n\nNow this is NOT a scratch building DVD, I don't do any foam wing cutting or vacuum bagging. What you will see is what most people build, a composite kit with the basic parts prefinished, the wings, tails and fuselage are already done, though not assembled. If you are building any XP4 and 5 series, Taboo, Predator, Blaster, Legend, Arrow 2, Topsky, Gambler, DL 50, Vandel, or any other kit, than this if the video for you\n\nWhile these planes are not hard to assemble, they do require a number of skills and techniques that are best learned by watching me do them live. You'll learn how to build light and strong, with systems that will be reliable flight after flight.\n\nYou'll learn how to join wings with fiberglass, how to build light carbon pushrods, how to align wings and fins and how to install your radio system properly. Skills taught also include wiring, soldering, battery pack assembly, epoxy use, and servo installation. I emphasis the need to build light and straight because extra weight or misaligned surfaces kill gliding performance quickly. Once the basic assembly is finished, I walk you through my detailed tuning and set up procedure to insure the plane will fly as expected and be mechanically reliable. \n\nYou'll learn how to pre-tune the glider for its first flight so you won't have any surprises on launch. You can apply the building techniques you learn to just about any HLG kit on the market, and for that matter, ANY glider kit.\n\nNOTE: If you are building one of the high-end moulded wing kits, I do recommend the Handlaunch Tech Lab which covers the latest building and gear for those planes.","torrent":{"xt":"urn:btih:99fb1e161eb28579d0eb2dfd2b32d0ac2f477a68","amp;dn":"Handlaunch+Building+Clinic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99fb1e161eb28579d0eb2dfd2b32d0ac2f477a68","infoHashBuffer":{"type":"Buffer","data":[153,251,30,22,30,178,133,121,208,235,45,253,43,50,208,172,47,71,122,104]},"announce":[],"urlList":[]}}