{"title":"Marquee Moon (Complete) (No ads)","uid":7920944,"size":7194183,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9aba99bf07e97a81e244c26c8cce4b589049523a&amp;dn=Marquee+Moon+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SplhcbPrime","files":-1,"time":1355476775,"description":"British writer Peter Hogan (best known to comic-book readers for his work on 2000 A.D. and The Dreaming) wrote a follow-up to his popular miniseries, The Sandman Presents: Love Street, in 1997. Unfortunately, The Sandman Presents: Marquee Moon, as the one-shot would have been called, has never been published, even a decade after it was first solicited.\n\nLove Street offered insight into John Constantine's youth in the 1960s, setting the stage for the cynical magician he would one day become. Marquee Moon would have revisited Constantine's early years, showcasing his brief fame as a punk rocker in the band Mucous Membrane. The future mage's prominence in this story, however, would have been reduced, compared to his starring role in Love Street.\n\nMarquee Moon chronicled Constantine's 1977 encounter with an American woman with a secret. Had this 56-page, one-shot seen publication, it would have featured The Clash's comic-book debut.\n\nWith Hogan's kind permission, Roots of the Swamp Thing presents the text to this unpublished chapter in Sandman and Hellblazer history, along with an introductory essay Hogan included upon delivering the script to Vertigo. This essay provided artists Peter Doherty and Matt D'israeli Brooker, as well as editor Alisa Kwitney and Sandman creator Neil Gaiman, a detailed look at the 1970s London punk-rock scene, and is a fascinating read in its own right.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:9aba99bf07e97a81e244c26c8cce4b589049523a","amp;dn":"Marquee+Moon+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9aba99bf07e97a81e244c26c8cce4b589049523a","infoHashBuffer":{"type":"Buffer","data":[154,186,153,191,7,233,122,129,226,68,194,108,140,206,75,88,144,73,82,58]},"announce":[],"urlList":[]}}