{"title":"Accurate Times 5.3.4","uid":7857600,"size":3945984,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9b96aeb05523017ccc2c9299d45a9315da7bf636&amp;dn=Accurate+Times+5.3.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1353814183,"description":"Quick Specs\n\nVersion   : 5.3.4\nFile size : 3.66MB\nDate added: April 28, 2012\nPrice     : Free\nOS        : Windows NT/98/Me/2000/XP/2003/Vista/Server 2008/7\n\n\nRead more: Accurate Times - CNEThttp://download.cnet.com/Accurate-Times/3000-2135_4-10297398.html#ixzz2DCAywvAH\n\nFor Muslims, time, place, and direction are critical to worship. Accurate Times by the Jordanian Astronomical Society is the perfect tool for the task. This compact freeware calculates prayer time, sun time, direction, date, and other data with an accuracy of two seconds or less. It offers Arabic and English language options, accurate graphical displays, and some important extras.\n\nAccurate Times has a simple, compact interface that is nicely configured, displaying our location and other data as well as the day's prayer times. The layout slightly resembles a telescope control panel, which (not surprisingly) it is, in a way, since a button labeled Telescope includes a tool to control an astronomical telescope using data from Accurate Times. That impressed us right away since accurate local observations are essential in Islam. We started by pressing the Location button, which let us choose our city from a staggeringly extensive list as well as specify our latitude and longitude and time zone manually. We could also set our elevation above sea level, fine tune our distance from a default city location in kilometers for accurate Fajer and Shuroq times, and even specify the atmospheric refraction in temperature and pressure for good &quot;seeing.&quot; We could also specify the date, including calculations for future dates; calculate Prayer Times, Moon Times, Moon Phases, Crescent Visibility, and Sun and Moon Ephemeris (positions); convert dates; set Prayer Alerts; and more. The program's Preferences included highly accurate settings for twilight, summertime (Daylight Saving) settings, high-latitude alternative prayer times, and other options.\n\nAccurate Times is extremely quick and easy to use, once you've set it up properly. For instance, clicking Qiblah Direction called up a simple, no-nonsense pop-up indicating the exact direction of Mecca from our location as degrees from true north. We could also open a Qiblah Map and find the times for the sun and the sun's shadow. Prayer Alerts can be audible. Accurate Times is based on data from the Islamic Crescents' Observation Project. The ability to control a telescope truly distinguishes this superior tool.\n\n","torrent":{"xt":"urn:btih:9b96aeb05523017ccc2c9299d45a9315da7bf636","amp;dn":"Accurate+Times+5.3.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b96aeb05523017ccc2c9299d45a9315da7bf636","infoHashBuffer":{"type":"Buffer","data":[155,150,174,176,85,35,1,124,204,44,146,153,212,90,147,21,218,123,246,54]},"announce":[],"urlList":[]}}