{"title":"Titty Creampies 5 (2013)","uid":8645573,"size":1678835169,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9b9e861bcc5bfc7e0ab2af74c2cc07dde92d0e0e&amp;dn=Titty+Creampies+5+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"gatasalvaje","files":-1,"time":1372978490,"description":"Titty Creampies 5 (2013)\n &lt;a href=&quot;\nhttp://www.evilangel.com/en/Titty-Creampies-05/dvd/18822&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.evilangel.com/en/Titty-Creampies-05/dvd/18822&lt;/a&gt;\n\nYear: 2013\nCountry: USA\nDirected by: Kevin Moore\nStudio: Evil Angel Video / Buttman Magazine Choice\nGenre: Big Tits, Cream Pie, Tit Fucking, Hardcore\nStarring: Austin Pierce, Bridgette B., Brooklyn Chase, Gia DiMarco, Kagney Lynn Karter, Karen Fisher, Kevin Moore, Lolly Ink, Nikita Von James\nDuration: 2:37:34\n\nDescription: \nFor incorrigible boob men, the ultimate goal in life is to come upon buxom beauties - that is, to enjoy hot, sensuous titty fucking climaxed by shooting creamy cum into the hot mama's fulsome, curvy cleavage. Deviant director Kevin Moore's &quot;Titty Creampies # 5&quot; makes that erotic dream come true in seven sizzling scenes of non-stop titty tease and breast-obsessive POV action. Eight of the hottest girls in porn show off their bountiful bazooms, then wrap those juicy tits around the director's shaft - they suck, jack and massage his stiff dick with their massive jugs until he spurts his appreciation onto their chest. No guys jerking off here; it's all just huge tits smothering Kevin's hard boner and making it explode in ecstasy. Bosomy blondes Bridgette B. and Kagney Linn Karter join forces to tit-wank the director's meat, squeezing his shaft between their fat jugs. Exotic blonde slut Nikita Von James brings her giant whoppers and talented mouth to get Kevin off. He slides his dick between Italian bimbo Gia DiMarco's firm butt cheeks and greased-up rack. Tattooed, stacked whore Lolly Ink gets a thick wad of jizz between her knockers. Bikini slut Brooklyn Chase oils and massages her huge hooters; tasty MILF Karen Fisher gets righteously titty-fucked; outrageously endowed Ashton Pierce provides a drooling blow job and an intimate tour of her impossibly large breasts. If you love dumping hot cream between a lady's bouncy boobs, &quot;Titty Creampies # 5&quot; is a load of nasty fun.\n\nQuality: DVDRip\nFormat: MP4\nVideo: MPEG4 Video (H264) 704x394 29.97fps 1227kbps [Video]\nAudio: AAC 48000Hz stereo 188kbps [Audio]\nSize: 1.56 GB","torrent":{"xt":"urn:btih:9b9e861bcc5bfc7e0ab2af74c2cc07dde92d0e0e","amp;dn":"Titty+Creampies+5+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b9e861bcc5bfc7e0ab2af74c2cc07dde92d0e0e","infoHashBuffer":{"type":"Buffer","data":[155,158,134,27,204,91,252,126,10,178,175,116,194,204,7,221,233,45,14,14]},"announce":[],"urlList":[]}}