{"title":"Splice: Tree of life [MAC]","uid":7852387,"size":394749698,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:9c3bccbeffd34c83be18af0244457a48b943dc94&amp;dn=Splice%3A+Tree+of+life+%5BMAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GLaDOS_3","files":-1,"time":1353640508,"description":"\nIt's alive\n\nThe game is all about manipulating strings of molecules, and then growing and extending the connected blobs in order to make them fit into a shape identified at the start of the level.\n\nYou drag these chunks of genetic code around with a finger, and while you're moving one the places where you can reposition it are highlighted. You have a set number of moves, or splices, in which to create the correct combination.\n\nTo start with, the molecules are inert, but as you push on different molecules become imbued with different powers, which are unleashed when you tap on the central molecule that holds the chain together.\n\nSome split into more molecules, creating forks in your chain that didn't exist before. Others extend your chain, growing extra blobs depending on where they're placed.\n\nSplice to see you\n\nAs a package, Splice: Tree of Life is nigh-on perfect. From the piano soundtrack to the menus, every part combines to create a unique, wonderful aesthetic.\n\nThe puzzles never get frustrating, and the joy of watching a newly created chain spring to life when it expands into the correct position is incredibly gratifying.\n\nWhile there's progression and escalation, Splice: Tree of Life never feels like a game. This is a title with a clear focus on creation, and one that gently coaxes you into slipping the building blocks of life into the right place.\n\nIt's the sort of thing that the iPad was made for. Intuitive, intelligent, and utterly impossible on any other sort of device, it eschews the traditional shape of the video game and instead builds something unique.\n\nSplice: Tree of Life is a game about experimentation and exploration that deserves to be shared and enjoyed by as many people as possible.\n\n--\n\nPlease seed!\n\n","torrent":{"xt":"urn:btih:9c3bccbeffd34c83be18af0244457a48b943dc94","amp;dn":"Splice%3A+Tree+of+life+%5BMAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c3bccbeffd34c83be18af0244457a48b943dc94","infoHashBuffer":{"type":"Buffer","data":[156,59,204,190,255,211,76,131,190,24,175,2,68,69,122,72,185,67,220,148]},"announce":[],"urlList":[]}}