{"title":"Eschalon: Book I [DRM Free][Linux]","uid":7875352,"size":108191604,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:9e26d95dea2c9de57fb1baf2a70317f2dbb50152&amp;dn=Eschalon%3A+Book+I+%5BDRM+Free%5D%5BLinux%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SSJASON","files":-1,"time":1354322809,"description":"Screens: &lt;a href=&quot;\nhttp://i.imgur.com/uhRsA.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/uhRsA.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/vgSS6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/vgSS6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/NrV6S.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/NrV6S.jpg&lt;/a&gt;\n\nEschalon: Book I is an old-school role-playing game that will take you across massive outdoor environments and deep into dozens of sprawling dungeons as you seek to uncover the mystery of who you are. It features a tile-built, turn-based game world where the result of absolutely every action is rolled, calculated or statistically determined. Hundreds of items and dozens of creatures await your discovery in this classically inspired RPG.\n\nA tile-built, turn-based game world where the result of absolutely every action is rolled, calculated or statistically determined. Strategy is paramount to success; careful skill management, equipment selection and magic usage will win your fights, not rapid button clicking. We are very pleased to say this is not another &quot;action RPG&quot;.\nHundreds of items and dozens of creatures await your discovery. A combination of randomly generated treasure and carefully hidden goodies means that no two games will play the exact same way.\nUnlimited character development style: Choose from 24 unique skills to make the character you want and 8 base attributes that affect your character's every action throughout the game. The game world does not scale or adjust itself to match anyone's play style, so the ease or difficulty of the game is directly related to how successful you are at developing your character.\nCombat plays out at your pace. Eschalon: Book I features a turn-based system that allows you to roll through combat as fast or slow you want...make it fast and furious, or analyze every option for maximum advantage.\nA non-linear storyline means that the game world is open to explore as you desire. Follow the storyline or don't...it's up to you. Just be careful where you go and who you choose to trust- the world of Eschalon can be a deadly place for an inexperienced adventurer.\nAn epic adventure that you must face alone...a single-player RPG carefully designed to feel like the great old school RPGs of the past such as UltimaÂ®, Might &amp; MagicÂ®, and WizardryÂ®","torrent":{"xt":"urn:btih:9e26d95dea2c9de57fb1baf2a70317f2dbb50152","amp;dn":"Eschalon%3A+Book+I+%5BDRM+Free%5D%5BLinux%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e26d95dea2c9de57fb1baf2a70317f2dbb50152","infoHashBuffer":{"type":"Buffer","data":[158,38,217,93,234,44,157,229,127,177,186,242,167,3,23,242,219,181,1,82]},"announce":[],"urlList":[]}}