{"title":"Red Sniper on the Eastern Front: The Memoirs of Joseph Pilyushin","uid":8650185,"size":4352970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f543ec05aebe3096be6d7c9d05d7ff19789b702&amp;dn=Red+Sniper+on+the+Eastern+Front%3A+The+Memoirs+of+Joseph+Pilyushin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"Djofullinn","files":1,"time":1373076264,"description":"Joseph Pilyushin, a top Red Army sniper in the ruthless fight against the Germans on the Eastern Front, was an exceptional soldier and he has a remarkable story to tell. His firsthand account of his wartime service gives a graphic insight into his lethal skill with a rifle and into the desperate fight put up by Soviet forces to defend Leningrad. He also records how, during the three-year siege, close members of this family died, including his wife and two sons, as well as many of his comrades in arms. He describes these often-terrible events with such honesty and clarity that his memoir is remarkable.\n\nPiluyshin, who lived in Leningrad with his family, was already 35 years old when the war broke out and he was drafted. He started in the Red Army as a scout, but once he had demonstrated his marksmanship and steady nerve, he became a sniper. He served throughout the Leningrad siege, from the late 1941 when the Wehrmacht's advance was halted just short of the city to its liberation during the Soviet offensive of 1944.\n\nHis descriptions of grueling front-line life, of his fellow soldiers and of his sniping missions are balanced by his vivid recollections of the protracted suffering of Leningrad's imprisoned population and of the grief that was visited upon him and his family.\n\nHis gripping narrative will be fascinating reading for any one who is keen to learn about the role and technique of the sniper during the Second World War. It is also a memorable eyewitness account of one man's experience on the Eastern Front.\n &lt;a href=&quot;\nhttp://www.amazon.com/Red-Sniper-Eastern-Front-Pilyushin/dp/1848841205/ref=sr_1_1?ie=UTF8&amp;qid=1373068938&amp;sr=8-1&amp;keywords=red+sniper+on+the+eastern+front&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Red-Sniper-Eastern-Front-Pilyushin/dp/1848841205/ref=sr_1_1?ie=UTF8&amp;qid=1373068938&amp;sr=8-1&amp;keywords=red+sniper+on+the+eastern+front&lt;/a&gt;","torrent":{"xt":"urn:btih:9f543ec05aebe3096be6d7c9d05d7ff19789b702","amp;dn":"Red+Sniper+on+the+Eastern+Front%3A+The+Memoirs+of+Joseph+Pilyushin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f543ec05aebe3096be6d7c9d05d7ff19789b702","infoHashBuffer":{"type":"Buffer","data":[159,84,62,192,90,235,227,9,107,230,215,201,208,93,127,241,151,137,183,2]},"announce":[],"urlList":[]}}