{"title":"Kink Features/------KF-13848 Madison Young, Aurora Snow, Lilla K","uid":7884094,"size":2790330323,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9fdb543d7182661c121a8d552a46c1ae2ce25514&amp;dn=Kink+Features%2F------KF-13848+Madison+Young%2C+Aurora+Snow%2C+Lilla+K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1354569365,"description":"\nIndietro: The Director's Cut\n\n\nMay 23, 2011 - Madison Young, Aurora Snow, Lilla Katt and Ned Mayhem \n\n\n\nMp4 and Wmv no pics\n\n\n\nA film by Vivian Darkbloom \nStaring: William Van Noland, Aurora Snow, Madison Young, Lilla Katt and Ned Henry.\n \nKink Studios is proud to present INDIETRO, our first fully self-produced, in-house featurette. This is not your everyday porn film. Indietro blurs the lines between pornography, art house, mainstream, and indie, by putting insightful narrative back into the adult film. This is intelligent, artistic, sex positive, story driven filmmaking at its most polished and lush, examining the BDSM lifestyle in a whole new way, with great acting, hot authentic scenes, and thought provoking material. Winner of The Audience Choice Award for Best Narrative Feature at Cinekink, New York, Indietro is now available for download. We hope you enjoy it!\n \n&quot;Who's Afraid of Virginia Woolf&quot;, Anais Nin, and &quot;The Story of O&quot; were among the inspirations for Vivian Darkbloom's Indietro, a story about relationships, misconceptions, and desire. On a chilly summer evening in San Francisco, Honey and Nick, Mr. and Mrs. Suburbia, pay a visit to the mysterious and sprawling home of George and Martha, the king and queen of kink, and their &quot;maid,&quot; Camille. As the night slowly unravels from the wee small hours of morning back to its beginning, we discover the truth about each of the characters, their motivations, and their darkest longings. Indietro takes a back flip into the world of BDSM and sex, pushes conventional boundaries, and takes an intimate look at what lengths some people will go to in the pursuit of love, connection, and carnal fulfillment.\n \nIndietro is the first produced and distributed film venture by Kink Studios. This film represents a new direction for Kink.com LLC into the world of mainstream film and video production. Kink Studios aims to put the narrative back into adult films with intelligent, artistic, sexy, story-driven filmmaking examining the BDSM lifestyle in a whole new way with great acting, hot authentic scenes, and thought provoking material written and devised by working Hollywood screenwriters and directors.\n \n\n\nScreens   &lt;a href=&quot;\nhttp://www.kinkondemand.com/kod/shoot/13848-Indietro-The-Directors-Cut.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kinkondemand.com/kod/shoot/13848-Indietro-The-Directors-Cut.html&lt;/a&gt;\n \n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n  \n\nCheers  :-)  ","torrent":{"xt":"urn:btih:9fdb543d7182661c121a8d552a46c1ae2ce25514","amp;dn":"Kink+Features%2F------KF-13848+Madison+Young%2C+Aurora+Snow%2C+Lilla+K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fdb543d7182661c121a8d552a46c1ae2ce25514","infoHashBuffer":{"type":"Buffer","data":[159,219,84,61,113,130,102,28,18,26,141,85,42,70,193,174,44,226,85,20]},"announce":[],"urlList":[]}}