{"title":"POtHS - Conspiracy - 033 - Counter Intelligence -  Shining Light","uid":8688297,"size":8350677953,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a0c746c14ff9d18c470873b94bc2631b65099b60&amp;dn=POtHS+-+Conspiracy+-+033+-+Counter+Intelligence+-++Shining+Light&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1373843722,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Conspiracy - 033 - Counter Intelligence - Shining Light on Black Operations\n\n\n\nPOtHS Comment: They are doing this right before your very eyes...open your eyes, get free.  It is always The Banksters that Paid them to do it.\n\nDescription:   BLACK OPS - RUN THE WORLD WITH FEAR AND DEATH.\n\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\n&quot;Black op&quot; and &quot;Black ops&quot; redirect here. For other meanings, see Black Ops (disambiguation).\n\nA black operation or black op is a covert operation by a government, a government agency, or a military organization. This can include activities by private companies or groups. A black operation typically involves activities that are highly clandestine and often outside of standard military/intelligence protocol, sometimes against the law. Key features of a black operation are that it is clandestine, it has negative overtones, and it is not attributable to the organization carrying it out.[1] The main difference between a black operation and one that is merely clandestine is that a black operation involves a significant degree of deception, to conceal who is behind it or to make it appear that some other entity is responsible (&quot;false flag&quot; operations).[2][3]\n\nA single such activity may be called a &quot;black bag operation&quot;;[1] that term is primarily used for covert or clandestine surreptitious entries into structures to obtain information for human intelligence operations.[4] Such operations are known to have been carried out by the FBI,[5] the Central Intelligence Agency,[6] Mossad, MI6 and the intelligence services of other nations.[4]\n\n\n   In 2007 the Central Intelligence Agency declassified secret records detailing illegal domestic surveillance, assassination plots, kidnapping, and infiltration and penetration of other &quot;black&quot; operations undertaken by the CIA from the 1950s to the early 1970s. CIA Director General Michael Hayden explained why he released the documents, saying that they provided a &quot;glimpse of a very different time and a very different agency&quot;.[9]\n\n   In May 2007 ABC News, and later the Daily Telegraph, reported that United States president George W. Bush had authorized the CIA to undertake &quot;black operations&quot; in Iran in order to promote regime change as well as to sabotage Iran's nuclear program.[10][11] ABC News was subsequently criticized for reporting the secret operation, with 2007 presidential candidate Mitt Romney saying he was &quot;shocked to see the ABC News report regarding covert action in Iran,&quot; but ABC said the CIA and the Bush Administration knew of their plans to publish the information and raised no objections.[12]\n\n\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, to Bless all that Seed Long.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n[b]JESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n                                             \n\n       :thankyou:    :thankyou:   Thank You JESUS\n\n[center]\n","torrent":{"xt":"urn:btih:a0c746c14ff9d18c470873b94bc2631b65099b60","amp;dn":"POtHS+-+Conspiracy+-+033+-+Counter+Intelligence+-++Shining+Light","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0c746c14ff9d18c470873b94bc2631b65099b60","infoHashBuffer":{"type":"Buffer","data":[160,199,70,193,79,249,209,140,71,8,115,185,75,194,99,27,101,9,155,96]},"announce":[],"urlList":[]}}