{"title":"PDF XChange Viewer Pro 2.5.207 with keys by Senzati.rar","uid":7820740,"size":19616025,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a2730fecf5b856f140ff81ff24ca65968d1744c9&amp;dn=PDF+XChange+Viewer+Pro+2.5.207+with+keys+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BySenzati","files":-1,"time":1352814637,"description":"A powerful PDF viewer is a must have nowadays, and we're pretty sure most of you are already using the popular software solution designed by Adobe which is still considered the number one tool in this particular category. PDF-XChange Viewer claims it deserves a chance too and promises to offer users at least the same goodies as the famous Adobe solution. And as far as we're concerned, PDF-XChange Viewer is quite an advanced application, relying on a very clean and pleasant interface that provides instant access to all the features. And speaking of interface, PDF-XChange Viewer comes with the now-popular tabbed look, which means you can safely open multiple PDF files in the same window, just like in the same way Firefox does with websites.\n\nPDF-XChange Viewer remains light on computer resources and works very smooth even when opening both small and large PDF files, providing exactly the utilities you'd expect from a powerful PDF viewer, including zoom tools, comment and markup tools, measuring goodies and link functions.\nIn addition, PDF-XChange Viewer boasts an advanced export to image feature which lets you save any PDF file as a photo. Supported formats include BMP, PNG, JPEG, TGA, GIF and TIFF.\n\n- New - OCR options included - OCR your image based/scanned PDF's to make fully text searchable PDF files !!! \n\nAdvanced PRO features:\n- Delete Pages\n- Move Pages - By Drag&amp;drop in Thumbnails View.\n- Insert/Import Pages (from existing PDF files)\n- Extract pages to a new file (PDF or Image format - 15 formats supported)\n- Crop Pages/Files\n- Flatten Annotations/Comments\n- Insert Blank page\n- Summarize Comments\n- Export Comments\n- Scan Direct to PDF\n- Create PDF documents from text and RTF files\n- Convert 15 supported image formats to PDF\n- Add Digital Signatures (incl. Time Stamps)\n\n...ETC\n  \n..............\n","torrent":{"xt":"urn:btih:a2730fecf5b856f140ff81ff24ca65968d1744c9","amp;dn":"PDF+XChange+Viewer+Pro+2.5.207+with+keys+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2730fecf5b856f140ff81ff24ca65968d1744c9","infoHashBuffer":{"type":"Buffer","data":[162,115,15,236,245,184,86,241,64,255,129,255,36,202,101,150,141,23,68,201]},"announce":[],"urlList":[]}}