{"title":"Miasmata-SKIDROW [EtGamez]","uid":7878952,"size":2596986305,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a376075eace676dc478c54862caf171e5091c8a2&amp;dn=Miasmata-SKIDROW+%5BEtGamez%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"EtGamez","files":3,"time":1354435967,"description":"Miasmata-SKIDROW [EtGamez]\n\n\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nMiasmata (c) onFX Studios\n\n30-11-2012......Release Date - Protection...............Nothing\nFPS................Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nMiasmata is a first-person survival/adventure game, developed from the\nground-up by brothers Joe and Bob Johnson. You play as Robert Hughes, a\nplague-stricken scientist on a journey to discover a cure. Your\nadventure begins on the shores of a remote and mysterious island. Long\nago, the island was inhabited by a group of indigenous people, whose\nextant monuments still decorate the island landscape. The island is now\nhome to a scientific research outpost and it is your hope to reunite\nwith your colleagues working there. Unfortunately, you'll soon discove\nthat something has gone terribly wrong.\n\nDuring your adventure, you will encounter a mysterious and deadly\ncreature. This creature can stalk you for miles, lurking behind grasses\nand vegetative cover. By treading carefully and with stealth, you may\nbe able to elude the creature. If you are careless, however, you will\nbe forced to confront the creature head-on.\n\nFeatures:\n\nExperience: An engine built from the ground up, featuring voxel-based\nvolumetric clouds, advanced water reflection and refraction, volumetric\nlight-shafts and atmospheric scattering simulations.\n\nExplore: A lush and incredibly detailed natural word. The island\nlandscape is covered by forests with lush canopies. The terrain\nsurfaces are blanketed by tufts of moss and grass. The forest floors\nhave thick undergrowth and are littered with fallen leaves, rotting\nlogs, stumps and sticks.\n\nDiscover: Dozens of camps, outposts and ruins. Find maps, notes and\nclues that lead you on your adventure.\n\nSurvive: A deadly world. Discover plants and fungi and synthesize them\ninto life-saving medicines. Find water and shelter to stave off fever,\ndehydration and exhaustion. Use stealth and cunning to escape the\ndeadly creature.\n\nCreate: A map of the island using an innovative cartography mechanic.\nUse a true-to-life triangulation system to pinpoint your location on\nthe island and construct a map of the its boundaries, contours an\nlandmarks.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n5. Play the game\n6. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups","torrent":{"xt":"urn:btih:a376075eace676dc478c54862caf171e5091c8a2","amp;dn":"Miasmata-SKIDROW+%5BEtGamez%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a376075eace676dc478c54862caf171e5091c8a2","infoHashBuffer":{"type":"Buffer","data":[163,118,7,94,172,230,118,220,71,140,84,134,44,175,23,30,80,145,200,162]},"announce":[],"urlList":[]}}