{"title":"Time Team - Season 05 (1998) - 8 Episodes","uid":8664614,"size":2509632375,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a40dd513c5b99562e9e1ebf697b5a5bb809cf604&amp;dn=Time+Team+-+Season+05+%281998%29+-+8+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"bnaron","files":9,"time":1373387420,"description":"Time Team - Season 05 (1998) - 8 Episodes\n\nSeries Summary:\n\nThis is archaeology against the clock as the Time Team hit the road with just three days to investigate, excavate and extrapolate. Dig locations include, Richmond, Aston Eyre and Mallorca.\n\nS05E01 - Richmond, Surrey - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         The first dig of the series isn't set in some deserted field but on the immaculate lawns of Trumpeters House in Richmond, near London. Records show it was the site of a royal palace from the time of Edward III through to Elizabeth I, who died there. Destroyed during Cromwell's Commonwealth, the site has lain unexcavated.\n\n\nS05E02 - Greylake, Somerset - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         In Iron Age times, the lowlands of Somerset were marshland, with occasional high ground supporting human habitation. Boats couldn't cross the expansive swamps so, ingeniously, wooden walkways stretching for hundreds of yards were built.\n\n\nS05E03 - Sanday, Orkney Islands, Scotland - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         Time Team's third outing sees them in Scotland, after schoolchildren on the Orkney island of Sanday asked them to investigate local mounds that could, reputedly, be of Viking origin. This is the first time the Team have looked for Norse archaeological finds.\n\nS05E04 - Turkdean, Gloucestershire - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         In August 1997, Time Team attempted their most ambitious project ever - three days of live excavation with the very real possibility of finding precisely nothing. The weekend ended with evidence of a Romano-British villa complex that is one of the largest ever found in Britain. This programme is an edited version of that weekend, capturing the key moments of exciting finds and day-by-day evidence of the growing extent of the site.\n\n\nS05E05 - Deya, Mallorca, Spain - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         This series' overseas visit is to Mallorca in pursuit of the Beaker people, an enigmatic culture thought by some to have been responsible for the introduction of metal work into Britain.\n\n\nS05E06 - Aston Eyre, Shropshire - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         Time Team's efforts are concentrated as much above the ground as beneath as they travel to Aston Eyre, Shropshire where a farmhouse converted from a medieval gatehouse is just the starting point for three days of hard work. Because behind it is a derelict building that would, in the 14th century, have been the grand hall of the lord of the manor and, as Tony Robinson points out as he is lifted above the site, a `whole complex of buildings, a jumble of remains which will provide a unique picture of medieval life'.\n\n\nS05E07 - Downpatrick, County Down, Northern Ireland - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         Time Team travel to Downpatrick, one of Ireland's most sacred sites where St Patrick, patron saint of All Ireland, set up his first church. On Cathedral Hill sits a magnificent church renovated from its medieval origins in the 18th century. In just three days, Time Team are trying to find evidence of the early Christian monastery and the later Benedictine buildings (St Patrick's 5th century buildings of wood would have left no trace).\n\nS05E08 - High Worsall, North Yorkshire - Res=640x480 - Data Rate=768k - fps=25 Audio=mp3 - Bit Rate=96k\n\n         In the last in the current series, Tony Robinson leads the Time Team to Teesside. It has been known for years that just yards from the current village is the site of a medieval village but the riddle the Team have just three days to unravel is why it was abandoned so suddenly, literally disappearing off the map. The answer, eventually found through both archaeology and through records of the time, is as unexpected as it is shocking.","torrent":{"xt":"urn:btih:a40dd513c5b99562e9e1ebf697b5a5bb809cf604","amp;dn":"Time+Team+-+Season+05+%281998%29+-+8+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a40dd513c5b99562e9e1ebf697b5a5bb809cf604","infoHashBuffer":{"type":"Buffer","data":[164,13,213,19,197,185,149,98,233,225,235,246,151,181,165,187,128,156,246,4]},"announce":[],"urlList":[]}}