{"title":"Alex Jones Show - 2013 Jul 10 WE [sebaygo1]","uid":8671295,"size":62666669,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a5a242a955a30107b880c9a11f9c33c51c90b2e2&amp;dn=Alex+Jones+Show+-+2013+Jul+10+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":11,"time":1373498750,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 10 July 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Wednesday, July 10 edition of The Alex Jones Show, Alex breaks down new developments in the ongoing NSA spy-gate scandal as Obama moves to predictively target potential whistleblowers and &quot;insider threats&quot; by asking federal workers to spy on each other. \n\nAlex also analyzes new information regarding the Pentagon's purging of files dealing with the Navy SEAL raid on the Bin Laden compound in Pakistan. \n\nOn today's show Alex also analyzes the intensifying war in Syria where Obama-backed FSA rebels have imposed food blockades and are shooting protestors in the city of Aleppo, in addition to Russia's UN ambassador also promoting claims that opposition fighters, not Syrian forces, are using chemical weapons. \n\nWe'll also be covering the arrest of fellow radio host and political activist Adam Kokesh mere hours after he appeared in an interview with Alex on the Infowars Nightly News, whose residence was raided last night after he staged a valiant July 4th open carry protest in Washington DC.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:a5a242a955a30107b880c9a11f9c33c51c90b2e2","amp;dn":"Alex+Jones+Show+-+2013+Jul+10+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a242a955a30107b880c9a11f9c33c51c90b2e2","infoHashBuffer":{"type":"Buffer","data":[165,162,66,169,85,163,1,7,184,128,201,161,31,156,51,197,28,144,178,226]},"announce":[],"urlList":[]}}