{"title":"Il est plus facile pour un chameau","uid":8599260,"size":943475342,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aa17c6f2f084012ebcc1d17f778e665ba23a39b4&amp;dn=Il+est+plus+facile+pour+un+chameau&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piratepot","files":1,"time":1371841465,"description":"As a little girl, Federica fantasized about having beautiful long hair that would grow back as soon as she cut it, about never-ending cones of cotton candy and about countless adventures that took her to the far side of the world. Now a charming thirty-something-single woman, Federica's fantasies have evolved, adding lovers, stardom, and motherhood to her waking dreams, where Federica continues to press for her everyday life to be as real as the fantasies that invade her. Unfortunately, Federica's daydreams can only provide a meager distraction from the reality she faces. Her career as a successful playwright is heading south, her boyfriend is pressuring her to start a family, a former lover wishes to rekindle an old affair, her sister is barely talking to her, her brother is self-centered and her loving father is terminally ill. And as if to make matters worse, Federica is rich, too rich, and the guilt that consumes her because of it is pushing her over the edge. As Federica struggles to find meaning in her life, she wrestles with her feelings about death and responsibility. She alleviates the added weight of the haunting guilt that her wealth derives through her vivid imagination, where her reality grows wonderful and, if only fleetingly, gives her the sense that all is perfect in her world.","torrent":{"xt":"urn:btih:aa17c6f2f084012ebcc1d17f778e665ba23a39b4","amp;dn":"Il+est+plus+facile+pour+un+chameau","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa17c6f2f084012ebcc1d17f778e665ba23a39b4","infoHashBuffer":{"type":"Buffer","data":[170,23,198,242,240,132,1,46,188,193,209,127,119,142,102,91,162,58,57,180]},"announce":[],"urlList":[]}}