{"title":"CentOS 5.8 x86 Installing in it WHM/Cpanel","uid":7873182,"size":1746486317,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aad3700c0d81fbec3e4be4d3b71422d6e018f5a2&amp;dn=CentOS+5.8+x86+Installing+in+it+WHM%2FCpanel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"jenaLopez","files":-1,"time":1354272419,"description":"cPanel is a Unix based web hosting control panel that provides a graphical interface and automation tools designed to simplify the process of hosting a web site. cPanel utilizes a 3 tier structure that provides capabilities for administrators, resellers, and end-user website owners to control the various aspects of website and server administration through a standard web browser.\n\nIn addition to the GUI interface, cPanel also has command line and API-based access that allows third party software vendors, web hosting organizations, and developers to automate standard system administration processes.[2]\n\ncPanel is designed to function either as a dedicated server or virtual private server. The latest cPanel version supports installation on CentOS, Red Hat Enterprise Linux (RHEL), and CloudLinux.[3] cPanel 11.30 is the last major version to support FreeBSD.[4][5]\n\nApplication-based support includes Apache, PHP, MySQL, PostgreSQL, Perl, and BIND (DNS). Email based support includes POP3, IMAP, SMTP services. cPanel is commonly accessed on port 2082, with an SSL-secured server operating on port 2083.\n\nOnce installed, cPanel cannot be removed (without extreme difficulty). The server must be formatted, and the operating system reinstalled. Similarly, it should only be installed on a freshly installed operating system with minimal prior configuration.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/CPanel&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/CPanel&lt;/a&gt;","torrent":{"xt":"urn:btih:aad3700c0d81fbec3e4be4d3b71422d6e018f5a2","amp;dn":"CentOS+5.8+x86+Installing+in+it+WHM%2FCpanel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aad3700c0d81fbec3e4be4d3b71422d6e018f5a2","infoHashBuffer":{"type":"Buffer","data":[170,211,112,12,13,129,251,236,62,75,228,211,183,20,34,214,224,24,245,162]},"announce":[],"urlList":[]}}