{"title":"The Black Pack XXX DVDRip x264 -Pr0nStarS","uid":7876939,"size":1224468806,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ab1661430db5f2d765ce0b2da322049aa0f98a25&amp;dn=The+Black+Pack+XXX+DVDRip+x264+-Pr0nStarS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1354371785,"description":"Category Black, Feature \n  \nDirector Sean Michaels \n\nStarring Leah Luxxx, Monique Symone, Cali Sweets, Mr Marcus, Lexington Steele, Sean Michaels, Jack Napier, Bambi Wolfe, Layton Benton \n\n\nDescription\n\nDirector, stud and adult entrepreneur, veteran Sean Michaels wears many hats (literally!), carving his own special niche within the XXX industry. But his latest venture is even bigger and blacker than his famous cock: In 'Sean Michaels' The Black Pack,' the suave seducer brings together four legends of ebony porn in a group effort to elevate the standard of sex for a new age. This foursome of lady-killers - Mr. Marcus, Lexington Steele, Jack Napier and our man Sean - are a talented crew of black businessmen oozing sophisticated style. In four scenes of black-on-black sensuality, the members of the Pack tame up-and-coming African-American female porn talent, each with his own style ... and the results range from nuanced to nasty.\n\nSean's girls are smokin' examples of Nubian perfection. Luscious Layton Benton gets seduced during a game of billiards. Stunning Cali Sweets and light-skinned rookie princess Bambi Wolfe ride the huge dicks of Jack and Lexington in a passionate four-way. Adorable, doll-faced Monique Symone gets railed by the director in an intimate coupling. And super-fine Leah Luxxx services Mr. Marcus and Sean at the same time. This special release includes a free bonus disc of interviews with the Black Pack members, the female cast, and even a special conversation with sexual icon Nina Hartley! The deluxe show will appeal to fans of beautiful black babes, big black cock and anyone interested in the history and future of adult entertainment. 'Sean Michaels' The Black Pack' shows what a porn Renaissance man can accomplish. \n\nDuration                                 : 2h 9mn\nBit rate                                 : 1 133 Kbps\nMaximum bit rate                         : 3 516 Kbps\nWidth                                    : 704 pixels\nHeight                                   : 394 pixels\n\n\n &lt;a href=&quot;\nhttp://tippic.eu/?v=fror.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tippic.eu/?v=fror.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tippic.eu/?v=bjsj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tippic.eu/?v=bjsj.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://tippic.eu/?v=psblackpac.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tippic.eu/?v=psblackpac.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ab1661430db5f2d765ce0b2da322049aa0f98a25","amp;dn":"The+Black+Pack+XXX+DVDRip+x264+-Pr0nStarS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab1661430db5f2d765ce0b2da322049aa0f98a25","infoHashBuffer":{"type":"Buffer","data":[171,22,97,67,13,181,242,215,101,206,11,45,163,34,4,154,160,249,138,37]},"announce":[],"urlList":[]}}