{"title":"Big.Tit.Centerfolds.DiSC1.XXX.DVDRip","uid":8529512,"size":1843734558,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ab88c3e27d20280f8399e09a4204c2f9300c08ea&amp;dn=Big.Tit.Centerfolds.DiSC1.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":5,"time":1370109100,"description":"Category All Sex,Big Tits \n  \nDirector Kevin Moore \nStarring Lisa Ann, Mr Pete, Bridgette B, Bruce Venture, Madison Ivy, Nikki Sexx, Ramon, Chad Alva, Brooklyn Chase \n\nBig Tit Queen Lisa Ann Gets Royally Fucked In Every Conceivable Way!\n\nMadison Ivy Has Finally Arrived! She Doesn't Disappoint In Her Fucking And Sucking!\n\nThere Isn't A Girl Around Sluttier Than The Insatiable Nikki Sexx!\n\nBig Tit Newcummer Brooklyn Chase Is As Slutty As She Is Hot. Perfect Pussy Alert!\n\nWatch As Bridgette B. 's Enormous Perfect Boobs Tease, Fuck And Bounce The Jizz Right Out!\n\nAcclaimed director Kevin Moore takes us back to the busty basics in his hot new movie 'Big Tit Centerfolds. ' After exploring some very specific niche pursuits in his hard-core POV fetish productions, the hardworking pornographer has switched gears to create a celebration of classic glamour and massive knockers. The new movie stars a cast of curvaceous, mature models all flaunting their impressive, up-front attributes. And Kevin's camerawork concentrates on the fun bags, with ample titty fucking in each scene. First is the full-bodied queen of MILFs, voluptuous Lisa Ann, squeezing her bulging boobs as she peels off a colorful bikini. The super-stacked slut treats younger stud Mr. Pete to her blow job expertise and rides his rock-hard cock until he spurts cum all over her heaving bosom!\n\nQuintessential porn slut Bridgette B. releases her monster mammaries from a sexy fishnet ensemble and greases her globes till they glisten. Latin cocksman Ramon Nomar shoves his throbbing dick down the blonde knockout's throat and fills Bridgette's hungry pussy with meat before splattering her cleavage with goo. Refined babe Madison Ivy enjoys a hard-core pumping from horny Bruce Venture, who decorates her chest with hot jizz. Bodacious bombshell Nikki Sexx teases the camera with her giant jugs, then takes a hard dick deep inside her. Finally, luscious brunette newcomer Brooklyn Chase wraps her wobbly jugs around Chad Alva's shaft and takes a rough ride that earns the sensuous lady a messy load. 'Big Tit Centerfolds' is big, bouncy fun from the old school! \n\n\n\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=psbigtitce.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=psbigtitce.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=psbigtwow.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=psbigtwow.jpg&lt;/a&gt;\n\n\ncd1  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=psbigtxpx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=psbigtxpx.jpg&lt;/a&gt;\n\ncd2  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=psbigtara.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=psbigtara.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ab88c3e27d20280f8399e09a4204c2f9300c08ea","amp;dn":"Big.Tit.Centerfolds.DiSC1.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab88c3e27d20280f8399e09a4204c2f9300c08ea","infoHashBuffer":{"type":"Buffer","data":[171,136,195,226,125,32,40,15,131,153,224,154,66,4,194,249,48,12,8,234]},"announce":[],"urlList":[]}}