{"title":"POtHS - Holy Treasures - 33 - The Secret Caves of Giza","uid":7932746,"size":5056747056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac2dea6068af587fb57ee40fa0337278e9bfebab&amp;dn=POtHS+-+Holy+Treasures+-+33+-+The+Secret+Caves+of+Giza&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"POtHS11","files":-1,"time":1355760755,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Holy Treasures - 33 - The Secret Caves Of Giza\n\n\n\n\nPOtHS Comment: Super Excellent.\n\nDescription:\n\nThe Secret Caves of Giza:\nBeneath the pyramids of Egypt lies a lost underworld of catacombs, hewn chambers and cave tunnels that have remained unexplored for hundreds of years. They are alluded to in ancient texts and Arab legends, but have been left unexplored until today. They have now been rediscovered and investigated for the first time. What exactly does this subterranean realm tell us about the pyramids, their relationship to the stars and the mythical origins of Egyptian civilization? Discover for yourself as we explore the &quot;Lost Caves of Giza.&quot;\n\nComing to DVD from UFOTV and LOADED with Bonus Features. 83 mins. Cat# U1106. Visit us online at http://www.UFOTV.com.\n\np.s., later upon furhter archeological digs, they discovered what they believe is the Tomb of Osiris in these catacombs under the Sphinx.\n------------------------------------------------------------------\n\nMystery of the Sphinx - Expanded Feature Film:\nTHE EXPANDED DIRECTOR'S CUT OF THE EMMY AWARD WINNING NBC NETWORK SPECIAL. 95 mins. This program presents geological evidence that the world's most famous monument, The Great Sphinx of Egypt, may be thousands of years older than we have been taught.\n\nHow were the massive 200-ton limestone blocks lifted and stacked five high to build the Sphinx Temple? John Anthony West and a team of seismologists, headed by Boston University's Professor Robert Schoch, discovered a square cavity directly beneath one of the paws of the Sphinx. According to the experts, it does not appear to be a natural formation. Could this be the Hall of Records of Atlantis? Includes the facts about this amazing mystery along with a fascinating series of spellbinding interviews with researchers, scientists and the best-known most credible ancient authorities in the world today.\n\nAs always, one should be aware and cautious for 'new age' or alien agendas.  Anyone not informed of such agendas, please download the POtHS torrent series &quot;POtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons&quot; and related volumes.  The Mystery of the Sphinx - NOW ON DVD with Bonus Features - 95 mins. Cat. #U526. Go to http://www.UFOTV.com.\n------------------------------------------------------------------\n\nHall of Records Location Discovery:\nCreated by Youtuber TombofSeker, he presents his findings and interpretations to the discovery of ancient Egyption Hall of Records.  Included are the following 5 parts:\n\nPart 1 reveals the Hall of Records location in the Giza Plateau - We cover the importance of the Orion Constellation , Pleiades and Thutmose IV Dream Stele and how they all tie together to lead us to this great discovery.\nSeptember 21, 2011\n\nIn part 2 of the Hall of Records location presentation we examine the inside of Thutmose III Tomb and the Amduat.  By following the Tomb of Osiris to the Hall of Records we make another amazing discovery of a 3rd tomb in the Giza plateau.  Learn what hours 4, 5 and 8 all represent in the Amduat - offering further proof of our Hall of Records location under the Cairo-Alex Road.\n\nIn part 3, we examine the Giza Plateau and create Pentagrams using the known tomb locations. From our large Pentagram see how we create a Golden Rectangle and make our next great discovery. We find the length of the short side detailed in the 7th hour of the Am-Tuat.\n\nIn Part 4 we discuss PHI - Find out why the number 7 is a sacred number to the ancient Egyptians. We also look at the distances in our tomb calculations. Thanks for the questions about the dual pentagrams - I explain why they are placed where they are...\n\nIn Part 5 we discuss Mastabas and recap all 5 parts of our presentation. Also see how the tombs relate to the 5 elements and the 'new age' and use of terms &quot;frequency&quot; and &quot;unity&quot; agenda.\n\nPlus, the Sphinx and music.  In this presentation, we examine how the Giza Sphinx represents sound and music. See how the Old and New Kingdom Sphinx Temples connect the Hidden Palace to the Sphinx.\nUsing the dimensions of the Hidden Palace we create the music scale using calculations including Golden Rectangles.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:ac2dea6068af587fb57ee40fa0337278e9bfebab","amp;dn":"POtHS+-+Holy+Treasures+-+33+-+The+Secret+Caves+of+Giza","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac2dea6068af587fb57ee40fa0337278e9bfebab","infoHashBuffer":{"type":"Buffer","data":[172,45,234,96,104,175,88,127,181,126,228,15,160,51,114,120,233,191,235,171]},"announce":[],"urlList":[]}}