{"title":"EXPLOITED COLLEGE GIRLS - Veronica - Her Mom Watches HD 720p","uid":8646493,"size":1505578750,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:af1e2da91d38b1c0f18b815ba679027a9cf05ba6&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Veronica+-+Her+Mom+Watches+HD+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1372997388,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=qpwu7_vna.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=qpwu7_vna.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=7y2td_ecg_veronica3_720_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=7y2td_ecg_veronica3_720_s.jpg&lt;/a&gt;\n\nVeronica is a tiny girl, but has a big sexual appetite. When I ask her when the last time she had sex was, she tells me she'd just gotten fucked the morning of the shoot. That's a first! Speaking of firsts, be sure to check out the last few minutes of the update when I interview Veronica's mom. Yes, her actual mom and I discuss the shoot.\n\nVeronica's a tiny little thing with a tight little body and an even tighter little puss, but loose morals. During our interview she shyly tells me about her sex life. She's just 18, but in the short time she's been open for business she's tried a whole lot of things, including three ways with her girlfriend and a guy and a ton of girl on girl sessions with her school mates.\n\nI get her positioned on her back, legs spread wide showing off her vag and I get to work with my fingers and whatever shyness she had coming into the shoot, is gone by the time she has her first O. Granted it's a little, quiet one, but an O is an O and Molly busts one out. I think she can do better, so I dig into the ECG toy box and pull out a vibrator and get back to it. Sure enough, it works and her second orgasm is a lot bigger.\n\nWhen I finally get her naked she seems a little nervous, but she goes with it. Pay attention to the way she acts during the first part of the update when I get her off with the vibrator - this is one of my favorite things to do at ECG. To take a shy, nervous girl and turn her into a nympho. The moment a girl lets go of her inhibitions and really gets into the shoot, is always amazing. In Veronica's case the transformation comes after her first orgasm, you can see it in her facial expression and body language as she goes from nerves to nympho.\n\nAfter playing with her tight pussy and getting her off several times in a row, I have her blow me. I'm not gonna lie and say this is the best head I've ever gotten, but a BJ is a BJ, emirate? Eventually, I get her on the bed and stuff that tiny pussy. If there is one thing I love about a petite girl, it's how tight that puss is. It feels amazing. After another orgasm, I flip her over and hit it in doggy and then after yet another orgasm I pin her down and pound her, where she has a HUGE final orgasm.\n\nThe shoot finishes with a decent facial, but by far the best part is AFTER the big finish when I have a nice wrap up conversation with Veronica's mom about her daughter and the shoot. It's pretty f-ing fantastic, so be sure to watch al the way to the end","torrent":{"xt":"urn:btih:af1e2da91d38b1c0f18b815ba679027a9cf05ba6","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Veronica+-+Her+Mom+Watches+HD+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af1e2da91d38b1c0f18b815ba679027a9cf05ba6","infoHashBuffer":{"type":"Buffer","data":[175,30,45,169,29,56,177,192,241,139,129,91,166,121,2,122,156,240,91,166]},"announce":[],"urlList":[]}}