{"title":"Supernatural 8x2 Sub Español","uid":7829951,"size":367523436,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af31ff7f223d58fb282a61bfc0ea37b48576969c&amp;dn=Supernatural+8x2+Sub+Espa%26ntilde%3Bol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Fozzy_Network","files":1,"time":1353026576,"description":"Dean and Sam are forced by Kevin to look for his mother and they save his mother from the demons. Then they find that the tablet has been stolen by Plutus and is being auctioned in a supernatural auction. Dean, Sam, Kevin and his mother join the auction but are not able to recover the tablet, furthermore Kevin is also included in the auction. This causes Kevin's mother to bid her soul. But before she can give her soul to Plutus, Crowley makes a deal with Plutus' assistant to betray Plutus. Dean tries to kill a possessed Kevin's mother which enrages Kevin. Dean and Sam are able to save Kevin and his mother but fail to recover the tablet which Crowley took with him. Kevin tries to talk with his traumatized mother and Dean tries to help him by advising him but Kevin points out that Dean just tried to kill his mother. Kevin then asks Dean and Sam to leave so that he could talk to his mother alone. But after a few minutes they escape and leave a note saying that Dean lets die those who he does not need. ","torrent":{"xt":"urn:btih:af31ff7f223d58fb282a61bfc0ea37b48576969c","amp;dn":"Supernatural+8x2+Sub+Espa%26ntilde%3Bol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af31ff7f223d58fb282a61bfc0ea37b48576969c","infoHashBuffer":{"type":"Buffer","data":[175,49,255,127,34,61,88,251,40,42,97,191,192,234,55,180,133,118,150,156]},"announce":[],"urlList":[]}}