{"title":"POV.Jugg.Fuckers.5.XXX.DVDRip.x264-CHiKANi","uid":8666601,"size":2277547187,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:aff772b35d5dcba78c1211272676888c8accf06e&amp;dn=POV.Jugg.Fuckers.5.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":3,"time":1373413361,"description":"Glamour-obsessed pornographer and unrepentant tit monger Jonni Darkko has a special talent for first-person footage. When Jonni shoots POV-style, he focuses all attention on his girls as they tease, tempt and use every trick at their disposal to make hard cocks erupt in ecstasy. His latest breast-centric journey, POV Jugg Fuckers 5, leads us deep into the cleavage of 11 stunning sluts who love delivering wet, gagging blow jobs and silky, oily titty-fucks for Jonni and some of his well hung buddies. Asian bombshell Jessica Bangkok drools oil all over her giant hooters and squeezes the directors shaft between them; she deep-throats his prick until he loads her talented mouth with jism. After buxom super-MILF Lisa Ann greases up her chest and slides Jonnis prick up the middle, its not long before her face is splattered with hot semen. Naturally stacked brunette Penelope Piper is bored with the guys watching the ballgame on TV. She changes into her skimpiest bikini and lures all nine dudes away with the promise of some dirty dicksucking and sensuous jugg fucking. By the time the boys have finished, Penelopes huge whoppers are dripping with spermy goop. Theres also Italian-American bimbette Gia DiMarco; mature and gorgeous Ava Addams; busty Latina cutie Yurizan Beltran; outrageously top-heavy blonde Latina Bridgette B.; big-eyed and bigger-boobed Larkin Love; experienced blonde bombshell Julia Ann; feisty cougar Alia Janine; and pretty plumper Karen Fisher. With a bounty of bodacious boobs, quite simply, your breast value.\n\nAlia Janine, Ava Addams, Bridgette B, Gia Dimarco, Jessica Bangkok, Julia Ann, Karen Fisher, Larkin Love, Lisa Ann, Penelope Piper, Yurizan Beltran\n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=povjuggfuc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=povjuggfuc.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=povjuggvg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=povjuggvg.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:aff772b35d5dcba78c1211272676888c8accf06e","amp;dn":"POV.Jugg.Fuckers.5.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff772b35d5dcba78c1211272676888c8accf06e","infoHashBuffer":{"type":"Buffer","data":[175,247,114,179,93,93,203,167,140,18,17,39,38,118,136,140,138,204,240,110]},"announce":[],"urlList":[]}}