{"title":"Woke Up Lonely (Audiobook) by Fiona Maazel","uid":8581354,"size":356000054,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b1d8d88d34686e0e89fa54c666ca494924e83c1e&amp;dn=Woke+Up+Lonely+%28Audiobook%29+by+Fiona+Maazel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":11,"time":1371420587,"description":"\nWoke Up Lonely (Audiobook) by Fiona Maazel read by Bernadette Dunne\nEnglish | April 2, 2013 | ISBN: 1624064876 , 1624064833 | Duration: 12:20:00 | MP3 64 kbps | 339 MB\n\n\nThurlow Dan is the founder of the Helix, a cult that promises to cure loneliness in the twenty-first century. With its communes and speed-dating, mixers and confession sessions, the Helix has become a national phenomenon-and attracted the attention of governments worldwide.\nBut Thurlow, camped out in his Cincinnati headquarters, is lonely-for his ex-wife, Esme, and their daughter, whom he hasn't seen in ten years.\nEsme, for her part, is a covert agent who has spent her life spying on Thurlow, mostly to protect him from the law. Now, with her superiors demanding results, she recruits four misfits to botch a reconnaissance mission in Cincinnati. But when Thurlow takes them hostage, he ignites a siege of the Helix House that will change all their lives forever.\n\nWith fiery, exuberant prose, Fiona Maazel takes us on a wild ride through North Korea's guarded interior and a city of vice beneath Cincinnati, a ride that twists and turns as it delves into an unsettled, off-kilter America. Woke Up Lonely is an original and deeply funny novel that explores our very human impulse to seek and repel intimacy with the people who matter to us most.\n\n&quot;Woke Up Lonely is the novel equivalent of a sonic boom-it builds, it explodes, it leaves your ears, mind, and soul ringing for days. Who else writes sentences like this, who else writes sound art prose that transports a heart-killing story of human frailty, susceptibility, loyalty, and isolation? No one.&quot;-Heidi Julavits, author of The Vanishers ","torrent":{"xt":"urn:btih:b1d8d88d34686e0e89fa54c666ca494924e83c1e","amp;dn":"Woke+Up+Lonely+%28Audiobook%29+by+Fiona+Maazel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d8d88d34686e0e89fa54c666ca494924e83c1e","infoHashBuffer":{"type":"Buffer","data":[177,216,216,141,52,104,110,14,137,250,84,198,102,202,73,73,36,232,60,30]},"announce":[],"urlList":[]}}