{"title":"CastingXXX - Sarah","uid":7864591,"size":602081365,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b26460e03c3f4404b96371d93446b9ec5b9b9311&amp;dn=CastingXXX+-+Sarah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"R0thschild","files":1,"time":1354027790,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=716057&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=716057&lt;/a&gt;\n\nSize: 602081365 bytes (574.19 MiB), duration: 00:45:49, avg.bitrate: 1752 kb/s\nAudio: aac, 44100 Hz, stereo (eng)\nVideo: h264, yuv420p, 1280x720, 25.00 fps\n\n\nSarah (45 mins) Ahhh Sarah the busty brunette from Hungary. Her tits wouldn't stop staring at me, I found it took all my concentration to look in any other direction than her chest. In fact I didn't look at her face for the entire interview I was so entranced by their hypnotic gaze. I was just imagining all the things I was going to do to them once I released them from their cotton shackles. And to my delight it wasn't long before I was having an amazing tit wank... bliss. Ok, enough about the tits. Unfortunately Sarah didn't speak English so I had to do quite a bit of speaking in Hungarian. I tried my best to translate what was happening but it was getting a bit tiresome. I was pleasantly surprised when she said that she only liked boys, and that she worshiped the sausage. This one really needed money so she wanted to start straight away, it was almost a bit too easy to get her to do what I wanted. Sarah had a mischievous smile that I won't forget in a hurry. I'll never forget her speaking casually to her boyfriend on the phone as I exploited her doggy style. She was trying to conceal her groans as they chatted away, but I think he must have known she was getting her rocks off. I still can't quite believe that this girl was on the phone to her husband and fucking me at the same time. Deep down I know he must have been able to hear her trying to conceal her groans as I kept pumping her from behind.","torrent":{"xt":"urn:btih:b26460e03c3f4404b96371d93446b9ec5b9b9311","amp;dn":"CastingXXX+-+Sarah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b26460e03c3f4404b96371d93446b9ec5b9b9311","infoHashBuffer":{"type":"Buffer","data":[178,100,96,224,60,63,68,4,185,99,113,217,52,70,185,236,91,155,147,17]},"announce":[],"urlList":[]}}