{"title":"The Conversation 1974 DVDRip Sonata Premiere","uid":7838999,"size":695956548,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b31e590c1d9a3d20c1a6196533726b8663402aa6&amp;dn=The+Conversation+1974+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"klinho","files":2,"time":1353277439,"description":"Made between The Godfather (1972) and The Godfather Part II (1974), and in part an homage to Michelangelo Antonioni's art-movie classic Blow-Up (1966), The Conversation was a return to small-scale art films for Francis Ford Coppola. Sound surveillance expert Harry Caul (Gene Hackman) is hired to track a young couple (Cindy Williams and Frederic Forrest), taping their conversation as they walk through San Francisco's crowded Union Square. Knowing full well how technology can invade privacy, Harry obsessively keeps to himself, separating business from his personal life, even refusing to discuss what he does or where he lives with his girlfriend, Amy (Teri Garr). Harry's work starts to trouble him, however, as he comes to believe that the conversation he pieced together reveals a plot by the mysterious corporate &quot;Director&quot; who hired him to murder the couple. After he allows himself to be seduced by a call girl, who then steals the tapes, Harry is all the more convinced that a killing will occur, and he can no longer separate his job from his conscience. Coppola, cinematographer Bill Butler, and Oscar-nominated sound editor Walter Murch convey the narrative through Harry's aural and visual experience, beginning with the slow opening zoom of Union Square accompanied by the alternately muddled and clear sound of the couple's conversation caught by Harry's microphones. The Godfather Part II and The Conversation earned Coppola a rare pair of Oscar nominations for Best Picture, as well as two nominations for Best Screenplay (The Godfather Part II won both). Praised by critics, The Conversation was not a popular hit, but it has since come to be seen as one of the artistic high points of the decade, as well as of Coppola's career. Its atmosphere of paranoia and suspicion, combined with its obsessive loner antihero, made it prototypical of the darker &quot;American art movies&quot; of the early '70s, as its audiotape storyline also made it seem eerily appropriate for the era of the Watergate scandal. ~ Lucia Bozzola, Rovi","torrent":{"xt":"urn:btih:b31e590c1d9a3d20c1a6196533726b8663402aa6","amp;dn":"The+Conversation+1974+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b31e590c1d9a3d20c1a6196533726b8663402aa6","infoHashBuffer":{"type":"Buffer","data":[179,30,89,12,29,154,61,32,193,166,25,101,51,114,107,134,99,64,42,166]},"announce":[],"urlList":[]}}