{"title":"20121108-Stossel-[Did Freedom Win].Fox Business.CF.avi","uid":7810377,"size":281489516,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b43f7b6999c5495cbcba5c8bb5412e67ad9c0b6a&amp;dn=20121108-Stossel-%5BDid+Freedom+Win%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1352513390,"description":"----------\n\nSTOSSEL - [Did Freedom Win?] - Fox Business Network\n2012, November 8, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nIs President Obama's re-election, along with pro-big government Senators, a total loss for individual liberty? It does mean four more years of increased government spending and bureaucracy.\n\nOur special correspondent, Kennedy, was in Chicago on election night. She asked Obama supporters what his re-election means for freedom. Most respondents looked bewildered. Freedom?\n\nBut there was some good election news. Matt Welch and Nick Gillespie, co-authors of Declaration of Independents, point out that freedom won in a few states. Some legalized marijuana and voted to allow gay marriage.\n\nSome candidates were elected to Congress who give some reason to be hopeful. Our all-star panel--David Boaz, Hadley Heath of the Independent Women's Forum, and columnist Deroy Murdock--tell us about pro-freedom candidates like Justin Amash, Thomas Massie, and Ted Cruz. Cruz? He wants a bigger military and a more expensive border fence! But Murdock points out &quot;he's also somebody who believes in cutting taxes, limiting spending, balancing the budget--not creating boxes and boxes of regulations.&quot;\n\nGary Johnson will join us. He got one million votes--more than any previous Libertarian candidate.\n\nFinally, I'll explain how we need to &quot;fix&quot; government the way we fix a cat or spay a dog. I stole that idea from PJ O'Rourke.","torrent":{"xt":"urn:btih:b43f7b6999c5495cbcba5c8bb5412e67ad9c0b6a","amp;dn":"20121108-Stossel-%5BDid+Freedom+Win%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43f7b6999c5495cbcba5c8bb5412e67ad9c0b6a","infoHashBuffer":{"type":"Buffer","data":[180,63,123,105,153,197,73,92,188,186,92,139,181,65,46,103,173,156,11,106]},"announce":[],"urlList":[]}}