{"title":"Alien 4 - Resurrection (Die Wiedergeburt) Extended Cut 1080p Blu","uid":7959605,"size":2101078016,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b44c6780a3a5c522b24196786818ce9a46e7eb57&amp;dn=Alien+4+-+Resurrection+%28Die+Wiedergeburt%29+Extended+Cut+1080p+Blu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DMXCrew_Noah","files":-1,"time":1356542676,"description":"Alien 4 - Die Wiedergeburt - Resurrection .-. 1080p Bluray-Rip German AC3\n\nSoure: 50Gb-Bluray-Disc, German DTS 5.1, 1920x1080p (2,35-1)\n\nDirector: Jean-Pierre Jeunet\n\nCast: Sigourney Weaver, Winona Ryder, Dominique Pinon, Ron Perlman, Gary Dourdan, Michael Wincott\n\nPlot:\n\n200 Jahre nach ihrem Tod wird Ellen Ripley von skrupellosen MilitÃƒÂ¤r-Wissenschaftlern an Bord des terranischen \nRaumkreuzers U.S.M. Auriga wieder zum Leben erweckt: Sie klonen die Gene von Ripley so oft, bis es gelingt, die \nGene der Alien-KÃƒÂ¶nigin zu extrahieren und dazu auch die Gene von Ripley zur Aufzucht einer lebenden Ripley als \nWirt zu erhalten. Die Wissenschaftler wollen die xenomorphen Aliens fÃƒÂ¼r den militÃƒÂ¤rischen Einsatz weiterzÃƒÂ¼chten. \nZu diesem Zweck benÃƒÂ¶tigen sie WirtskÃƒÂ¶rper, die ihnen von Weltraumpiraten in Form von entfÃƒÂ¼hrten Kolonisten \ngeliefert werden. Bald schon schlÃƒÂ¼pfen die ersten Aliens, die in ausbruchssicheren KÃƒÂ¤figen untergebracht werden.\n\nDie hochintelligenten Kreaturen entkommen letztendlich indem sie einen Artgenossen tÃƒÂ¶ten, dessen extrem ÃƒÂ¤tzendes \nBlut die KÃƒÂ¤fige zerstÃƒÂ¶rt. Die nun entflohenen Aliens dezimieren Wissenschaftler und Marines. Ripleys Klon verbÃƒÂ¼ndet \nsich daraufhin mit den noch anwesenden Weltraumpiraten. Gemeinsam suchen sie einen Weg, das dem Untergang geweihte \nSchiff zu verlassen. Doch diesmal muss Ripley nicht nur den Aliens entkommen, sondern auch einer neuartigen \nMensch/Alien-Kreatur, welche die geklonte Alien-KÃƒÂ¶nigin zur Welt bringt. AuÃƒÅ¸erdem setzt Vater, der Bordcomputer \nder Auriga, Kurs auf die Erde und droht die Aliens so zum Heimatplaneten der Menschheit zu bringen. Ein Mitglied \nder Piraten, die Androidin Call, will dies aber um jeden Preis verhindern.\n\nDerweil ist Ripley sich nicht mehr ganz sicher, zu welcher Spezies sie nun gehÃƒÂ¶rt, da sie einerseits ÃƒÂ¼ber die Kraft \nund Sinne eines Alien verfÃƒÂ¼gt, andererseits aber einen menschlichen KÃƒÂ¶rper hat. AuÃƒÅ¸erdem hat sie nun SÃƒÂ¤ureblut in \nihren Adern, auch agiert sie emotionsloser. Sie bringt nun schon fast Sympathie fÃƒÂ¼r ihre \nAlien-\u001dVerwandtschaft\u001d auf. Am Ende muss sie sich fÃƒÂ¼r eine Seite entscheiden.\n\nLetztlich gelingt es Ripley und der Androidin Call, das Mischwesen zu tÃƒÂ¶ten und die Auriga abstÃƒÂ¼rzen zu lassen. \nDas Schiff detoniert und Ellen Ripley kehrt hunderte von Jahren nach dem Start der Nostromo zur Erde zurÃƒÂ¼ck.","torrent":{"xt":"urn:btih:b44c6780a3a5c522b24196786818ce9a46e7eb57","amp;dn":"Alien+4+-+Resurrection+%28Die+Wiedergeburt%29+Extended+Cut+1080p+Blu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b44c6780a3a5c522b24196786818ce9a46e7eb57","infoHashBuffer":{"type":"Buffer","data":[180,76,103,128,163,165,197,34,178,65,150,120,104,24,206,154,70,231,235,87]},"announce":[],"urlList":[]}}