{"title":"South Park Season 1 Complete WITH Trey and Matt's Commentary","uid":7851629,"size":17374376963,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b45c1b659c7a24de918d8e65e73a032dadf36e8e&amp;dn=South+Park+Season+1+Complete+WITH+Trey+and+Matt%27s+Commentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Funnybook","files":-1,"time":1353616278,"description":"\nSouth Park Season 1 Complete with Trey and Matt's Commentary\n\nWhen Warner Brothers produced the South Park Season 1 DVD set\nthey refused to include the commentary because Trey and Matt\nwouldn't let them censor it.  So Trey and Matt released it\nseparately, on a set of five CDs, with instructions on how to\ntime each CD track to go along with each DVD episode.  That was\nabout halfway okay unless you had to pause or rewind the show,\nand then it was just about impossible to get the synch right\nagain without starting over from the beginning.\n\nEnter the Riktronics DVD Development Squad!\n\nWe've combined the five commentary CDs with the Season 1 DVD set\nand produced a complete set of South Park Season 1 with Trey and\nMatt's commentary included.  The video quality is unchanged.\nThere has been no re-encoding or shrinking, and we did a pretty\nfair job on the DVD authoring, artwork, and menus.  It's a damn\nnice set.\n\nEach of the 13 episodes has three audio tracks.  The first track\nis the original episode soundtrack with no commentary.  The\nsecond track is Trey and Matt's commentary with the episode\nsoundtrack subdued in the background.  The third track is the\ncommentary only, with the episode soundtrack completely\nsilenced.  You can switch between these tracks at any time using\nthe Audio key on your DVD player's remote control.\n\nSubtitles are intact!  More info in the text file in the torrent.\n","torrent":{"xt":"urn:btih:b45c1b659c7a24de918d8e65e73a032dadf36e8e","amp;dn":"South+Park+Season+1+Complete+WITH+Trey+and+Matt%27s+Commentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b45c1b659c7a24de918d8e65e73a032dadf36e8e","infoHashBuffer":{"type":"Buffer","data":[180,92,27,101,156,122,36,222,145,141,142,101,231,58,3,45,173,243,110,142]},"announce":[],"urlList":[]}}