{"title":"Samurai Cats","uid":7810419,"size":19680410,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:b5b33ff5d08c255f9f959ea9dc23b7b024e0d895&amp;dn=Samurai+Cats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Chiitah","files":-1,"time":1352514924,"description":"ABOUT SAMURAI CATS\n\n\nWelcome to the world of SAMURAI CATS, where you command an army of cute and ferocious felines in the battle for Feudal Japan! You'll meet, fight, and recruit \nall your favourite Samurai Warriors from the Japanese Civil War... in cat form!\nCollect your favourite Cat Warriors, unlock Skills and Combos, then prove your army by joining battles, tournaments, and wars!\n\n-----------------\n\n\n\nSamurai Cats is a mixture of a Trading Card type game with a Strategy Game with City Building elements.  Although the game is free on Google Play - for whatever reason Mobage only allows phones they have specifically tested each game on to download their games (rather than by OS) - so 90% of the people who could play this legally can not download it!  This is simply the main file you would download off of Google Play normally.  It's a &quot;free&quot; game with In Game Purchases for extras, tho it's one of the few free games where you can get most of even the rarest cards just by the free Kitty Points you get in game.\n\nI hope I'll help out some people who want the game but have been forbidden by the silly phone test block policy Mobage has to be able to get and enjoy the game.\n\n\nNotes:  Some people seem to have a connection error when trying to play while most people do not.  We've no clue what causes it but this is just the main normal APK file you'd get off Google Play not altered in any way.","torrent":{"xt":"urn:btih:b5b33ff5d08c255f9f959ea9dc23b7b024e0d895","amp;dn":"Samurai+Cats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5b33ff5d08c255f9f959ea9dc23b7b024e0d895","infoHashBuffer":{"type":"Buffer","data":[181,179,63,245,208,140,37,95,159,149,158,169,220,35,183,176,36,224,216,149]},"announce":[],"urlList":[]}}