{"title":"Earthworm in urethra","uid":7888751,"size":468454358,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b6108e614206e2cc39163024c77ff56a79cd0d43&amp;dn=Earthworm+in+urethra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"HKLoloPer","files":-1,"time":1354672334,"description":"I have a quite odd fetish - I want my dick to be fucked in the urethra (it sounds weird, yeah), but as my urethra is non-lengthened it's near impossible to do without a trauma. Though I rather like girls than boys, I've wanted a dick into my dick for 5 yrs, lol. Once it dawned upon me that I'd got a similar effect by the means of a live fleshy worm as its body is like a single muscle. Then I began googling and discovered that there're very few people who push living creatures into their urethrae, at best they insert vibrating rods.\n\nSo I decided to improve the situation, lol. I provided myself with a periurethral antiseptic and 4 worms (I digged them up in the village, put into a bag with earth and got to home). But then there was a sequence of failures.\n\nTo avoid urethritis I treated my glans and urethra with the antiseptic. But unexpectedly I failed my first attempts to insert a worm as he twisted as if stung, also it turned out my antiseptic was smth like an acid to worms. Only thing crossed my mind was to use sunflower oil - that's was all I had at hand, also the worm normally reacted to it. Having sprinkled oil from the syringe I stained my glans and got it slick so it became difficult to handle my head - I couldn't widen my urethra hole to &quot;help&quot; the worm to crawl into. Also the worm constantly refused to go in, I suppose it bewared of warmth of my dick. As my dick was slippery and the worm didn't obey I wasted a lot of time trying to get it into my urethra. ","torrent":{"xt":"urn:btih:b6108e614206e2cc39163024c77ff56a79cd0d43","amp;dn":"Earthworm+in+urethra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6108e614206e2cc39163024c77ff56a79cd0d43","infoHashBuffer":{"type":"Buffer","data":[182,16,142,97,66,6,226,204,57,22,48,36,199,127,245,106,121,205,13,67]},"announce":[],"urlList":[]}}