{"title":"Alex Jones Show - 2013 Jun 10 MO [sebaygo1]","uid":8561807,"size":64542477,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b9f449ef3e969a24200c97b4f549d9ab33ce86b7&amp;dn=Alex+Jones+Show+-+2013+Jun+10+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":11,"time":1370903378,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nMonday, 10 June 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Monday, June 10 edition of The Alex Jones Show, guest host Mike Adams, The Health Ranger, sits in, as Alex returns to the U.S. following a victorious and invigorating trip to sunny England where he was at the forefront of confronting and exposing the quasi-secretive Bilderberg group. \n\nMike will be breaking down the latest info regarding the tidal wave of scandals overtaking the White House as the Obama Administration scurries into damage control PR mode, all the while joking about disappearing whistleblowers. \n\nOn today's show, Mike welcomes investigative journalist Jon Rappoport to analyze the apparent war on whistleblowers, and author and American journalist Jim Marrs to relate his take on the NSA's massive spy grid. \n\nRep. Steve Stockman also details the White House's nefarious role in the NSA spying scandal, and points out why Americans should be well beyond the point of outrage.\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:b9f449ef3e969a24200c97b4f549d9ab33ce86b7","amp;dn":"Alex+Jones+Show+-+2013+Jun+10+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f449ef3e969a24200c97b4f549d9ab33ce86b7","infoHashBuffer":{"type":"Buffer","data":[185,244,73,239,62,150,154,36,32,12,151,180,245,73,217,171,51,206,134,183]},"announce":[],"urlList":[]}}