{"title":"POtHS - Holy Treasures - 32 - Eyewitness sus 2011","uid":7868374,"size":6602470749,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba0793e2679f0fcf00aadb95f9fcf0cb044b2b96&amp;dn=POtHS+-+Holy+Treasures+-+32+-+Eyewitness+sus+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1354122767,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Holy Treasures - 32 - Eyewitness To Jesus 2011\n\n\nPOtHS Comment: Super.\n\nDescription:\nEyewitness To Jesus (2011):\nA fragment of papyrus that has recently been re-discovered could be the link that can date the Gospel of Matthew all the way back to a time contemporary to the life of Jesus. The Gospel of Matthew may have been written by someone who actually witnessed events in the life of Jesus, a possible eyewitness to the last supper and perhaps even the crucifixion. In this fascinating documentary, Matthew D'Ancona of Magdalen College in Oxford travels from Egypt to the Holy Land in pursuit  of the evidence that can prove that this papyrus was written during the life and times of Jesus.\n------------------------------------------------------------\n\nLoving God with All Your Mind with JP Moreland, PhD:\nFaith Bible Church 2012 - JP Moreland speaks on the importance of the intellectual mind of the Christian.\n-------------------------------------------------------------\n\nReasons to Believe We Have a Reasonable Faith by William Lane Craig:\nWilliam Lane Craig at Watermark Community Church, gives his common arguments for God's existence: the contingency, cosmological, teleological, fine-tuning, moral argument, and evidence for the resurrection of Jesus.\nWatermark Community Church, Dallas, Texas, United States -- October 4, 2009\n-------------------------------------------------------------\n\nSaturday 6-16-12 - The Signs in the Heavens:\nSenior Pastor Mark Biltz\nNu 13:1-15:41 / Josh 2:1-24 / John 7-8\n\n\nWilliam Lane Craig on the Historical Jesus - Interview 2001:\nJohn Ankerberg Show (2001) - John Ankerberg interviews philosopher, theologian, and historian Dr. William Lane Craig on the historical Jesus of Nazareth. This interview was a response to ABC's Peter Jennings' 2001 episode &quot;The Search for Jesus.&quot;\n------------------------------------------------------------\n\nNote: Reasonable Faith is now managing the drcraigvideos YouTube channel! We invite you to comment on William Lane Craig's videos in the reasonablefaith.org forums at http://www.reasonablefaith.org/drcraigvideos\n-------------------------------------------------------------\n\nEarly Manuscript Evidence For The KJV:\nReview of the early manuscript evidence for the KJV Bible as researched by Dr. Jack Moorman and written about in his books.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:ba0793e2679f0fcf00aadb95f9fcf0cb044b2b96","amp;dn":"POtHS+-+Holy+Treasures+-+32+-+Eyewitness+sus+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba0793e2679f0fcf00aadb95f9fcf0cb044b2b96","infoHashBuffer":{"type":"Buffer","data":[186,7,147,226,103,159,15,207,0,170,219,149,249,252,240,203,4,75,43,150]},"announce":[],"urlList":[]}}