{"title":"Comfeo OpenSky 2.1 Mac","uid":7954295,"size":147834478,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:baecb3da2013c16ee4fb725217e5abfa5c29f0f0&amp;dn=Comfeo+OpenSky+2.1+Mac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Germelito82","files":1,"time":1356369987,"description":"Comfeo OpenSky 2.1 for Apple Mac Systems!\n\nFor the ones who are new... Comfeo is a relaxation app that loops the perfect sounds for you! It helps to meditate, sleep, focus and more!\n\nFirst a very merry Christmas to all of you!\nWe have been working for the last 8 months to bring this ultra filled update from 2.0 to 2.1!\n\nHeres a list;\n*better sound quality\n*faster loading times since all files will be externally loaded.\n*buttons have a dark blue highlight to see them better.\n*activation bar is now bigger in length and glows green.\n*layout changed to length so it fits new features.\n*mouse over (Hoover) have a new glossy shininess to the buttons.\n*improved stability.\n*faster process. (Up to 60 frames per second responsive)\n*introducing the menu for more options.\n\nNew;\n* Extra binaural beat (3 in total)\n* Digital clock\n* Alarm timer (reveals when digital clock is pressed)\n* Comfeo QuickSelect; 3 themes to select, Energy, Love &amp; Balance. These options play the perfect combination of sounds that are included in this app.\n* Kill Button; kills (stops/resets) all current sounds with a single button.\n* Tracks; 3 official Comfeo conducted themes from Comfeo 1.0 are now back.\n* Opens upevery time you start Comfeo (this is to bring people closer to our page)\n\nTop menu;\nSo there's this new huge options menu on the top of Comfeo.\n3 categories, from left to right; 3 Binaural buttons. 3 soundtracks. 3 options such as; 'about, offline radio &amp; digital clock. Last option is a red kill off button to reset and stop all current sounds.\n\nNew file formats... Its less yet bigger!\n\nPlease seed when our done and help me along to get Comfeo recognized into the world!\n","torrent":{"xt":"urn:btih:baecb3da2013c16ee4fb725217e5abfa5c29f0f0","amp;dn":"Comfeo+OpenSky+2.1+Mac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baecb3da2013c16ee4fb725217e5abfa5c29f0f0","infoHashBuffer":{"type":"Buffer","data":[186,236,179,218,32,19,193,110,228,251,114,82,23,229,171,250,92,41,240,240]},"announce":[],"urlList":[]}}