{"title":"Jetpack Joyride [PlayBook]","uid":7946168,"size":31855295,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:bc10b500f15278eb7b6126891aa9fa4c211999a1&amp;dn=Jetpack+Joyride+%5BPlayBook%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SSJASON","files":-1,"time":1356134058,"description":"Join Barry as he breaks in to a secret laboratory to commandeer the experimental jetpacks from the clutches of science evildoers. After lift-off, simply touch the screen to ascend and release to descend, raining bullets, bubbles, rainbows and lasers downwards as you fly towards higher and higher scores!\n\nYou'll start off with the legendary Machine Gun Jetpack to scatter the evil scientists, but throughout each game you'll collect coins and complete missions to earn cash and buy new gear in The Stash! Pick your favorite jetpack, snazzy outfit and stock up on items then get back out there for more action!\n\nKeen reflexes are your best weapon to avoid the obstacles in your path. These include lasers, electricity fields and even guided missiles, but thankfully this is a top secret lab - there will be even more goodies to pick up and help Barry along the way. Stay out of harm and you'll reach massive scores, unlock Achievements and beat your friends on the online leaderboards!\n\nGet a boost of speed and power using the Lil' Stomper, Profit Bird and Crazy Freaking Teleporter, just a selection of the vehicles pickups available - all playable with one touch controls. You can even splash out and upgrade the vehicles with coin magnets or shiny gold plating for that bonus style factor!\n\nStay alive, get funky and lose yourself in Jetpack Joyride. There's so much to see and do, all the time in the world and more than enough jetpacks! As always, Barry Steakfries will provide!","torrent":{"xt":"urn:btih:bc10b500f15278eb7b6126891aa9fa4c211999a1","amp;dn":"Jetpack+Joyride+%5BPlayBook%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc10b500f15278eb7b6126891aa9fa4c211999a1","infoHashBuffer":{"type":"Buffer","data":[188,16,181,0,241,82,120,235,123,97,38,137,26,169,250,76,33,25,153,161]},"announce":[],"urlList":[]}}