{"title":"Recruits Paramedics: Episode 10 Season 1","uid":7863899,"size":114438345,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be35f89ebe29c16ee89769e13ad5e610340b7fd4&amp;dn=Recruits+Paramedics%3A+Episode+10+Season+1+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"austvseries","files":1,"time":1354014093,"description":"At Paramedic College a class of new recruits are nearing their final assessments but before they can begin their on-road training there's one more hurdle to jump. The tough 'major trauma' assessment. They'll be treating a simulated patient.\n\nIf Reynir and Blake fail this test, they could be out of a job.\n\nJenna's been out of college for eight weeks with mentor Cleone. Today she's called to her first pedestrian collision. A car has struck a teenage-boy and, with pedestrian deaths accounting for about 13% of all road fatalities, Jenna's patient is lucky to be alive - although it's the injuries Jenna can't see that have her worried. Compassion is perhaps the biggest pre-requisite to becoming a Paramedic and after two months as a trainee, Rebecca's had plenty of time to reflect on this very human quality. When her father was dying of cancer, it was the compassion shown to him by a nurse that made Rebecca change careers and become a Paramedic. Now the mother of three is called to a job close to her heart when a 67 year-old cancer patient is in great pain.\n","torrent":{"xt":"urn:btih:be35f89ebe29c16ee89769e13ad5e610340b7fd4","amp;dn":"Recruits+Paramedics%3A+Episode+10+Season+1+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be35f89ebe29c16ee89769e13ad5e610340b7fd4","infoHashBuffer":{"type":"Buffer","data":[190,53,248,158,190,41,193,110,232,151,105,225,58,213,230,16,52,11,127,212]},"announce":[],"urlList":[]}}