{"title":"POtHS - Creation - 69 - Programming of Life","uid":8521799,"size":9837919970,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:beb15c90dc4252d6e408eedf421f4df4e184324e&amp;dn=POtHS+-+Creation+-+69+-+Programming+of+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1369932070,"description":"POtHS - Creation 69\n\n\n\n\n\nProgramming of Life\n\n\n\n\nPOtHS Comments on This one......... There is truth here for all ages and beliefs. If Darwin was wrong...........then the Schools have been intentionally lying to our Children. If the schools teach Darwinism which says there is NO CHRIST. Then they are of The Anti-Christ. Public Schools teaching books CHANGE EVERY YEAR. The Bible never changes. So where is truth??? In Evolution Theories??? If you believe in Evolution you are denying The Father, The Son and The Holy Spirit of the Praise They are entitled too for making everything you understand and can see and more than that, everything you don't understand and can't see. If you have never thanked the CREATOR for his Creation now is your chance to thank Him.\n\nPOtHS - Creation - 69 - Programming of Life\n\nDescription:\n\n'Intelligent Design The Most Credible Idea' A Lecture by Dr Stephen C Meyer:\nThe Philosophy of Religion section of the Tyndale Fellowship hosted a one-day Conference in Hughes Hall, University of Cambridge on Saturday 14th July, 2012. The full title of the Conference was 'Design in Nature? Scientific and Philosophical Perspectives'. This is the lecture given by Dr Stephen C Meyer at that event.\n--------------------------------------------------------------------------------------------------------------------\n\nJohn Sanford on Down - Not Up (Lecture on 2-4-2012 at Loma Linda University):\nJohn Sanford, from Cornell University, is the inventor of the &quot;gene gun&quot; among other ways to get foreign genes into cells. His studies into genetics led him to conclude that natural selection was unable to purify the genome, let alone create new complex genetic designs. He also concluded that large, slowly breeding animals like humans and elephants could not last for millions of years without direct Divine intervention, and he is thus a short-age creationist. He wrote a book called Genetic Entropy and the Mystery of the Genome (2005) explaining his reasoning.\n---------------------------------------------------------------------------------------------------------------------\n\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n           \n     \n:thankyou:    :thankyou:     Thank You JESUS  \n\n","torrent":{"xt":"urn:btih:beb15c90dc4252d6e408eedf421f4df4e184324e","amp;dn":"POtHS+-+Creation+-+69+-+Programming+of+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beb15c90dc4252d6e408eedf421f4df4e184324e","infoHashBuffer":{"type":"Buffer","data":[190,177,92,144,220,66,82,214,228,8,238,223,66,31,77,244,225,132,50,78]},"announce":[],"urlList":[]}}