{"title":"Decadent Divas [DvdRip].avi","uid":7923131,"size":1462104064,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:beba39403ec9ae817d5e20878062e37a731043e9&amp;dn=Decadent+Divas+%5BDvdRip%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1355517116,"description":"\nDecadent Divas [DvdRip].avi\n\n\n\nCast:\n\nCarla Cox, Jessie Volt, Rebecca More, Megan Coxxx, Syren Sexton, Jamie Barry, Holly Kiss\n\n\nDescription:\n\n&quot;Tanya Hyde is back! With gorgeous girls in tantalizing outfits, atmospheric scenery and extravagant fetish sex apparatus!\nThe opening scene see's stunningly beautiful Megan Coxxx laid out with her legs straddled wide as the gorgeous Rebecca More tastes her sweet juices before probing her pink pussy deep with a huge glass sex toy. Rebecca More soon gets her turn as a pearl string is plunged deep down inside her arse. Next they discover a stud totally restricted by his black latex outfit, revealing his pulsating cock which together they deep throat on before Megan Coxxx embarks a strap on fuck fest which Rebecca takes with satisfaction. There are no boundaries, only the pleasures of all things depraved!\nNext we see the beautiful Jessie Volt wearing nothing but red high heels being taken from a car boot by a male stud in a gimp mask. She is carried up to the examination room and given an anal inspection, soon they are joined by another stud wearing a rabbit's head; this is one freak show and Jessie sure knows unimaginable ways to get her fix of cock! dominatrix Holly Kiss gets her kicks as well-endowed Omar is chained up naked and blind folded in a deserted warehouse, whip in hand she takes full advantage and Omar does what is necessary in this twisted hardcore fetish fuck scene!\nSexy Syren Sexton interrupts two guys' playing cards in the pussy bar one wearing a pig's head, getting ignored by them she turns to the barman and demands a drink plus demands he sucks her arse which he is more than happy to oblige before pumping her holes hard on the pool table. Blonde Stunner Carla Cox wanders through a disused warehouse where she stumbles across three holes being filled with three pulsating cocks; she takes all three with pleasure before her legs are strapped and suspended in the air while each stud takes a turns plunging deep into Carla shapely ass before draining white cum cream all over her ass and face!\nThis is a truly dark &amp; twisted Decadent Divas ride of a film; gorgeous whores in latex galore. It will have you reaching for your cock in no time!\nThis is the only Holly Kiss video.&quot;\n\n\n\nResolution:   608x336\n\nDuration:     01:28:19 + 01:28:29\n\t\nSize:\t      1.36 GB\n\n\nScreens:\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=29444031620240602577.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=29444031620240602577.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=86374942918304207612.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=86374942918304207612.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=46910906432139095984.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=46910906432139095984.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=42587404553851830162.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=42587404553851830162.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:beba39403ec9ae817d5e20878062e37a731043e9","amp;dn":"Decadent+Divas+%5BDvdRip%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beba39403ec9ae817d5e20878062e37a731043e9","infoHashBuffer":{"type":"Buffer","data":[190,186,57,64,62,201,174,129,125,94,32,135,128,98,227,122,115,16,67,233]},"announce":[],"urlList":[]}}