{"title":"Trading Democracy for Corporate Rule","uid":7863360,"size":312540869,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf89305a6e2f17ba5c3901327b9071693cfd4395&amp;dn=Trading+Democracy+for+Corporate+Rule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wearehidden","files":1,"time":1353998758,"description":"ou, Me, and the SPP: Trading Democracy for Corporate Rule is a feature length documentary which exposes the latest manifestation of a corporatist agenda that is undermining the democratic authority of the citizens of North America.\n\nTwo processes, the Security Prosperity Partnership (SPP) and the Trade Investment Labour Mobility Agreement (TILMA) are rapidly eroding and eliminating standards, civil liberties, regulatory systems and institutions put in place over generations through the democratic process. Proponents of the SPP and TILMA say that they are needed to keep trade flowing, opponents say these agreements not only undermine the democratic authority of citizens they threaten the sovereignty of the three nations through the integration of military, security structures and regulatory regimes.\n\nEven though the SPP (Security Prosperity Partnership) is officially finished, this film provides an excellent background to this agenda and helps to expose how quickly and easily the corporate elite and their political cronies will abandon democratic principles to consolidate their own power, control and authority at the expense of citizens rights.\n\nduration : 1:30:14","torrent":{"xt":"urn:btih:bf89305a6e2f17ba5c3901327b9071693cfd4395","amp;dn":"Trading+Democracy+for+Corporate+Rule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf89305a6e2f17ba5c3901327b9071693cfd4395","infoHashBuffer":{"type":"Buffer","data":[191,137,48,90,110,47,23,186,92,57,1,50,123,144,113,105,60,253,67,149]},"announce":[],"urlList":[]}}