{"title":"The Ed Show 12-6-12.mp4","uid":7899722,"size":184411956,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c028c7ed74a8f1c6245583ad6b8466bc4493f16b&amp;dn=The+Ed+Show+12-6-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1354934558,"description":"The Ed Show; December 6, 2012.\n\n The re-election of Barack Obama sent the Republican Party into total disarray. Now, one of the most powerful leaders of the Tea Party is cutting and running. Sen. Jim DeMint abruptly resigned effective January 1.\n\nEd had on Eugene Robinson (MSNBC Analyst and Associate Editor and Pulitzer Prize winning Columnist for the Washington Post), and Rep. Jim Clyburn (D-SC) on the latest setback for the conservative agenda.\n\nAre Republicans close to caving on taxes? Ed asked Rep. Chris Van Hollen (D-MD) about John Boehner's latest concession on the fiscal cliff.\n\nPresident Obama is taking his fiscal cliff plan to the people. Will Republicans buckle under public pressure? Democratic Strategist Donna Gentile O'Donnell and Michael Eric Dyson (Professor of Sociology at Georgetown university and author of &quot;Can You Hear Me Now?&quot;) weighed in.\n\nAdd New Jersey and South Dakota to the list of states where Republican governors are still fighting Obamacare. Ed asked Howard Dean (former Democratic National Committee Chairman and former presidential candidate and the Founder of Democracy for America), what it means for the people.\n\nAmerica's zaniest congressman took a stand on a cause close to his heart.\n\nAnd in the Big Finish, Apple CEO Tim Cook announced plans to produce some of their computers here in the U.S. Will the move inspire other companies to &quot;think different&quot; about American manufacturing? E.J. Dionne (Senior Fellow at The Brookings Institution and Washington Post columnist), had reaction and analysis.","torrent":{"xt":"urn:btih:c028c7ed74a8f1c6245583ad6b8466bc4493f16b","amp;dn":"The+Ed+Show+12-6-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c028c7ed74a8f1c6245583ad6b8466bc4493f16b","infoHashBuffer":{"type":"Buffer","data":[192,40,199,237,116,168,241,198,36,85,131,173,107,132,102,188,68,147,241,107]},"announce":[],"urlList":[]}}