{"title":"Slutty.And.Sluttier.18.x264-PORNOLATiON","uid":7901600,"size":1550832047,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c19992ff2ac20ff73a0ec3d4c6ceb2b21b557d86&amp;dn=Slutty.And.Sluttier.18.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":1,"time":1354977537,"description":"Slutty.And.Sluttier.18.x264-PORNOLATiON\n\nStarring: Anissa Kate, Annika Albrite, Aria Salazar, Manuel Ferrara, Riley Reid\n\nWhat Exactly Makes a woman a &quot;Slut&quot;? Prudes and moralists are proud to offer their own definitions, but director and legendary porn stud Manuel Ferrara considers the term the ultimate sexual compliment. He's on a mission to find the most dedicated sluts in the world! Manuel's special quest continues with &quot;Slutty and Sluttier 18,&quot; a non-stop show of debauchery featuring four of the most sexually liberated beauties in XXX video. All-natural blonde bombshell Anikka Albrite loves it rough. The big-assed sex queen joins the director for an intimate session of fierce deep-throating, face slapping, choking and relentless pussy pounding that leaves the sensuous bitch thoroughly ravaged. Next, slender, exotic teen Aria Salazar rides Manuel's enormous cock until it explodes, giving the stunning, young Aria a messy mouthful of creamy goodness. Raven-haired seductress Anissa Kate, dolled up in lacy lingerie, flaunts her plump, soft jugs and fetching behind. Manuel passionately bangs the sultry, tanned bitch's sweet cunt and tight bunghole, lets her savor the taste of her own ass and sprays cum on Anissa's face and boobs. Lastly, petite brunette Riley Reid teases and preens for the camera; her adorable personality, round tush and perfect, small titties drive the director crazy with lust. By the time this cock-hungry cutie is finished, her tiny twat has been pumped full of throbbing, uncut meat. Who is the sluttiest in &quot;Slutty And Sluttier 18&quot;? Manuel leaves that for you to decide.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=zvmrp41wtlf8x0mrue5h.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=zvmrp41wtlf8x0mrue5h.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=hqfsmf7q7j10kgikhzgi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=hqfsmf7q7j10kgikhzgi.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c19992ff2ac20ff73a0ec3d4c6ceb2b21b557d86","amp;dn":"Slutty.And.Sluttier.18.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c19992ff2ac20ff73a0ec3d4c6ceb2b21b557d86","infoHashBuffer":{"type":"Buffer","data":[193,153,146,255,42,194,15,247,58,14,195,212,198,206,178,178,27,85,125,134]},"announce":[],"urlList":[]}}