{"title":"CG Cookie - 2010 Blender Training Series","uid":7836363,"size":11694286857,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c39ab06b5209e3c7f04f7c9fb0a8d972ca7e939e&amp;dn=CG+Cookie+-+2010+Blender+Training+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"manshan","files":125,"time":1353197436,"description":"With the introduction of Blender 2.5-2.6, we are very excited to be one of the first to offer a complete, introductory, video training bundle to the Blender community. Not only will this bundle make the transition from previous versions of Blender to Blender 2.5 (Eventually 2.6) easier, but it also will give the new user the boost they need to get up to speed quickly.\n\nWith the dramatic changes now in Blender 2.5 builds, everything from the beautiful new interface to custom key maps, there is a lot of information to wrap your head around. Having treaded the waters of Blender training for the past two years, we at CG Cookie strive to give you the very best. Instructor Jonathan Williamson will introduce you to this years Blender and walk you through how to use it in our training series.\n\nWith so much ground to cover, we have decided to break up the training into two series in order to allow more focus on the individual sections. This also lets us provide both the beginner and advanced users with something to play with. For those of you looking to freshen up on some character modeling, texturing or animation, we suggest you go for the latter of the two series. Or if you are just starting out and need some help with the ropes of Blender then you might find it beneficial to shoot for the whole bundle. Either way, the training is structured and presented in such as to provide a little bit for everyone, regardless of your skill level.\n\nThe Videos are categorized in folders, and the source materials are in the Source folder.\n\nEnjoy.","torrent":{"xt":"urn:btih:c39ab06b5209e3c7f04f7c9fb0a8d972ca7e939e","amp;dn":"CG+Cookie+-+2010+Blender+Training+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c39ab06b5209e3c7f04f7c9fb0a8d972ca7e939e","infoHashBuffer":{"type":"Buffer","data":[195,154,176,107,82,9,227,199,240,79,124,159,176,168,217,114,202,126,147,158]},"announce":[],"urlList":[]}}