{"title":"KIRTU SAATH KHANIYA EP 10 THE GAME An Adult Comic by {(ACF)}","uid":7916196,"size":8835050,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:c433649c5a52c7ae3350a5bba21a26550e9d9216&amp;dn=KIRTU+SAATH+KHANIYA+EP+10+THE+GAME+An+Adult+Comic+by+%7B%28ACF%29%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"manam69","files":33,"time":1355375779,"description":"KIRTU SAATH KHANIYA EP 10 THE GAME An Adult Comic by {(ACF)}\n\n\nAsma returns from her turn at playing the &quot;game&quot;, but her experience performing in porn films was not nearly as pleasant as Aditya's task. She won't even talk about it! In fact, Asma is relieved when the next set of instructions is slid under the door, and it's Delisha's turn to roll the dice. As you recall, Delisha's original tale detailed how she went from virgin to sexual adventuress during the course of one schoolgirl sleepover. Now she's been invited to another get together by the game master but this one's a masquerade ball.\n\nWhen she goes to the shop to pick up the costume that's already been reserved, she discovers they've mistakenly selected a man's mask. But that's only the beginning of insane evening in store for Delisha. The first thing she sees at the party is a bizarre sex ritual led by a masked man in a red cloak. And it only gets weirder! As she makes her way through the mansion, Delisha realizes that the party is actually an orgy. Her instructions from the game master were not specific, so Delisha has but one option, role up her sleeves and get her hands dirty until she can figure out why she's there. The only problem? She's been warned that her life is in danger, and the mysterious man in the red cloak has every intention of following through on that threat!!!\n\nFind out what happens when Delisha makes the mistake of trying to be the life of this kinky costume party in the new Saath Kahaniya episode &quot;The Game.&quot;\n","torrent":{"xt":"urn:btih:c433649c5a52c7ae3350a5bba21a26550e9d9216","amp;dn":"KIRTU+SAATH+KHANIYA+EP+10+THE+GAME+An+Adult+Comic+by+%7B%28ACF%29%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c433649c5a52c7ae3350a5bba21a26550e9d9216","infoHashBuffer":{"type":"Buffer","data":[196,51,100,156,90,82,199,174,51,80,165,187,162,26,38,85,14,157,146,22]},"announce":[],"urlList":[]}}