{"title":"Torchlight.II.Update.8-RELOADED","uid":7840841,"size":38159501,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c460b6998465242aec96ddeea3732185d3b12e5d&amp;dn=Torchlight.II.Update.8-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gh0stNet","files":2,"time":1353336097,"description":"Torchlight II Update 8-RELOADED\n\nGeneral Information\n\n11/2012: RELEASE.DATE\nPROTECTION: Steam:\nGAME.TYPE: Diablo Clone\n\nRelease Notes\n\nNote: We usually do updates with everything included, but for this one you need our Update 7 installed first. This is a very minor update, and no data files have changed\n\nUpdated\n\n* This is a small hotfix patch to address an issue with proximity-based effects from set item bonuses that could cause extreme frame rate degradation\n\nDescription\n\nThe award-winning action RPG is back, bigger and better than ever! Torchlight II takes you back into the quirky, fast-paced world of bloodthirsty monsters, bountiful treasures, and sinister secrets - and, once again, the fate of the world is in your hands! Torchlight II captures all the flavor and excitement of the original game while expanding the world and adding the features players wanted most including online and LAN co-op multiplayer. Torchlight II is fast, fun and filled to the brim with action and loot. Adventure solo or online with your friends!\n\nKey Features\nMultiplayer\n- Play co-op with your friends via LAN or over the Internet for free. No subscriptions, no item sales. Our new matchmaking service lets you find friends, start new games, and join existing games. And, as always, you can play single-player offline as well.\nCustomizable Characters\n- Players will create and customize a character from one of four brand new classes. Each class can be played as either male or female, with customized cosmetic features and looks to make each individual character stand out. All new skills and loot give loads of opportunity for unique character builds.\nModdability\n- TorchED, the Torchlight II editor, will give players the ability to create their own mods, adding even more content to the world. Have your friends download the same mod and play together. TorchED will be available as a separate download very shortly after launch.\nNew User Interface\n- Torchlight II boasts a new and improved user interface, designed to be easier than ever for new players to pick up and play. This intuitive interface ensures you can focus on playing the game the way you want to.\nOpen World\n- We're not only in the town of Torchlight anymore! Explore vast overland areas and multiple hub towns, fight through rain, snow, day and night. Our level randomization ensures new layouts, paths, loot, and monsters every time you play.\nNew Game Plus\n- In New Game Plus, the game's not over until you say it is. Once you've beaten Torchlight II's primary campaign, you can start again with the same character for a significantly greater challenge. You'll keep all of the skills, gold, and gear you worked so hard for! Pets &amp; Fishing - These popular features make their return in Torchlight II in improved form. More choices, better effects, and your pet will still make the run to town to sell your loot so you don't have to.\n\nInstallation\n\n1. Unrar into your installation directory, overwriting files when prompted Our Update 7 release needs to be installed for this\n2. Play the game\n3. Support the software developers. If you like this game, BUY IT! ","torrent":{"xt":"urn:btih:c460b6998465242aec96ddeea3732185d3b12e5d","amp;dn":"Torchlight.II.Update.8-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c460b6998465242aec96ddeea3732185d3b12e5d","infoHashBuffer":{"type":"Buffer","data":[196,96,182,153,132,101,36,42,236,150,221,238,163,115,33,133,211,177,46,93]},"announce":[],"urlList":[]}}