{"title":"Aliens in America (gnv64)","uid":7816986,"size":15960587,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4e1e820e175a1f7b5288b9f5b0209cb869575a9&amp;dn=Aliens+in+America+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":-1,"time":1352698269,"description":"Aliens in America: Conspiracy Cultures from Outerspace to Cyberspace \nby Jodi Dean\nCornell University Press | March 1998 | 256 Pages | ISBN: 0801484685 | PDF | 15.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Aliens-America-Conspiracy-Outerspace-Cyberspace/dp/0801484685&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Aliens-America-Conspiracy-Outerspace-Cyberspace/dp/0801484685&lt;/a&gt;\n\nIn a provocative analysis of public culture and popular concerns, Jodi Dean examines how serious UFO-logists and their pop-culture counterparts tap into fears, phobias, and conspiracy theories with a deep past and a vivid present in American society. Aliens, the author shows, provide cultural icons through which to access the new conditions of democratic politics at the millennium. Because of the technological complexity of our age, political choices and decisions have become virtually meaningless, practically impossible. \nHow do we judge what is real, believable, trustworthy, or authoritative? When the truth is out there, but we can trust no one, Dean argues, paranoia is indeed the most sensible response. Aliens have invaded the United States. No longer confined to science fiction and tabloids, aliens appear in the New York Times, Washington Post, and Wall Street Journal, at candy counters (in chocolate-covered flying saucers and Martian melon-flavored lollipops), and on Internet web sites. Aliens are at the center of a faculty battle at Harvard. They have been used to market AT&amp;T cellular phones, Milky Way candy bars, Kodak film, Diet Coke, Stove-Top Stuffing, skateboard accessories, and abduction insurance. A Gallup poll reports that 27 percent of Americans believe space aliens have visited Earth. A Time/CNN poll finds 80 percent of its respondents believe the U.S. government is covering up knowledge of the existence of aliens. \nWhat does the widespread American belief in extraterrestrials say about the public sphere? \nHow common are our assumptions about what is real? \nIs there any such thing as &quot;common&quot; sense? Aliens, the author shows, provide cultural icons through which to access the new conditions of democratic politics at the millennium. Because of the technological complexity of our age, political choices and decisions have become virtually meaningless, practically impossible. \nHow do we judge what is real, believable, trustworthy, or authoritative? \nWhen the truth is out there, but we can trust no one, Dean argues, paranoia is indeed the most sensible response.","torrent":{"xt":"urn:btih:c4e1e820e175a1f7b5288b9f5b0209cb869575a9","amp;dn":"Aliens+in+America+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e1e820e175a1f7b5288b9f5b0209cb869575a9","infoHashBuffer":{"type":"Buffer","data":[196,225,232,32,225,117,161,247,181,40,139,159,91,2,9,203,134,149,117,169]},"announce":[],"urlList":[]}}