{"title":"Momo e no Tegami [BD-rip 1920x1080 x264 TRUE HD].mkv","uid":7841419,"size":10598775038,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c57939b34c046787b35d11322f7367e88ef1c0f4&amp;dn=Momo+e+no+Tegami+%5BBD-rip+1920x1080+x264+TRUE+HD%5D.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"anoku","files":1,"time":1353347260,"description":"Momo e no Tegami is a 2011 Japanese anime drama film. The film is directed by Hiroyuki Okiura, and is produced by the animation studio Production I.G. This film follows the 11-year-old Momo, who has a hard time coping with the sudden changes after her father's death.\n\nSynopsis : \n\nMomo Miyaura is a shy and imaginative 11-year-old girl who is suffering because of her father's recent death and the resultant extreme changes in her life. From the big city of Tokyo, Momo's family moves to her mother's childhood home, a remote island named Shio. Momo does not adapt well to her new surroundings. Her father left her an unfinished letter containing only two words, &quot;Dear Momo&quot;. As she tries to make sense of these two words and guess what her father was trying to tell her, some strange incidents occur on the island, which is otherwise tranquil. People's orchards are ransacked by an unknown person, and some of their prized belongings start to go missing. Momo also starts to hear strange sounds coming from the attic in her house.\n \nMomo's mother refuses to believe Momo about the strange sounds from the attic, so Momo herself embarks on an adventure to discover the source of these disturbances. During her investigations, Momo meets up with Kawa, Mame and leader Iwa, a group of imps, each of which have a different personality. In addition, Momo discovers that the mysterious two-word letter from her father is connected to all the strange occurrences, and to her arrival at Shio.\n","torrent":{"xt":"urn:btih:c57939b34c046787b35d11322f7367e88ef1c0f4","amp;dn":"Momo+e+no+Tegami+%5BBD-rip+1920x1080+x264+TRUE+HD%5D.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c57939b34c046787b35d11322f7367e88ef1c0f4","infoHashBuffer":{"type":"Buffer","data":[197,121,57,179,76,4,103,135,179,93,17,50,47,115,103,232,142,241,192,244]},"announce":[],"urlList":[]}}