{"title":"Springfield Rifle (Western) {Cooper, Chaney} [1952]","uid":7825630,"size":761392656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c62594284fbcc0f199bf5b8ddff47c01a3082865&amp;dn=Springfield+Rifle+%28Western%29+%7BCooper%2C+Chaney%7D+%5B1952%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"alien99","files":-1,"time":1352920647,"description":"couldn't find a working copy of this here so uploaded the only copy i have very watchable for its age maybe a vhs rip.   \n\n\nStoryline\n\nMajor Lex Kearney, dishonorably discharged from the army for cowardice in battle, has actually volunteered to go undercover to try to prevent raids against shipments of horses desperately needed for the Union war effort. Falling in with the gang of jayhawkers and Confederate soldiers who have been conducting the raids, he gradually gains their trust and is put in a position where he can discover who has been giving them secret information revealing the routes of the horse shipments. \n\nUser review\n\nThis is an enjoyable and underrated Western, but one aspect of it is particularly enjoyable and particularly underrated: the magnificent cinematography.\nThe film is underrated generally. Disgracefully, it doesn't even get a single star in Halliwell's Film Guide - it should have had at least one for the cinematography alone! Equally disgracefully, Edwin DuPar doesn't even get a mention in Halliwell's Who's Who in Films (at least, not in my edition).\nThe cast of 'Springfield Rifle' is very good, the action scenes effective, and the plot works well, by and large. Well worth watching.\n","torrent":{"xt":"urn:btih:c62594284fbcc0f199bf5b8ddff47c01a3082865","amp;dn":"Springfield+Rifle+%28Western%29+%7BCooper%2C+Chaney%7D+%5B1952%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c62594284fbcc0f199bf5b8ddff47c01a3082865","infoHashBuffer":{"type":"Buffer","data":[198,37,148,40,79,188,192,241,153,191,91,141,223,244,124,1,163,8,40,101]},"announce":[],"urlList":[]}}