{"title":"BlackSite Area 51-=AviaRa=-","uid":7944310,"size":10269013365,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c6c08360f9ad7468c53b49b86f4373287003206c&amp;dn=BlackSite+Area+51-%3DAviaRa%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aviara","files":-1,"time":1356090512,"description":"BlackSite: Area 51 features standard first-person shooter gameplay. It uses a regenerating health system; additionally the player's character can absorb relatively large amounts of gunfire before dying. The game features 6 different weapons, however only two weapons can be carried at the same time. The game also features the ability to use grenades and melee attacks. The game's main weapon, the M4 carbine, has a reflex sight that can be aimed through for zooming in on distant targets. The game does not feature the ability to lean around corners.[3]\n\nOne of the main features of the game is squad tactics. For almost the entire game, the player will have a team of two A.I. controlled squadmates accompanying them. Squadmates can be ordered to move on a location, concentrate their fire on a specific enemy, man a mounted turret, or set explosive charges on certain items. Squad commands are given with a single button; the commands are context sensitive based on what the player points the cursor at. Squadmates cannot be killed, and will only be knocked out for a brief period after taking a certain amount of damage.\n\nThe game also features a morale system, where squad morale increases as the player kills enemies or scores headshots, and decreases as the player takes damage or as squadmates are injured or incapacitated. At high morale, squadmates fight much more effectively and can survive more damage, while at low morale they contribute much less to firefights, and are incapacitated much more easily.\n\nThe game also features several vehicle sections, where the player must drive a civilian van or military Humvee cross-country to reach a location, while dealing with enemy attacks. The player can exit the vehicle at any time to collect items, investigate buildings, or man the humvee's mounted machinegun.\n\nThe game features 6 different weapons that the player can use. 4 are real-world firearms, while 2 are fictional weapons based on alien technology.\nMultiplayer\n\nThe multiplayer features modes such as Deathmatch, Team Deathmatch, Capture the flag, Siege,and Human VS. Reborn. The Siege and Human VS. Reborn are different and unique from other games. It allows the teams to attempt to control each of the level's territories while trying to capture one another. The Deathmatch mode, as well as the rest of the online portion of the game has a maximum number of 10 players. There is no local multiplayer.\n\nMultiplayer on PC could only be played after setting up an in-game account but with publisher Midway now out of business multiplayer accounts cannot be created for the PC edition of the game, rendering it unplayable online.\n\n\nHow to install:\n\n1.Run BlackSite Area 51-=AviaRa=-.exe\n2.Install game\n3.Play from desktop shortcut\n\n\nMore info and support here:\n &lt;a href=&quot;\nhttp://www.aviara.ro/forum/index.php?topic=15001.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.aviara.ro/forum/index.php?topic=15001.0&lt;/a&gt;\n\n\nWe are looking for nice coders\nWe are looking for seeders\nWe are looking for people who could help us\nWe are looking for Games Helpers\nwe are looking for peope with seedbox\n\n\nIf you think you are one of those contact us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;37545859435654437750565a5245444d585952194558&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nHow To Get Your Maxspeed (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each\nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews. \n\nCheck my user for more games: \n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/aviara/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/aviara/&lt;/a&gt;\n\nAviaRa Team\n\n\n\n                                                      \n","torrent":{"xt":"urn:btih:c6c08360f9ad7468c53b49b86f4373287003206c","amp;dn":"BlackSite+Area+51-%3DAviaRa%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6c08360f9ad7468c53b49b86f4373287003206c","infoHashBuffer":{"type":"Buffer","data":[198,192,131,96,249,173,116,104,197,59,73,184,111,67,115,40,112,3,32,108]},"announce":[],"urlList":[]}}