{"title":"The Ed Show 11-27-12.mp4","uid":7869664,"size":194876896,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c7f4f5f132b720abac15443b708a6065f9c47dd3&amp;dn=The+Ed+Show+11-27-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1354163040,"description":"The Ed Show; November 27, 2012.\n\nEd welcomed Rep.Chris Van Hollen (D- MD) andRep. Jan Schakowsky (D-IL) for the latest on the &quot;fiscal cliff.&quot;\n\nMeantime, reports out of Tuesday's labor meeting with the president looks very good for progressives.\n\nEd had the details and reaction from James Hoffa (President of the International Brotherhood of Teamsters).\n\nThen, Senators John McCain and Lindsey Graham said they have even more questions after U.N. Ambassador Susan Rice tried to clear the air on Benghazi.\n\nEd had analysis on Tuesday's meeting from Joan Walsh (Salon's Editor at Large, and author of &quot;What's The Matter With White People? Why We Long For A Golden Age That Never Was&quot;)\n\nSenate Majority Leader Harry Reid moved towards the &quot;nuclear option&quot; to stop Republican obstruction. Steve Benan (MSNBC Contributor, writer, The Maddow Blog), joined Ed on the filibuster showdown.\n\nHe dared to speak the truth on Fox News, saying the cable channel &quot;is operating as a wing of the Republican Party.&quot; Now Fox News is going after Tom Ricks. Ed had the details on that.\n\nAnd in the BIG Finish, Black Friday shoppers busted another Repbulican myth about the Obama economy. David Cay Johnston (columnist for Reuters, Pulitzer Prize winner and author of &quot;Perfectly Legal&quot; and &quot;Free Lunch&quot;), set the record straight!","torrent":{"xt":"urn:btih:c7f4f5f132b720abac15443b708a6065f9c47dd3","amp;dn":"The+Ed+Show+11-27-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f4f5f132b720abac15443b708a6065f9c47dd3","infoHashBuffer":{"type":"Buffer","data":[199,244,245,241,50,183,32,171,172,21,68,59,112,138,96,101,249,196,125,211]},"announce":[],"urlList":[]}}