{"title":"POtHS - Apostasy The Great Falling Away Vol 17 - Gods of the New","uid":7883810,"size":7949704977,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ca1982a0658a21ca3ba69af821b5f7728c0cc6dc&amp;dn=POtHS+-+Apostasy+The+Great+Falling+Away+Vol+17+-+Gods+of+the+New&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":91,"time":1354561241,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\n\nPOtHS - Apostasy The Great Falling Away Vol 17 - Gods of the New Age End Time Delusion\n\n\n\nPOtHS says: The Falling away is running at Full Speed.\n\n\nGods of the New Age:\nReligion Exposed Brainwashing, Mind Control, Yoga Meditation, and  Psychotherapy 1984. The Best Video on the New Age Movement ever made. An eye-opening film of the Yoga Meditation, Eastern Mysticism, PsychologiaI Therapy, Self-Help, Mind Control and much more... Expores the eerie world of ego-maniacal gurus and their western counterpats, New Agers. The definitive work. Explores its birth, its invasion, and its effect on western society. It explores the pagan roots of eastern mysticism, meditation, yoga, and more. An eye-opening expose of the New Age movement.\n\nShows how it was conceived in the early 1960's at a planning session by Hindu gurus in India as a means of converting Americans to Eastern mysticism. The seemingly innocuous devices used range from Yoga meditation to a belief in reincarnation. We are given an extraordinary inside glimpse into cult mentality and mindless obedience, and we see how an outright attack against traditional American beliefs has been successfully launched, not only from Hindu missionaries, but from unsuspecting Americans who have accepted the surface manifestations of this religion as trendy and fun. The film covers the chilling parallels between the belief structure in today's New Age subculture and that in Hitler's Third Reich two generations ago. 1 hour 43 minutes.'\n\nWith explosive facts, it explains why yoga, meditation, psychological therapy and self-help are turning millions to a pagan worldview. This film explores the eerie world of ego-maniacal gurus and their western counterpats, New Agers. In a series of exclusive, candid interviews, we share the thoughts of &quot;master&quot; and witness the blind devotion and mindless obedience of &quot;disciple.&quot; Gods of the New Age takes us from a clandestine, early sixties planning meeting held by Indian gurus to today's dignified U.S corridors, American schoolrooms and Christian churches. The film uncovers the chilling parallels between today's Western culture. and the similar climate that bred Hitler's Third Reich a generation ago! &quot;This is the most powerful Christian documentary I have ever seen!&quot; --Rabi Maharaj, author of The Death of a Guru THE NEW AGE MOVEMENT, YOGA, DEVIL WORSHIP: THE RISE OF SATANISM and EVOLUTION\n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n\n","torrent":{"xt":"urn:btih:ca1982a0658a21ca3ba69af821b5f7728c0cc6dc","amp;dn":"POtHS+-+Apostasy+The+Great+Falling+Away+Vol+17+-+Gods+of+the+New","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca1982a0658a21ca3ba69af821b5f7728c0cc6dc","infoHashBuffer":{"type":"Buffer","data":[202,25,130,160,101,138,33,202,59,166,154,248,33,181,247,114,140,12,198,220]},"announce":[],"urlList":[]}}