{"title":"[Femaleagent / Casting XXX] Tess","uid":8589938,"size":407410268,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cb7903709cc09ad3db8bbd62a301f59e22ac0be4&amp;dn=%5BFemaleagent+%2F+Casting+XXX%5D+Tess&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1371613301,"description":"[Femaleagent / Casting XXX] Tess\n\nTess (35 mins). Tess is a beautiful 21 year old who really stoked my sexual fires, as soon as I saw her I knew that I had to have her, she was not leaving this casting room until I had drank from her sweetest of juices and she from mine. She is a student and was looking for work in the fashion industry. I love the challenge of turning them from their fashion ideals and onto porn before they are naked and squirming on my couch and giving me the pleasure I desire. Money makes the world turn round and these girls are willing to do almost anything to obtain it. Tess is no different from the rest, and though she laughed at first about doing porn it was a few more minutes of sweet talking before she was starting to undress in front of me. She was incredibly shy in front of the cameras and it took me several attempts to get her to relax and kiss me properly. But her shyness melted away as soon as slipped some fingers into her pussy and she ended up having an amazingly intense orgasm, bucking and writhing on the end of my talented fingers. I then got her to taste my pussy before sucking my tits as I came with the help of a vibrator. She turned from shy woman to filthy porn star in less than an hour and I loved her for it. But I'm afraid she'll get no work from this fake agency.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=p5nat7wpkkgpvatit57o.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=p5nat7wpkkgpvatit57o.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:cb7903709cc09ad3db8bbd62a301f59e22ac0be4","amp;dn":"%5BFemaleagent+%2F+Casting+XXX%5D+Tess","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb7903709cc09ad3db8bbd62a301f59e22ac0be4","infoHashBuffer":{"type":"Buffer","data":[203,121,3,112,156,192,154,211,219,139,189,98,163,1,245,158,34,172,11,228]},"announce":[],"urlList":[]}}