{"title":"An Evening with Hypnotica - Vol. 1","uid":7912960,"size":4409241647,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ce0612f90bf6274575bbf1eda52cbb1b816f5235&amp;dn=An+Evening+with+Hypnotica+-+Vol.+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":7,"time":1355269321,"description":"EveningWithHypnotica.com Presents:\n\nHypnotica is known as the &quot;Inner Game Guru&quot; and one of the Godfathers of the Seduction Community. He is discussed in Neil Strauss' Best Selling Book &quot;The Game&quot; and is credited for a large part of Neil's personal transformation. He is also a featured lecturer in David DeAngelo's &quot;Double Your Dating&quot; Advanced Series, Mastery Series, Power Sexuality, and Body Language Program.\n\nIn this exciting 6 DVD series Hypnotica brings to the table his vast knowledge of personal transformation and his 15+ years of experience working with and seducing exotic dancers to help you become a more attractive and confident man.\n\nThis is the only program of its kind to be filmed live in a working strip club.\n\nInside you'll discover:\n- Hypnotica's &quot;Super-Sexual Salesman&quot; principle\n- How to use language to design and program your own emotional states\n- Why being a man who can lead is so important when being with women\n- How to lead without being pushy\n- How to respond to a woman's tests so you become more attractive in her eyes\n- How to develop an attractive voice tonality\n- How women size a man up and what to do in the first 30 seconds of meeting a woman so you don't end up in the &quot;friend zone&quot;\n- What women really respond to when a man approaches her\n- How to flirt\n- What to say and when to quickly and easily turn a conversation with a woman sexual\n- How to immediately intrigue a woman with your sexual knowledge\n- And much more...\n\nWhether you're a beginning seducer or a very experienced one, this program is guaranteed to help you improve your &quot;game&quot;.","torrent":{"xt":"urn:btih:ce0612f90bf6274575bbf1eda52cbb1b816f5235","amp;dn":"An+Evening+with+Hypnotica+-+Vol.+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce0612f90bf6274575bbf1eda52cbb1b816f5235","infoHashBuffer":{"type":"Buffer","data":[206,6,18,249,11,246,39,69,117,187,241,237,165,44,187,27,129,111,82,53]},"announce":[],"urlList":[]}}