{"title":"Frank Wess &amp; Johnny Coles - 2012 - Two At The Top FLAC","uid":8663682,"size":853169426,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ce9cc76f73fa9442e64fd51425d3ff0a8c121dac&amp;dn=Frank+Wess+%26amp%3B+Johnny+Coles+-+2012+-+Two+At+The+Top+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eika256","files":-1,"time":1373364136,"description":"Frank Wess &amp; Johnny Coles - 2012 - Two At The Top\n\nCollectors have eagerly anticipated the reissue of Uptown's jazz LPs from the 1980s, as they inevitably add valuable material from the original sessions, period photos, and expanded liner notes. Long one of Wess' favorite records as a leader, Two at the Top is one of the label's finest releases, a session pairing Frank Wess and the unjustly neglected Johnny Coles, accompanied by a potent rhythm section consisting of pianist Kenny Barron, bassist Reggie Johnson, and drummer Kenny Washington. Don Sickler contributed the superb arrangements, with the session focusing primarily on songs by jazz greats who came of age between the '40s and early '60s: Bud Powell, Tadd Dameron, Gigi Gryce, Kenny Dorham, and Benny Golson. Coles is afire in the brisk setting of Dorham's &quot;Whistle Stop,&quot; with Barron's intricate solo immediately following him. Powell's &quot;Celia&quot; has tended to be overlooked because the pianist wrote so many memorable songs, but the band makes the most of this hidden gem, a sauntering performance showcasing Barron in bop mode. Wess is heard on alto sax in Gryce's &quot;Nica's Tempo,&quot; taking charge with a spirited, driving solo. There's a tense Afro-Cuban undercurrent suggestive of Dizzy Gillespie in the introduction to Gryce's &quot;Minority,&quot; long a jam session favorite, in which Coles and Wess (on alto sax) play with gusto. Dameron's &quot;A Blue Time&quot; is another under-appreciated gem by a prolific composer, where the co-leaders blend perfectly in the ensembles and add sparkling solos as well. The sole standard is a subdued, emotional scoring of Harold Arlen's &quot;Ill Wind.&quot; There are five bonus tracks from the 1983 sessions, all first takes of songs featured on the original record, none of which are flawed.\nThe entire hour of music on disc two is previously unissued, coming from a well-preserved 1988 radio broadcast recorded live at Yoshi's in Oakland, California. Wess and Coles are joined by pianist Smith Dobson, bassist Larry Grenadier, and drummer Donald &quot;Duck&quot; Bailey. Since it is a live gig, there is plenty of time for extended improvisations, including a blistering take of Sam Jones' &quot;One for Amos&quot; that showcases Wess' strong chops on flute, followed by Coles' expressive trumpet, buoyed by the in-the-pocket rhythm section. Coles sits out Wess' &quot;If You Can't Call, Don't Come,&quot; a slow ballad with a bittersweet air which the composer conveys effectively on tenor sax. The extended workout of &quot;Minority&quot; is another treasure from the broadcast, as is Buddy Montgomery's less well-known &quot;Blues for David,&quot; a rollicking finale to this valuable 1988 Yoshi's set, and a terrific bonus to the expanded reissue of Two at the Top. (AllMusic)\n\nTrack list:\nCD 1\n01 - Whistle Stop\n02 - Morning Star\n03 - Celia\n04 - Nica's Tempo (A.K.A. Playhouse)\n05 - Minority (A.K.A. Conversation Piece)\n06 - Ill Wind\n07 - Stablemates\n08 - An Oscar for Oscar\n09 - A Blue Time\n10 - An Oscar for Oscar [Take One]\n11 - Stablemates [Take One]\n12 - Minority [Take One]\n13 - Whistle Stop [Take One]\n14 - Morning Star [Take One]\nCD 2\n01 - One for Amos\n02 - If You Can't Call, Don't Come (A.K.A. Don't Come, Don't Call)\n03 - Morning Star\n04 - Minority\n05 - Blues for David\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:ce9cc76f73fa9442e64fd51425d3ff0a8c121dac","amp;dn":"Frank+Wess+%26amp%3B+Johnny+Coles+-+2012+-+Two+At+The+Top+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce9cc76f73fa9442e64fd51425d3ff0a8c121dac","infoHashBuffer":{"type":"Buffer","data":[206,156,199,111,115,250,148,66,230,79,213,20,37,211,255,10,140,18,29,172]},"announce":[],"urlList":[]}}