{"title":"BlacksOnBlondes - Phoenix Askani (anal) (2012).wmv","uid":7809754,"size":419184685,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ced54b2d1320de174a7631c9e8f8c3d412a1c58e&amp;dn=BlacksOnBlondes+-+Phoenix+Askani+%28anal%29+%282012%29.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1352494051,"description":"\nBlacksOnBlondes - Phoenix Askani (anal) (2012).wmv\n\n\nDescription:\n\n&quot;Phoenix Askani's head hasn't been in the right places lately Her  boyfriend? He's packing as much as a mouse. And all she can think about  is big black cock. And it's not just any big black cock:  it's her therapist's and she's walking on thin ice by revealing this  dilemma to Dr. Steele. How can she add more fuel to her fire? It could  only be that she wants to end their professional relationship on grounds  that she feels the distraction in his pants won't do anything for her  mental health.\nPhoenix knows that the clock is running on her session  with the good doctor and things heat up when Phoenix starts sucking on  that huge black cock. The twelve inches in Dr. Steele's pants is the only prescription that Phoenix needs and she continues to suck down on his massive black dick.  It's nice to know that Little Timmy is at home while his girlfriend is  risking the doctor's license as she continues to give him an ultimate  blowjob. The client's wet pussy drenches every inch of that big black cock as it pistons in and out of that creamy pussy.\nPhoenix seems to forget  that she's cheating on her boyfriend AND fucking the guy that knows her  as well as anyone. Nevertheless, Phoenix Askani takes that big black cock and moves it south towards her ass. The doctor rams his big black cock in her ass until  her lungs nearly collapse from going into  overtime. Dr. Lexington Steele drills her ass until his balls send that  signal to his brain telling him to coat that white girl's face with his  jizz. Phoenix Askani gets what she wanted and a bill of $3000 can only  mean that's she's going to keep visiting the hung black doctor-after hours, of course.&quot;\n\n\n\nResolution:   640x368\n\nDuration:     00:35:22\n\t\nSize:\t      399 MB\n\n\nScreens:\n &lt;a href=&quot;\nhttp://postimg.net/viewer.php?file=58517903229339209127.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewer.php?file=58517903229339209127.jpeg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ced54b2d1320de174a7631c9e8f8c3d412a1c58e","amp;dn":"BlacksOnBlondes+-+Phoenix+Askani+%28anal%29+%282012%29.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ced54b2d1320de174a7631c9e8f8c3d412a1c58e","infoHashBuffer":{"type":"Buffer","data":[206,213,75,45,19,32,222,23,74,118,49,201,232,248,195,212,18,161,197,142]},"announce":[],"urlList":[]}}