{"title":"Melancholie der Engel (2009) Eng sub Frankie76xxx","uid":7878452,"size":2214016685,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf7ae5d759a50fd6a564acd2a805d099cb16cd86&amp;dn=Melancholie+der+Engel+%282009%29+Eng+sub+Frankie76xxx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Frankie76xxx","files":1,"time":1354417270,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1420558/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1420558/&lt;/a&gt;\n\nAKA: The Angels' Melancholy, The Angels' Melancholia\n\nDirected by: Marian Dora\nWritten by: Marian Dora, Frank Oliver\nProduced by: Georg Treml\nCinematography by: Samuel Dalferth\nMusic by: Marian Dora\nCast: Zensa Raggi, Frank Oliver, Pietro Martellanza, Janette Weller\nYear: 2009\nCountry: Germany\nLanguage: German\nColor: Color\nRuntime: 2 hrs 45 min\nSubtitles : English\n\nMelancholie Der Engel is widely regarded by most extreme horror film fans as the single most extreme film that has ever been created. This film pushes every boundary that has ever been set before in an extreme film. There are scenes in here that will make even the most hardened horror fan cringe.\n\n\nThis film was created in 2009 by the extreme German horror film director, Marian Dora. This director was behind the famous film Cannibal, which caused massive controvery when it was first released. He has done the same thing again with this film. It is shot in much the same fashion using, light and shadow as not only a part of the scene, but almost as a character in itself. \n\n\n\n\n                          WARNING !!!\n\nContains very extreme,disturbing and sick twisted scenes so if you have a little doubt about seeing this movie ,dont do it,if you think this is just another Serbian film or August Underground Mordum kind of film its not,they are like a disneymovie compared to this so think twice before watching.\n\n\n\n                           PLOT\n\nA dark secret connects Katze and Brauth, two middle aged men. Katze has the clue that his end is near. The two friends meet again after years to share their last days in the old house where everything happened a long time ago. With three girls they met on their way, the atmosphere begins to recur a second time. When Heinrich, and old artist, decides to attend after all, the riends have their last chance to renew and cut with the history and to settle an old score. In the melancholy of the near end, Katze passes again all the situations in his life. In the hour of death, he's not alony anymore. His body is gone and his soul stays back in the same place where his destiny and fulfillment occured.","torrent":{"xt":"urn:btih:cf7ae5d759a50fd6a564acd2a805d099cb16cd86","amp;dn":"Melancholie+der+Engel+%282009%29+Eng+sub+Frankie76xxx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf7ae5d759a50fd6a564acd2a805d099cb16cd86","infoHashBuffer":{"type":"Buffer","data":[207,122,229,215,89,165,15,214,165,100,172,210,168,5,208,153,203,22,205,134]},"announce":[],"urlList":[]}}