{"title":"Night Passage (Western)  {Stewart, Murphy, Duryea} [1957]","uid":7949508,"size":752439279,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d0b7ce26b9902bd26b3c110e466c13054df97693&amp;dn=Night+Passage+%28Western%29++%7BStewart%2C+Murphy%2C+Duryea%7D+%5B1957%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1356224466,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0050763/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0050763/?ref_=fn_al_tt_1&lt;/a&gt;\n\n\nStoryline\n\nThe workers on the railroad haven't been paid in months --- that's because Whitey and his gang, including fast-shooting, dangerous, but likeable Utica Kid, keep holding up the train for its payroll. Grant McLaine, a former railroad employee who was fired in disgrace, is recruited to take the payroll through under cover. A young boy and a shoebox figure into the plot when Whitey's gang tries to hold up the train and Grant and the Kid meet again to settle an old score. \n\nUser Review\n\nBeautifully photographed, atmospheric western that takes a while to build up under James Neilson's direction--he took over from Anthony Mann, who was fired after clashing with star James Stewart--but ends with a slam-bang finale. Stewart and Audie Murphy work well together, with Stewart as a railroad employee entrusted with getting a payroll past a gang of train robbers, and Murphy his brother who's a member of the gang. Dan Duryea excelled at playing sadistic villains with a twisted sense of humor who actually got a kick out of their work, and he does another good job of it here. A solid supporting cast including Jack Elam, Robert J. Wilke and Herbert Anderson contributes to the film's enjoyability, along with some spectacular mountain scenery. While no masterpiece, it's a good, satisfying western with a catchy little ditty sung by, of all people, Stewart. Check it out. ","torrent":{"xt":"urn:btih:d0b7ce26b9902bd26b3c110e466c13054df97693","amp;dn":"Night+Passage+%28Western%29++%7BStewart%2C+Murphy%2C+Duryea%7D+%5B1957%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0b7ce26b9902bd26b3c110e466c13054df97693","infoHashBuffer":{"type":"Buffer","data":[208,183,206,38,185,144,43,210,107,60,17,14,70,108,19,5,77,249,118,147]},"announce":[],"urlList":[]}}