{"title":"Taiwan Tens - Set # 046 (Final Post -- Please Read Notes)","uid":7809891,"size":240015949,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d1e2855bf5f41a78e7e1ae2f0696eb1432e93d7e&amp;dn=Taiwan+Tens+-+Set+%23+046+%28Final+Post+--+Please+Read+Notes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"T-10","files":1,"time":1352497738,"description":"Well, my friends, this is the last post.  My apologies but this just takes too much of my time to worry if all of the torrents are being seeded and to try and cover the weak ones myself with my less than adequate ISP.  It also interferes with things I need to download and time I need to be spending on other things.\n\nFor your information there are two other sources for most of these files if you want to collect more of them.  \n\nFirst, on YouTube if you search &quot;legs, miniskirts&quot; you will find windiluv5.  Now he has edited them to obscure the beautyleg log and has changed the music (quite an improvement), but not all are offered in 1080p.\n\nSecond is a pirate site called &quot;asianbeautyleg.com which has them all (pretty much) in 1080p.  Problem with that site is that it's terribly constructed and not user friendly, full of bugs.\n\nTo copy the files, in case you've never thought of that (so you don't have to put up with all the ads and internet stopping), download RealPlayer and it has a downloader that will allow you to download them at high speed.  It's free.\n\nOf course the best solution is to join the Beautyleg.com membership and get the magazines and the videos... problem there is it's all in Chinese and tries to offer translations in Babelfish, which is a laugh at best.  It's a great site though and I managed to make it work, so maybe you can too.\n\nSo, here's my final gift to you from my collection, Avy again, of course, in three scenes.\n\nI wish you each the best of luck and it's been fun.\n\nT-10\n\n","torrent":{"xt":"urn:btih:d1e2855bf5f41a78e7e1ae2f0696eb1432e93d7e","amp;dn":"Taiwan+Tens+-+Set+%23+046+%28Final+Post+--+Please+Read+Notes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1e2855bf5f41a78e7e1ae2f0696eb1432e93d7e","infoHashBuffer":{"type":"Buffer","data":[209,226,133,91,245,244,26,120,231,225,174,47,6,150,235,20,50,233,61,126]},"announce":[],"urlList":[]}}