{"title":"My Gym Partners A Monkey The Movie-Big Field Trip","uid":7941021,"size":107926247,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d4ab6f17c7d9377934e627dbd3df8562deecb211&amp;dn=My+Gym+Partners+A+Monkey+The+Movie-Big+Field+Trip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mike3313","files":1,"time":1355978336,"description":"Adam goes on the annual field trip when joining the school band. The trip is usually an experience, but this year, the tour bus crashes into the city's woods and its all because of Adam and his piccolo. They are now lost and they try to survive. The faculty and students cannot survive in the wilderness, as they are afraid of the wilderness, calling the animals &quot;wild animals&quot;, when really, they are really only butterflies, bears, chipmunks, etc. and they are zoo animals). Adam tries to save the day by putting what he has learned at the school into use. When Jake gets Adam's flute back a whole army of chipmunks is ready to fire. They eventually get kidnapped while Windsor, Slips, Ingrid and Lupe learn how to get along with the cuddly animals. After the chipmunks, see Adam's piccolo, they start to be under Jake's hands. As time went by he was abusing them, and so, Adam falls off the tree and so to survive, he starts to take pride, on what CDMS has tought him.\n\nWhile Jake is king of the chipmunks, Adam gets kidnapped by bears, as he was covered in mud, and it completely confused them. When, they trash the house (but not Adam), Adam eats a chip and the bears go totally mad. Then saved by Jake, the chipmunks started to throw nuts, but now lets go to the teacher problem, Principal Pixiefrog had himself on the top of the bus with the totally mad team: Coach Gills, Vice-Coach Horace, Mr. Hornbill, Mr. Mandrill and Mrs. Warthog. After that totally wild adventure Adam plays his music with the piccolo, and gets everybody in the bus, and when the bears see the chips with Adam, they push and the field trip was finally gonna happen. After leaving the woods, the bus went to a giant field called as The Big Field and Adam finds out that they are actually going in a giant field and the school band uses non-instrumental objects. Adam tries to stay in tune with the band and uses his armpits but Mr. Mandrill stops the song and tells Adam that his out of tune. And he knows that he's busted!","torrent":{"xt":"urn:btih:d4ab6f17c7d9377934e627dbd3df8562deecb211","amp;dn":"My+Gym+Partners+A+Monkey+The+Movie-Big+Field+Trip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4ab6f17c7d9377934e627dbd3df8562deecb211","infoHashBuffer":{"type":"Buffer","data":[212,171,111,23,199,217,55,121,52,230,39,219,211,223,133,98,222,236,178,17]},"announce":[],"urlList":[]}}