{"title":"Sexually Broken-------rough fucking, massive squirting!  Darlin","uid":8599129,"size":1131053991,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d56c9b75788a0630859e33937177a7437721a073&amp;dn=Sexually+Broken%5C-------rough+fucking%2C+massive+squirting%21++Darlin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1371837686,"description":"Sexually BrokenAnother Bondage Legend taking the cock! Brutal deep throating, rough fucking, massive squirting!  Darling  Matt Williams\n\n\n\nMP4 only\n\n\nWe are excited to welcome Darling to the pages of Sexually Broken! Darling is the second Bondage Legend we have going full boy-girl! First it was Wenona, and now it's the amazing Darling.\n\n So it turns out out Darling is as good at brutal face fucking, deep throating, and rough sex as a seasoned LA porn girl, who knew? \n\n First things first! We take her huge 34E boobs and tightly bind them, then get her elbows tied behind her with a wooded pole that we will fully utilize later. With her hands trapped in front, we sit her in the chair and use the neck rope to pull her forward. The gag comes out and the hard cock slides in. \n\n She can't escape the brutal skull fucking we rain down on her. Darling's neck is held in place, there is no where to run to. We deep throat her into subspace and beyond. It is face fucking on a epic scale. With deep spit covering her face and body, we flip her onto the chair and spread her legs in almost full splits. Her toes are tied to the floor and we bring the hard cock to her wet, shaved pussy.\n\n Hard deep 'uterus banging' sex. We fuck Darling hard! Rough sex at it's finest, all she can do is scream and cum over and over. Her brain is mush, we pull out and finger bang her to a few massive squirting orgasms. Darling eyes just roll up into her head, the lights are on but no one is home....\n\n\n\n\nScreens    &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/index.php?&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/index.php?&lt;/a&gt;\n\n\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-)  \n\n\t\t","torrent":{"xt":"urn:btih:d56c9b75788a0630859e33937177a7437721a073","amp;dn":"Sexually+Broken%5C-------rough+fucking%2C+massive+squirting%21++Darlin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d56c9b75788a0630859e33937177a7437721a073","infoHashBuffer":{"type":"Buffer","data":[213,108,155,117,120,138,6,48,133,158,51,147,113,119,167,67,119,33,160,115]},"announce":[],"urlList":[]}}