{"title":"POV Cuckold 7","uid":7864800,"size":510684329,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d73cad33c59105287ab7b9434568ab71b22f34aa&amp;dn=POV+Cuckold+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":-1,"time":1354031107,"description":"Studio: Roman Video\nGenre: Femdom, Humilation,\nStarring: Nikki Sexxx, Lover Johnny\nDuration: 00:54:47\n\nDescription: She's back! The incredibly sensual Nikki Sexxx and her name is her business!\nYou're her pathetic husband and you don't stand a chance of retaining your dignity as Nikki lays out the law for you. She's going to go out an fuck as many big cocks as she can and she's going to bring back their cum for you to eat out of her. You try to protest, but Nikki just mocks you, even as she locks your tiny penis in a CHASTITY DEVICE.\nWithout further ado, Nikki is out on a date, and FUCKING A MUCH BIGGER COCK. She rides her new lover to MULTIPLE ORGASMS, even as she tells him that he's far from the first stud she's had that day.\nNikki gets pounded DOGGY STYLE and COWGIRL and on her side takes a massive load of cum in her pussy.\nShe brings that creampie home and shows it to you, her wimpy, small dick loser husband, as it squishes through her panties. She promises to release you from your chastity hell after you've licked all the other men's nasty semen out of her pussy.\nYou suck the cum from her stretched out hole until your stomach churns with sperm. Finally you're rewarded. She unlocks the chastity device and SUCKS YOUR PUNY COCK to get you hard. Then she lets you fuck her gushing wet, raw pussy. You uncontrollably thrust into her, feeling the cum of other dudes cum around your dick, until your blast your own wad.\nShe goes on another date and is plowed hard on her back. She returns to you and again makes you dine on the sticky, salty load that oozes from her pussy. You drop to your knees, happy to serve your gorgeous wife, and amazingly hungry for the cum of superior men.\n.\nQuality: DVDRip\nFormat: WMV\nVideo codec: Windows Media\nAudio Codec: wma\nAudio: Windows Media Audio 48000Hz stereo 64kbps\nVideo: Windows Media Video 9 720x404 29.97fps 1177kbp\n &lt;a href=&quot;\nhttp://imgload.me/img-50b4d1b1c6ee3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50b4d1b1c6ee3.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:d73cad33c59105287ab7b9434568ab71b22f34aa","amp;dn":"POV+Cuckold+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d73cad33c59105287ab7b9434568ab71b22f34aa","infoHashBuffer":{"type":"Buffer","data":[215,60,173,51,197,145,5,40,122,183,185,67,69,104,171,113,178,47,52,170]},"announce":[],"urlList":[]}}