{"title":"Martin Van Buren Ingram - The Bell Witch Hauntings (mobi + epub)","uid":7898325,"size":582719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8aa33901bd9908ebabceae1795b69ea5cccb86c&amp;dn=Martin+Van+Buren+Ingram+-+The+Bell+Witch+Hauntings+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kevinkray","files":-1,"time":1354899003,"description":"An Authenticated History of the Famous Bell Witch: A True Story (also called the Red Book).\n\nThe Bell Witch or Bell Witch Haunting is a poltergeist legend from Southern United States folklore, involving the Bell family of Adams, Tennessee. The legend is the basis of the films An American Haunting (2006) and The Bell Witch Haunting (2004), and may have influenced the production of The Blair Witch Project (1999).\n\nAccording to the legend, the first manifestation of the haunting occurred in 1817 when John William Bell, Sr. encountered a strange animal in a cornfield on his large farm in Robertson County, on the Red River, near Adams, Tennessee.\n\nThis incident was quickly followed by a series of strange beating and gnawing noises manifesting outside and eventually inside the Bell residence. Betsy Bell, the family's younger daughter claimed to have been assaulted by an invisible force.\n\nSome people believe that the spirit returned in 1935, the year when the witch claimed it would return (&quot;one hundred years and seven&quot; past 1828), and took up residence on the former Bell property.\n\nThe most famous account is recorded in what has come to be called the Red Book, the 1894 An Authenticated History of the Bell Witch of Tennessee by Martin Van Buren Ingram, which cites the earlier Richard William Bell's Diary: Our Family Trouble. Richard Williams Bell lists several witnesses, including General (later President) Andrew Jackson.\n\nThat account and also an account of a related incident, The Mississippi Bell Witch account are included in this volume. Bell Witch legends are almost as prevalent in Mississippi as they are in Tennessee because of the fact that the families of two of John Bell's children moved to Mississippi in the 1830's\n\nA must-have for classic mystery and ghost story fans!","torrent":{"xt":"urn:btih:d8aa33901bd9908ebabceae1795b69ea5cccb86c","amp;dn":"Martin+Van+Buren+Ingram+-+The+Bell+Witch+Hauntings+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8aa33901bd9908ebabceae1795b69ea5cccb86c","infoHashBuffer":{"type":"Buffer","data":[216,170,51,144,27,217,144,142,186,188,234,225,121,91,105,234,92,204,184,108]},"announce":[],"urlList":[]}}