{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":7902315,"size":8159248962,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9b88fcc3f8a6b1f8fa9201b9d033168d236fee5&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1354991944,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 34 - UFO Disclosure A Global Deception\n\n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh.\n\nDescription: UFO's are everywhere. I have seen them.\n\nArthur C. Clarke's Mysterious World UFOs 1980:\nAn investigation of unexplained phenomena and mysteries around the world.  Arthur C. Clarke's Mysterious World (Ep. 10) - Right away Clarke removes any doubt as to his opinion of UFOs -- he states that he has been interested for 50 years and claims to have observed at least six. He even goes on to say, sightings are very common. He does, however, reserve his opinions concerning them; revealing more and more of his ideas on the subject as the episode progresses.\n-----------------------------------------------------------------\n\n2001 National Press Club Event:\nOn Wednesday, May 9th, 2001, over twenty military, intelligence, government, corporate and scientific witnesses came forward at the National Press Club in Washington, DC to establish the reality of UFOs or extraterrestrial vehicles, extraterrestrial life forms, and resulting advanced energy and propulsion technologies. The weight of this first-hand testimony, along with supporting government documentation and other evidence, will establish without any doubt the reality of these phenomena. DVD is available to order at: &lt;a href=&quot;\nhttp://www.DisclosureProject.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.DisclosureProject.org&lt;/a&gt;\n-----------------------------------------------------------------\n\nCentury Of Manipulation:\nA history of false flags, war opportunism, Al-Qaeda and other deceptions.  View the amazingly distugsting footage of documented evidence exposing the government's involvement in terrorist activities within its own national borders upon its own citizens.  This is the world in which we all live!  Who do YOU &quot;Trust?&quot;\n-----------------------------------------------------------------\n\nThe End is Near by David Lankford:\nPastor Lankford on Obamacare as Mark of the Beast; Prepping[Self-Reliance] as Common/&quot;Horse&quot; Sense(Stable Thinking) ;-D and The Sins of Sodom.  Steve Quayle's favorite preacher--Homespun Scriptural-based Wisdom.  Very Refreshing.\n-----------------------------------------------------------------\n\nNASA AND THE HOLY GRAIL by Michael Hoggard:\nFor years the United States has led the world in pioneering space travel, even sending men to the moon. This has led to other nations, like China, developing their own space programs. The United States is now talking about sending a man to Mars. Is this possible? Michael Hoggard talks about space travel and how God views man's attempts to explore the universe.\n\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:d9b88fcc3f8a6b1f8fa9201b9d033168d236fee5","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9b88fcc3f8a6b1f8fa9201b9d033168d236fee5","infoHashBuffer":{"type":"Buffer","data":[217,184,143,204,63,138,107,31,143,169,32,27,157,3,49,104,210,54,254,229]},"announce":[],"urlList":[]}}