{"title":"The Ascent Of Money [2008] Series","uid":8605888,"size":2215967895,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:daed3c65435104d5c08acad02bfd0c975c8ee10a&amp;dn=The+Ascent+Of+Money+%5B2008%5D+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"agatesav","files":18,"time":1372013269,"description":"Episode 1 - Dreams of Avarice\nIn this extraordinarily prescient series, The Acent of Money, Professor Niall Ferguson shows how the history of money has been punctuated by gut-wrenching crises and crashes. From the origins of banks to the rise of 'Chimerica', each programme deals with a financial 'big bang' that has changed the course of history. He begins by examining the origins of banking and the innovative concepts of credit and debt which underpin the world economy and have driven progress for millennia.\n\nEpisode 2 - Human Bondage\nNiall Ferguson's history of finance continues. This week, he tells the story of government bonds. Invented when the city states of Italy were fighting each other in the early Renaissance, bonds meant that instead of being taxed, citizens effectively lent money to their government to fight wars, on the assumption that the government would pay them back in due course. So was created a way to buy and sell government debt, a market that was dominated in the 19th century by the Rothschild family, whose financial weight duly helped defeat Napoleon at Waterloo.\n\nEpisode 3 - Blowing Bubbles\nWhy do stock markets produce bubbles and busts? Professor Ferguson goes back to the origins of the joint stock company in Amsterdam and Paris. He draws telling parallels between the current stock market crash and the 18th-century Mississippi Bubble of Scottish financier John Law and the 2001 Enron bankruptcy. He shows why humans have a herd instinct when it comes to investment, and why no one can accurately predict when the bulls might stampede.\n\nEpisode 4 - Risky Business\nLife is a risky business - which is why people take out insurance. But faced with an unexpected disaster, the state has to step in. Professor Niall Ferguson travels to post-Katrina New Orleans to ask why the free market can't provide adequate protection against catastrophe. His quest for an answer takes him to the origins of modern insurance in the early 19th century and to the birth of the welfare state in post-war Japan.\n\nEpisode 5 - Chimerica\nSince the 1990s, once risky markets in Asia, Latin America and eastern Europe have become better investments than the UK or US stock market. The explanation is the rise of 'Chimerica', the economic marriage of China and the United States. But does it make sense for poor Chinese savers to lend to rich American spenders?\n\nEpisode 6 - Safe as Houses\nIt sounded so simple: give state-owned assets to the people. After all, what better foundation for a property-owning democracy than a campaign of privatisation encompassing housing? An economic theory says that markets can't function without mortgages, because it's only by borrowing against their assets that entrepreneurs can get their businesses off the ground. But what if mortgages are bundled together and sold off to the highest bidder?\n\nApprox. 48 mins. each","torrent":{"xt":"urn:btih:daed3c65435104d5c08acad02bfd0c975c8ee10a","amp;dn":"The+Ascent+Of+Money+%5B2008%5D+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daed3c65435104d5c08acad02bfd0c975c8ee10a","infoHashBuffer":{"type":"Buffer","data":[218,237,60,101,67,81,4,213,192,138,202,208,43,253,12,151,92,142,225,10]},"announce":[],"urlList":[]}}