{"title":"Belltech Greeting Card Designer v5.5.0 with Key [TorDigger]","uid":8683942,"size":25451082,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dd795f9c5d64d2c10812cbdfa562838196ed05bd&amp;dn=Belltech+Greeting+Card+Designer+v5.5.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":12,"time":1373755781,"description":"Belltech Greeting Card Designer\n\nse this Greeting card software to create your personalized greeting cards. Belltech Greeting Card Designer helps you create greeting cards quickly. You can email or print the finished card right-away on your PC-connected printer.\nDesign from a variety of templates, poems.\nPut your own photos and text.\nPrint card in your own printer.\nEmail card (e greeting card) as an image file attachment.\nDesign personalized cards for Birthdays, Wedding, New Year, anniversaries or any special occasion. The program comes with many card templates, clip art, background pictures to get you started. For fast output, you just choose a template, personalize the messages and print, that's all; Also, use shapes like heart, call-out, moon, sun etc. to make your card even more interesting.\n\nProduct Highlights:\n\nQuick and Easy Design: Why bother going to store spending hours looking for a perfect greeting card and then buying something that you don't like? Use our software to create your personalized greeting card. Choose from readymade greeting, verse and then modify the way you like, select and draw shapes and text; resize, tilt, change color, fill with gradient color or do anything with your design elements to make the right card.\nUse your own clip-arts, logo and photos: We supply you with many graphics that you can use, but don't think that it is all you can use. Get your own picture, family photo, clip-art and design the card you want.\nChoose any layout: With is application you can create quarter-fold or half-fold cards. In quarter-fold you also choose create quarter-side-fold or quarter-top-fold cards.\nUse templates and graphics: You can start with the card templates, background and clip-arts, then move on to advanced features like color blends, image edit etc. Simple to use yet so powerful!\nConvenient Design tools: Draw rectangle/triangle/circle or use freehand lines and shapes to create callout and designs.\nCard Background: Use the supplied backgrounds or use your own.\nUse Color blends: You can now have shapes with a blends of 2 colors. There are many bleding combinations you can do. The created blend is not a static background image, but a filled shape whose color-blend and texture you can choose or edit later.\nPrinting papers: Supports most standard greeting card papers(Half-fold and quarter-fold) from Avery and other suppliers.\n\nSystem Requirements:\n\n-Windows 7 (32-bit and 64-bit)/XP/Vista/2000/2003/NT/98 \n-64 MB of RAM and about 40 MB of hard drive space.\n\nHomepage: http://www.belltechsystems.com/greeting-card-software/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:dd795f9c5d64d2c10812cbdfa562838196ed05bd","amp;dn":"Belltech+Greeting+Card+Designer+v5.5.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd795f9c5d64d2c10812cbdfa562838196ed05bd","infoHashBuffer":{"type":"Buffer","data":[221,121,95,156,93,100,210,193,8,18,203,223,165,98,131,129,150,237,5,189]},"announce":[],"urlList":[]}}