{"title":"Red Wanting Blue Discography 1996-2012","uid":8636926,"size":1028767622,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:deece54c3e51d9f0ae41a49b431778c0b9f1d673&amp;dn=Red+Wanting+Blue+Discography+1996-2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Darthmullet","files":-1,"time":1372779461,"description":"                                Red Wanting Blue\n\nRed Wanting Blue is proudly based in Columbus, Ohio, but could very well be America's local band. Led by the powerful baritone of singer Scott Terry, the group has toured the nation's heartland for years, making fans one at a time by delivering passionate performances driven by the unshakable backbeat of real rock-n-roll.\n\n&quot;From The Vanishing Point&quot; is Red Wanting Blue's first album to be recorded for a label after multiple independent releases. The record sees the band evolving into the world-class outfit that local audiences have always believed in and marks an official move to the national stage for a band that will always remember where it's from.\n\n\n1996- Velveteen-------------------------------(MP3 192 Kbps) \n\n1998- The Image Trigger-----------------------(MP3 192 Kbps)\n\n2000- Model Citizen---------------------------(M4A 128 Kbps)\n\n2001- Sirens----------------------------------(M4A 256 Kbps)\n\n2003- Souvenirs of City Life------------------(M4A 128 Kbps)\n\n2004- Pride: The Cold Lover-------------------(M4A 128 Kbps)\n\n2006- The Warehouse Sessions* (Audio Only)----(MP3 251-280 Kbps)\n\n2010- These Magnificent Miles*----------------(M4A 256 Kbps)\n\n2011- Magic Man (Single)*---------------------(MP3 235 Kbps)\n\n2012- Live At City Winery---------------------(MP3 320 Kbps)\n\n2012- From The Vanishing Point + Booklet------(MP3 185-320 Kbps)\n\nSources include physical CDs, iTunes, Amazon MP3, and RWB Online Store MP3s\n\nFor live videos see RWB's Youtube Channel -\n\n\n \n*The Warehouse Sessions project is a live concert recording that was filmed at our warehouse, the home of our creative process and rehearsal space for almost five years. One hundred fans joined us at the warehouse to record a live acoustic performance specifically geared towards releasing a live acoustic CD &amp; DVD. We did some classic Red Wanting Blue acoustic show favorites as well many of the songs that will be on the bands upcoming record - RWB (There is a video of the concert not in this torrent).\n\n*The last track on the These Magnificent Miles album, Don't Wanna Hear It (as seen on the RWB Website) was not a separate track on the finished album. Instead, the 12th song &quot;The Band&quot; has a ~10 second intermission at the end, and Don't Wanna Hear It starts. In essence it is a double track.\n\n\n*Magic Man: Red Wanting Blue was commissioned in 2011 to write the original song &quot;Magic Man&quot; for the end title sequence of the documentary feature film, &quot;Unraveled.&quot; The film is co-produced by Oscar-nominated producer Steven Cantor and premiered at the Los Angeles Film Festival on June 17th (the same night that Red Wanting Blue headlined NYC's Mercury Lounge.)\n\n    &quot;Unraveled&quot; profiles Marc Dreier, a prominent Manhattan attorney, who, just days before Bernard Madoff captured headlines as the largest Ponzi schemer in U.S. history, was arrested (and later convicted) for orchestrating a massive fraud scheme that netted hundreds of millions of dollars from hedge funds. The film chronicles Dreier's period of house arrest as he awaits sentencing and candidly confesses his crimes.\n\n________________________________________________________________________________\n\nCredit for five of these albums goes to Jamdog17 from his torrent linked below. After initial seeding I edited my files and was not able to start seeding again after I noticed the torrent was dying. I have included his music in this torrent (with artwork embedded) to keep it available.\n    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5850313/RWB__--_Red_Wanting_Blue_5_albums&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5850313/RWB__--_Red_Wanting_Blue_5_albums&lt;/a&gt;\n\n\nRed Wanting Blue is a great up and coming Indie / Alternative Rock (They refer to themselves as Rock-Americana) band. They are a fresh influence on today's pop music - great musicians who write their own material and perform best in their live concerts. If you like the music, please support the band!\n\n                        &lt;a href=&quot; http://www.redwantingblue.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.redwantingblue.com/&lt;/a&gt;\n\n*Note on Seeding* I have a DSL internet connection so initial download speeds may be slow. Additionally, I will only be able to seed roughly between 12 AM (midnight) - 12 PM (noon) EST for bandwidth reasons.\t\t\t\n","torrent":{"xt":"urn:btih:deece54c3e51d9f0ae41a49b431778c0b9f1d673","amp;dn":"Red+Wanting+Blue+Discography+1996-2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deece54c3e51d9f0ae41a49b431778c0b9f1d673","infoHashBuffer":{"type":"Buffer","data":[222,236,229,76,62,81,217,240,174,65,164,155,67,23,120,192,185,241,214,115]},"announce":[],"urlList":[]}}