{"title":"[HorribleSubs] Muv-Luv Alternative - Total Eclipse - 20 [720p].m","uid":7838746,"size":347720466,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e043768b162e0c230d924c70da554329a5417a42&amp;dn=%5BHorribleSubs%5D+Muv-Luv+Alternative+-+Total+Eclipse+-+20+%5B720p%5D.m&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"k1ng_ruLz","files":1,"time":1353270625,"description":"Muv-Luv Alternative - Total Eclipse - Episode 20\n\n\n\nSince 1973, an invasion of aliens known as BETA upon Earth is driving human civilization into nearly collapse. Facing an enormous mass of enemy force, mankind has developed large humanoid arms called as Tactical Surface Fighters and deployed them to its defense lines through out the world. However, all those efforts could slow down defeats but could not stop BETA, and mankind is forced to abandon major area of the Eurasian Continent. For 30 years, mankind is bogged down in an endless war against BETA without any hopes of victory.\n\nIn 2001, the Imperial Japan faces difficulties in the development of a next-generation main Tactical Surface Fighters (TSF) as it defends the front lines of the Far East. The UN has proposed a joint development program between the Imperial Japan and the United States as a part of its international mutual development project of TSF, the Prominence Project.\n\nYui Takamura, a surface pilot of the Imperial Royal Guards of Japan, is given responsibility for the project and sets off to Alaska. Meanwhile, Yuya Bridges, also a surface pilot of the US Army, was heading to the same destination.\n\nYet they never knew that their encounter would change their destiny drastically.\n\nThis story with exciting human dramas and robot actions takes place in the development of a new Tactical Surface Fighters, the most important and effective weapons against BETA, at a crisis of human extinction.\n\n\n\nGenres: Action, Mecha, Sci-Fi, Military\n\nThemes: mecha\n\nRelease date : November 19, 2012\n\nAudio language : Japanese\n\nSubTitle language : English","torrent":{"xt":"urn:btih:e043768b162e0c230d924c70da554329a5417a42","amp;dn":"%5BHorribleSubs%5D+Muv-Luv+Alternative+-+Total+Eclipse+-+20+%5B720p%5D.m","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e043768b162e0c230d924c70da554329a5417a42","infoHashBuffer":{"type":"Buffer","data":[224,67,118,139,22,46,12,35,13,146,76,112,218,85,67,41,165,65,122,66]},"announce":[],"urlList":[]}}