{"title":"Arrowhead (Western) {Heston, Palance, Keith} [1953]","uid":7936505,"size":747368342,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e0c53b5753c4b9b798bc60c82fdaa7e13d02a299&amp;dn=Arrowhead+%28Western%29+%7BHeston%2C+Palance%2C+Keith%7D+%5B1953%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"alien99","files":-1,"time":1355870644,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0045518/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0045518/?ref_=fn_al_tt_1&lt;/a&gt;\n\nStoryline\n\nChief of Scouts Ed Bannon narrowly avoids an Apache ambush while working with the cavalry stationed at Fort Clark, Texas. The US Army is trying to talk peace with the Apaches and move them to reservations in Florida, and they take Bannon's efforts as detrimental to their new policies, so they fire him. When the Apache chief's son Torinada returns from an Eastern education, Bannon becomes highly suspicious of his motives based run-ins with Torinada in the past. Bannon continues shadowing the proceedings to the chagrin of both the US Army and the Apache warrior.\n\nUser Review\n\nCharlton Heston plays an Indian-hating scout very loosely based on famed frontiersman Al Sieber (who, in reality, was a German immigrant who not only didn't hate Apaches but often lived with them and spoke fluent Apache dialects; he spoke almost no English because he detested American whites and refused to learn any more English than he considered necessary). He goes up against Jack Palance, an Apache he knew from his boyhood who is returning from several years at an Indian agency school that is supposed to have &quot;civilized&quot; him (also based on fact; many Indian children were forcibly sent to such a school in Carlisle, Pennsylvania). Heston, unlike the local military and civilian authorities, doesn't believe that Palance has been &quot;civilized&quot; and suspects that he's secretly planning to lead the Apaches in attacking and massacring the local white population. This is a tough and, for its time, brutal little western, well written and directed by Charles Marquis Warren, and pulls no punches in its depiction of racism on both sides; Palance hates whites as much as Heston hates Indians, and both have no compunction about killing those on the &quot;other&quot; side they've known for years simply as a matter of course. Palance and Heston are suitably intense in their roles--Heston perhaps a bit too much so--and the action scenes are handled very well, although the final confrontation between Heston and Palance is a bit of a disappointment. A good supporting cast of veteran western actors--Milburn Stone, James Anderson, Robert J. Wilke (not playing a villain for once), among others--contribute greatly to the film's pace and atmosphere (although the rivalry between Heston and army officer Brian Keith over a girl at the post is a bit superfluous). Well worth your time. ","torrent":{"xt":"urn:btih:e0c53b5753c4b9b798bc60c82fdaa7e13d02a299","amp;dn":"Arrowhead+%28Western%29+%7BHeston%2C+Palance%2C+Keith%7D+%5B1953%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0c53b5753c4b9b798bc60c82fdaa7e13d02a299","infoHashBuffer":{"type":"Buffer","data":[224,197,59,87,83,196,185,183,152,188,96,200,47,218,167,225,61,2,162,153]},"announce":[],"urlList":[]}}