{"title":"Toaru Kagaku no Railgun S - 07 [UTW-Mazui-subbed] XviD [JKS-enco","uid":8512275,"size":208848962,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e19a733d1866b1f250efc5462cb1eb7989e4393a&amp;dn=Toaru+Kagaku+no+Railgun+S+-+07+%5BUTW-Mazui-subbed%5D+XviD+%5BJKS-enco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jksADIDAS","files":13,"time":1369611438,"description":"Toaru Kagaku no Railgun S - English Subbed - Japanese Dubbed\n\n\n\nIMDb: http://www.imdb.com/title/tt1515996/?ref_=fn_al_tt_1\nWiki Link: https://en.wikipedia.org/wiki/List_of_A_Certain_Scientific_Railgun_episodes\n-----\nToaru Kagaku no Railgun (A certain scientific Railgun) is an anime series based on the manga of the same name, which in itself is a spin-off of Kazuma Kamachi's light novel, manga and anime series A Certain Magical Index. The manga is serialized in Dengeki Daioh and is written by Kazuma Kamachi and illustrated by Motoi Fukuyama. Set in Academy City before and during the events of A Certain Magical Index, the plot focuses on Mikoto Misaka, an electromaster who is the third strongest esper in Academy City, along with her friends; Kuroko Shirai, a Teleporter and Mikoto's roommate, Kazari Uiharu, Kuroko's partner in Judgment, the city's public safety committee and Ruiko Saten, Kazari's friend and classmate. The second season is titled Toaru Kagaku no Railgun S\n------------------------------------------------------------------------------------------------------------\nToaru Kagaku no Railgun S - 07 [UTW-Mazui-subbed] XviD [JKS-encoded]\n.\nVideo\nXviD\nLength: 23:39\nFrame width.: 848\nFrame Height: 480\nData rate: 1012kbps\nTotal bitrate: 114.kbps\nFrame rate: 23 f/s\n.\nAudio\nMP3\nBit Rate: 128kbps\nChannels: 2 stereo\nAudio sample rate: 44 kHz\n-----\nTitle: I Want To Be Sissy's Power Original Air Date: May 24, 2013\n.\nAs Mikoto secretly lays waste to each of the labs involved in the Level 6 Shift project, Kuroko continues to cover for her disappearances, but she grows increasingly concerned and starts to miss her friend. While on patrol she encounters a child called Minori searching for Shinobu's cash cards along with some friends, acting on an urban legend that the cards with certain serial numbers are lucky. Kuroko scolds them and confiscates the card they found, but later finds Minori continuing the search alone and saves her from getting hit by a car. Minori reveals that she is looking for the cards as a special gift for a close friend who is moving away, and so reminded of her partner, Kuroko decides to supervise her search along with Kazari and Ruiko, even while knowing that as members of Judgement they could not let Minori keep the card. Mii comes across them and offers a more 'analogue' suggestion- that they search for a four-leaf clover instead. During their search, Kuroko's concerns for Mikoto are revealed, and Ruiko and Kazari remind her that her efforts are appreciated, not just by Mikoto but by her other friends as well. Kuroko and Minori each find four-leaf clovers, and Kuroko decides to keep hers, resolving to continue her loyalty and hard work. Meanwhile, the engineers of the Level 6 Shift project discover Mikoto's sabotages and prepare to respond.","torrent":{"xt":"urn:btih:e19a733d1866b1f250efc5462cb1eb7989e4393a","amp;dn":"Toaru+Kagaku+no+Railgun+S+-+07+%5BUTW-Mazui-subbed%5D+XviD+%5BJKS-enco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e19a733d1866b1f250efc5462cb1eb7989e4393a","infoHashBuffer":{"type":"Buffer","data":[225,154,115,61,24,102,177,242,80,239,197,70,44,177,235,121,137,228,57,58]},"announce":[],"urlList":[]}}