{"title":"Sexually Broken--INVERTED THROAT BOARDING!  Vicki Chase  Matt Wi","uid":7946480,"size":861115998,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e3d9c3215a9cea81e7837f189e9ce7083fc57ee9&amp;dn=Sexually+Broken--INVERTED+THROAT+BOARDING%21++Vicki+Chase++Matt+Wi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1356142358,"description":"INVERTED THROAT BOARDING! Hot Latina endure the most intense deep throat fucking and orgasms | Vicki Chase | Matt Williams\n\nDecember 21, 2012 \n \n  \nMP4 only.\n    \n \nWelcome Vicki Chase to the pages of the fastest growing sex and submission site on the net, Sexually Broken. Vicki Chase is a bilingual sexy Latina. This girl has a killer natural body and is one of the best deep throaters we have ever seen. We pushed her hard and she endured.\n\nBound inverted with just simple leather straps, with her elbows bound together in a strict strappado, Vicki knows her throat is going to get fucked good and rough. A rope holds her head in place, the beam prevents her from being able to turn her head at all. Her mouth is trapped and her face is about to be fucked into next year.\n\nA huge dildo impales her tight pussy and a vibrator is locked directly on to her clit. Her perfect natural breasts are tightly wrapped and bound up tight. The cock presses past her sensual lips, past her tongue and all the way down her tight throat, you can actually see the bulge and outline of the cock in her throat from the outside. \n\nWe start off slowly, pulling the cock all the way out and pushing balls deep. Over and over, using her throat like a pussy. Then we get rougher and rougher. We hold the cock down her throat and cut off all breathing for as long as we like, she can do nothing. She can't move her head back or side to side. She is completely at the mercy of the cock.\n\nThe vibrator does its job, Vicki keeps cumming and cumming. Each one stronger then the last. The cock never lets up. The more we cut of her air the harder she cums, the harder she cums, the more she is out of breath. It's a vicious circle, Vicky is utterly sexually broken, she is in deep sub space. Her eyes vacant, her throat stuffed with cock, her body violently cumming over and over. We back off, Vicky's brain has checked out, her eyes are wide open, but she sees nothing.... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_21vchase3/SexuallyBroken-Vicki-Chase-Matt-Williams-vchase3.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_21vchase3/SexuallyBroken-Vicki-Chase-Matt-Williams-vchase3.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:e3d9c3215a9cea81e7837f189e9ce7083fc57ee9","amp;dn":"Sexually+Broken--INVERTED+THROAT+BOARDING%21++Vicki+Chase++Matt+Wi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d9c3215a9cea81e7837f189e9ce7083fc57ee9","infoHashBuffer":{"type":"Buffer","data":[227,217,195,33,90,156,234,129,231,131,127,24,158,156,231,8,63,197,126,233]},"announce":[],"urlList":[]}}