{"title":"Cry Anger - Jack Birnbaum","uid":8610054,"size":8586452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5878edbf5924bbccabc2bad9f68957a3c03b105&amp;dn=Cry+Anger+-+Jack+Birnbaum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"loonleeks","files":-1,"time":1372113412,"description":" Cry anger: A cure for depression - Jack Birnbaum (1973)\n\n\nthe heytast\nCry Anger, by Dr. Jack Birnbaum. Written by a psychiatrist, it is a good look at the way suppressed or mis-directed anger manifests itself in mentally unhealthy ways. One way is through depression; another is psychosis.\n\n\nToo many people try to hide their anger by pushing it deep within themselves. But it builds up\nuntil it explodes in a tantrum or crying jag.\nCRY ANGER shows you how to use your anger constructively, by feeling it, accepting it, expressing\nit. By using your hostility in a healthy,direct way, you can prevent illness, improve your self-image,\nand learn to enjoy living.\n\n\n===============&gt;\n\n&quot;Cry Anger&quot; Opens Eyes, July 3, 2005 - Customer Review\n\n&quot;Cry Anger&quot; is well written and moves at a good pace. It is easy to understand and very helpful.\n\nAlthough the idea seems odd at first, Jack Birnbaum clearly outlines the connection between anger and depression. He does an excellent job of breaking things down and clarifying how anger turns into depression, what makes us angry, and what we can do about it.\n\nI highly recommend &quot;Cry Anger.&quot; If you've been struggling with depression, this book might be the help you've been looking for. In the section where Jack Birnbaum illustrates the telltale signs of anger, you will most likely recognize yourself. I did, much to my surprise.\n\nBy understanding the concepts presented in &quot;Cry Anger,&quot; I realized that I wasn't just feeling depressed - I was feeling the backlash of repressed anger! Now, I am dealing with the anger and am no longer depressed.\n\nI am gateful to the person who first gave me &quot;Cry Anger&quot; and Jack Birnbaum for writing such a helpful book. I hope this book will help you, too.","torrent":{"xt":"urn:btih:e5878edbf5924bbccabc2bad9f68957a3c03b105","amp;dn":"Cry+Anger+-+Jack+Birnbaum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5878edbf5924bbccabc2bad9f68957a3c03b105","infoHashBuffer":{"type":"Buffer","data":[229,135,142,219,245,146,75,188,202,188,43,173,159,104,149,122,60,3,177,5]},"announce":[],"urlList":[]}}