{"title":"Devicebondage------DB-27520 Darling WMV","uid":7923415,"size":929444468,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e5ad64e8e0a7226b947070815defc11919323df8&amp;dn=Devicebondage%5C------DB-27520+Darling+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1355522924,"description":"Cockateel Returns\n\n \n\nDec 14, 2012 - Performers: Darling \n\n \n\n \n\nWMV only. MP4 + Pics later. \n\n        \n\n \n\nThere are great models and then there are amazing models like Darling. Best in class, she has looks, tenacity, a killer figure, and wants to be pushed. In the first scene the cockateel is encased in a latex catsuit, spread open, and kept taut with chain around her neck, ankles, and thighs. Her wrists in metal shackle stocks are bolted to the floor under her hips. She looks a little warm so Claire cools her off and torments her with some nice ice cold water. Her beautiful breasts burst out of her catsuit and beg for clamps. Second, Darling is bound standing with her elbows wrapped around metal pipe in between two pillars. Head to toe she is strapped with leather, showing off her crazy bust-waist-hip ratio. Her breasts are trapped in leather straps and attached to chains as is her head with a leather gag harness. Claire single tails Darling. Deliberately, slowly, intensely. Darling is on edge with every lick of the tail. Now, its time to challenge her. Claire takes Darling's legs and attaches them to chains, placing Darling in a very challenging breast/elbow/ankle/thigh suspension. Finally Darling is bound in a wide spread on a custom pedestal chair made to her measurements. Claire loves hearing Darling beg. This time, Darling has to beg to be hurt - a favorite game of Claire's. The more intense the pain, the more intense the pleasure. Watch and see how much this hot cunt can cum when the lines are blurred.\n\n \n\nScreens\n &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=27520&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=27520&lt;/a&gt;\n\n \n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n  \n\nCheers  :-)  \n","torrent":{"xt":"urn:btih:e5ad64e8e0a7226b947070815defc11919323df8","amp;dn":"Devicebondage%5C------DB-27520+Darling+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ad64e8e0a7226b947070815defc11919323df8","infoHashBuffer":{"type":"Buffer","data":[229,173,100,232,224,167,34,107,148,112,112,129,93,239,193,25,25,50,61,248]},"announce":[],"urlList":[]}}