{"title":"Constantine's.Sword.2007-Catholic.Church.&amp;.Antisemitism","uid":8523131,"size":736796135,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e7aff942213027f59ab8ebac2a5520a2e43b10e1&amp;dn=Constantine%27s.Sword.2007-Catholic.Church.%26amp%3B.Antisemitism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1369960037,"description":"Technical details\n\nFile Type: avi\nFile Size: 719 mb\nLength: 95 minutes\nLanguages in film: English, German, Italian and Yiddish\nCast/Featuring: Liev Schreiber, pastor Ted Haggard, Phillip Bosco, Natasha Richardson, Eli Wallach\nDirector: Oren Jacoby\nProducers: Oren Jacoby, James Carroll, Michael Solomon, Betsy West.\nSupervising producer: Elgin Smith\nScreenwriters: James Carroll, Oren Jacoby\nProduction company: Storyville Films\nStudio: First Run Features\n\nJames Carroll's Constantine's Sword, or Constantine's Sword, is a 2007 historical ocumentary film on the relationship between the Catholic Church and Jews. Directed and produced by Oscar-nominated filmmaker Oren Jacoby, the film is inspired by former priest James P. Carroll's 2001 book Constantine's Sword.\n\nSynopsis\n\nThe title page of this film shows the shadow of a cross, with &quot;No war is holy&quot; written across the transept. Constantine's Sword is the story of James P. Carroll's journey to uncover the roots of war. Carroll, a former Catholic priest whose father (Joseph Carroll) was a famous Air Force general, implies that there has been a relationship between religiously inspired violence and war, beginning with the adoption of Christianity by the Roman Emperor Constantine I in 312 AD. Constantine was convinced that he had won a battle because he had followed the instructions of a vision, to inscribe a sign of the cross (the Labarum) on the shields of his soldiers. In Carroll's view, this event marked the beginning of an unholy alliance between the military and the Church.\n\nCarroll focuses on Catholic and evangelical anti-Judaism, and invokes the cross as a symbol of the long history of Christian xenophobic violence against Jews and non-Christians, from the Crusades, through the Roman Inquisition and the creation of the Jewish ghetto, to the Holocaust. Carroll also charges that there is an ongoing evangelical infiltration of the U.S. military, and that this has had negative consequences for U.S. foreign policy. The film's final chapter, &quot;No war is holy&quot;, concludes with views of military cemeteries as Aaron Neville sings &quot;With God On Our Side&quot;.","torrent":{"xt":"urn:btih:e7aff942213027f59ab8ebac2a5520a2e43b10e1","amp;dn":"Constantine%27s.Sword.2007-Catholic.Church.%26amp%3B.Antisemitism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7aff942213027f59ab8ebac2a5520a2e43b10e1","infoHashBuffer":{"type":"Buffer","data":[231,175,249,66,33,48,39,245,154,184,235,172,42,85,32,162,228,59,16,225]},"announce":[],"urlList":[]}}