{"title":"Ninja Hacking: Unconventional Penetration Testing Tactics and Te","uid":7876434,"size":10333218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e83f4807ad69c3bee84298b23b47b90dc2436769&amp;dn=Ninja+Hacking%3A+Unconventional+Penetration+Testing+Tactics+and+Te&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NepsterJay","files":1,"time":1354358245,"description":"[img]http://i.walmartimages.com/i/p/97/81/59/74/95/9781597495882_500X500.jpg[/img]\n\nEver thought of using the time-tested tactics and techniques of the ancient ninja to understand the mind of today's ninja, the hacker? As a penetration tester or security consultant you no doubt perform tests both externally and internally for your clients that include both physical and technical tests. Throw traditional pen testing methods out the window for now and see how thinking and acting like a ninja can actually grant you quicker and more complete access to a company's assets. Get in before the hacker does with these unorthodox techniques. Use all of the tools that the ninja has: disguise, espionage, stealth, and concealment. Learn how to benefit from these tools by laying your plans, impersonating employees, infiltrating via alarm system evasion, discovering weak points and timing, spyware and keylogging software, and log manipulation and logic bombs. And, really, don't you want to be a ninja for a day just because they're cool? Let this book be your excuse!\n\nDiscusses techniques used by malicious attackers in real-world situations\nDetails unorthodox penetration testing techniques by getting inside the mind of a ninja\nExpands upon current penetration testing methodologies including new tactics for hardware and physical attacks\n\nProduct Details\nPaperback: 376 pages\nPublisher: Syngress; 1 edition (September 24, 2010)\nLanguage: English\nISBN-10: 1597495883\nISBN-13: 978-1597495882","torrent":{"xt":"urn:btih:e83f4807ad69c3bee84298b23b47b90dc2436769","amp;dn":"Ninja+Hacking%3A+Unconventional+Penetration+Testing+Tactics+and+Te","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e83f4807ad69c3bee84298b23b47b90dc2436769","infoHashBuffer":{"type":"Buffer","data":[232,63,72,7,173,105,195,190,232,66,152,178,59,71,185,13,194,67,103,105]},"announce":[],"urlList":[]}}