{"title":"Torchwood For iPod Seasons 1-4","uid":7832167,"size":7126356824,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:e899a2c278218621b3cad6c9cf0ad675bff6a432&amp;dn=Torchwood+For+iPod+Seasons+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0victor0","files":41,"time":1353081245,"description":"These are files optimized for the Classic iPod, specifically the iPod Classic 5G. They are MP4s.\n\nIt contains Season 1-4, all widescreen and a nice clear picture. All the episodes have been tagged in iTunes so that they will play when they're supposed to. All you have to do is add them in iTunes, and tell iTunes that they are TV episodes.\n\nI have added the description of each episode in iTunes, as well as the original broadcast date.\n\nI plan on uploading future seasons if they are ever aired (right now there is no definite yes or no on whether there will be more).\n\nIf you notice any issues with any files, please leave a comment. I've tried to make sure that there are no issues, but I haven't had the chance to watch through all the converted episodes.\n\nThe reason for uploading this is that when I went looking for some Doctor Who for my iPod, I noticed that the available torrents where low quality and inconsistent. I decided to convert it myself, and here we are. I'm now converting several series for personal use (as I noticed most series suffered from bad quality iPod uploads) and will be uploading them on here as I finish. If there is a specific series you'd like to see, let me know in the comments. I won't promise to convert and upload it, but if it's on my list, I'll move it up to the front of the line. :)\n\nI had converted the video at various bitrates to find the perfect blend of quality versus size. I tried 200kbps, I even tried 1000kbps. I found that there was nearly no difference between 300kbps and 1000kbps on such a small screen. I would have had to convert it at 600 or 700kbps in order to get the quality better, and the visual difference was unnoticeable 99% of the time, and barely noticeable the other 1% of the time. And converting it at such a high bitrate doubled the size. I decided to stick with 300kbps. This may change if I ever have to use a lower quality source, however for high quality DVD Rips and HD BD Rips, this provides a clear, consistent picture.\n\n\n\nThis torrent is on a Seedbox, so there should be no issues with speed. I'll be leaving it on there for a while, until there's a healthy Seed pool (the last one I seeded to a ratio of 119:1, that's 1.74TB uploaded! 0_o). This is my second torrent, so if there are any problems, I apologize.\n\nI hope you enjoy, and remember, if you like the show, buy it!\n\n(Also for those interested, I also uploaded Doctor Who (2005) Seasons 1-6 and Specials in the same format. Just check out my uploaded torrents.)\n\n\n(Now for a little technical info on the rips):\n\n\nThese are converted using HandBrake, with custom settings. I rip the video with an average bitrate of 300kbps at 320x192, audio is AAC 160kbps.\n\nVideo Codec: H.264\t\t","torrent":{"xt":"urn:btih:e899a2c278218621b3cad6c9cf0ad675bff6a432","amp;dn":"Torchwood+For+iPod+Seasons+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e899a2c278218621b3cad6c9cf0ad675bff6a432","infoHashBuffer":{"type":"Buffer","data":[232,153,162,194,120,33,134,33,179,202,214,201,207,10,214,117,191,246,164,50]},"announce":[],"urlList":[]}}