{"title":"The Ed Show 11-13-12.mp4","uid":7830446,"size":188110166,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e9e4260d65b2521b3abffc3ce67be68dde2f65a1&amp;dn=The+Ed+Show+11-13-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1353038361,"description":"The Ed Show; November 13, 2012.\n\n It's crunch time for the middle class and President Obama is refusing to budge on taxes.\n\nEd welcomed Sen. Sherrod Brown (D-OH) and Mary Kay Henry (International President, Service Employees International Union), who met with the president on (11/13/12).\n\nThen, Paul Ryan said he was &quot;shocked&quot; by the turnout of voters in &quot;urban areas.&quot; The Ed Show went inside the bubble of Paul Ryan's first interview since his epic loss. Ed had reaction from State Sen.Nina Turner (D-OH).\n\nThe David Petraeus scandal is the right wing's latest shiny object and it turned out it all started with an attempt to smear the president. Karen Finney (MSNBC Political Analyst and Former DNC Communications Director), weighed in on that.\n\nThe mayor of cable news still can't believe white men are losing their grip on power. Michael Eric Dyson (Professor of Sociology at Georgetown University and author of &quot;Can You Hear Me Now?&quot;), and Joan Walsh (Salon's Editor at Large, and author of &quot;What's The Matter With White People? Why We Long For A Golden Age That Never Was&quot;) broke down Bill O'Reilly's latest tirade\n\nConsumers are turning up the heat on Donald Trump. Ed had the details on that.\n\nAnd in the Big Finish, the far right was so upset by President Obama's re-election, they signed petitions to secede from the Union! Jim Moore (co-author of &quot;Bush's Brain&quot; and a MSNBC and Huffington Post contributor), told how serious this secession movement is (if it is serious).","torrent":{"xt":"urn:btih:e9e4260d65b2521b3abffc3ce67be68dde2f65a1","amp;dn":"The+Ed+Show+11-13-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e4260d65b2521b3abffc3ce67be68dde2f65a1","infoHashBuffer":{"type":"Buffer","data":[233,228,38,13,101,178,82,27,58,191,252,60,230,123,230,141,222,47,101,161]},"announce":[],"urlList":[]}}