{"title":"BBC Wartime Farm Christmas 2012","uid":7938732,"size":735011781,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ea47aafe002104aee898e37b8c64e6c3773f003b&amp;dn=BBC+Wartime+Farm+Christmas+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1355928802,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/b01pgr4b&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/b01pgr4b&lt;/a&gt;\n\nFollowing the huge success of the Wartime Farm series - watched by over three \nmillion viewers a week during its eight week run - historian Ruth Goodman and \narchaeologist Peter Ginn are returning to Manor Farm in Hampshire to recreate \nthe conditions of Christmas 1944.\n\n1944 saw the sixth Christmas at war, and shortages were biting deeper than \never. Added to this, Britain's cities were in the grip of the worst German \nattacks since the Blitz of 1940. Unmanned flying bombs - the dreaded V1 \n'Doodlebugs' and V2 rockets - rained down, stretching morale and services to \nbreaking point. \n\nHaving been set the target of doubling home-grown food production by the \ngovernment, Britain's farmers had already ploughed up six and a half million \nadditional acres in the drive for additional crops (an area equivalent in size \nto the whole of Wales). Now, in addition to maintaining food production, it \nfell to Britain's farmers to come to the aid of the nation's urban dispossessed \nin their hour of need. Many rural women joined the one million-strong Women's \nVoluntary Service to provide food, drink and gifts to lift the spirits - \nespecially at Christmas. Ruth finds out how the WVS operated the government's \nNational Pie Scheme.\n\nBeer was seen as so essential to the nation's morale that it was never rationed \n- but a vital ingredient, barley, was in short supply, so substitutes were \nneeded. Peter calls upon rural crafts expert, Colin Richards, to brew some \nimprovised potato beer for Christmas. Meanwhile, Ruth comes up with innovative \npresents for children, and ingenious festive decorations made from scraps.\n\nAfter enjoying a Christmas church service for the community at Manor Farm, \nincluding German prisoners-of-war who, along with Italian POWs, accounted for \none in five of the farming labour force in Britain by Christmas 1944, and had \nbecome surprisingly well-integrated into some rural communities. Following in \nthe footsteps of many wartime rural farmers, Peter and Ruth transport their \ngifts, food and beer on a vintage wartime steam train to Chislehurst Caves - 10 \nmiles outside London - where they discover what Christmas was like for some of \nthe 15,000 people who sheltered in the caves.\n\nFollowing recipes and guidelines issued by the government and the WVS, Ruth \ncooks an improvised Christmas meal, relying chiefly on rabbit and a glut of \ncarrots from the farm. And the Salvation Army bring musical cheer to the \noccasion as the team reflect on the impact of what was to be the last Christmas \nof the Second World War. \n\nWartime Farm was produced in partnership with The Open University.\n","torrent":{"xt":"urn:btih:ea47aafe002104aee898e37b8c64e6c3773f003b","amp;dn":"BBC+Wartime+Farm+Christmas+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea47aafe002104aee898e37b8c64e6c3773f003b","infoHashBuffer":{"type":"Buffer","data":[234,71,170,254,0,33,4,174,232,152,227,123,140,100,230,195,119,63,0,59]},"announce":[],"urlList":[]}}