{"title":"Barry &amp; The Remains - The Remains [Epic-Legacy] (1991)","uid":8562472,"size":330160867,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eae071da9469c75506e47c115edca48e081b256a&amp;dn=Barry+%26amp%3B+The+Remains+-+The+Remains+%5BEpic-Legacy%5D+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":36,"time":1370917164,"description":"This is the same torrent that was uploaded to Demonoid in August 2008.\n\n\nBarry &amp; The Remains - The Remains [Epic/Legacy] (1991)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51WfRuHYjLL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51WfRuHYjLL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 8 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nA strong contender for the finest overlooked American band of the mid-'60s, the Remains (led by Barry Tashian) were the most notable Boston group of the era. But they never broke out nationally, despite signing to Epic and copping an opening slot on the Beatles' final American tour in 1966. Sometimes described as a garage band, that designation isn't at all accurate; the Remains shared the same British Invasion influences as many American teen acts, but had a lot of professional finesse to their straight-ahead attack and sharp songwriting, sometimes sounding like a fusion of the Beatles and the Zombies with their energetic harmonies and guitar-electric keyboard blend.\n\nFour fine singles for Epic found little action outside of the Northeast. Frustrated by the disparity they perceived between their studio work and their furious live show, they cut an audition tape for Capitol, although no offer from the label was forthcoming (the session was issued for collectors many years later). An uneven but solid debut album for Epic was released near the end of 1966, but by that time the Remains were breaking up, dispirited by the stalemate in which their career seemed to have been mired. Remains drummer N.D. Smart II played with Gram Parsons and Emmylou Harris; Tashian also played with Harris, and today is a Nashville-based country-folk musician, often recording as a duo with his wife, Holly.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:fifexqw5ldse~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:fifexqw5ldse~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nMost 1960s garage rock obsessives collect singles rather than albums for a good reason: While plenty of snarling teenagers could come up with two decent songs at a stretch, a precious few seemed able to brainstorm a dozen tunes without reaching to the bottom of the barrel or resorting to covers of other people's hits. But there were exceptions to this rule, among them the Sonics, the Litter, and, especially, the Remains, who never enjoyed much success on the national charts but were fabled heroes in their home town of Boston. The Remains' 1966 album for Epic is a classic, packed with great songs from singer/guitarist Barry Tashian, bassist Vern Miller, and pianist Bill Briggs, and boasting exciting, fiery performances, and if the full firepower of their legendary live shows didn't always come through on tape, even the album's weakest moments made clear the Remains were tougher, smarter, and tighter than the vast majority of their competition. The Remains is mid-'60s American rock &amp; roll at it's best, and you don't have to own any paisley clothing to enjoy it. [When Epic/Legacy reissued the album in 1991 (with the band's name augmented to Barry and the Remains), they added a handful of non-LP singles and unreleased tracks and gave the album a crisp digital remix, and against all odds, Epic actually improved a masterpiece. If the old analog version sounds harder and dirtier (a good thing for garage rock), the CD allows you to hear more of the details, and nearly every one of the 21 cuts on board is killer stuff (their cover of Don Covay's &quot;Mercy, Mercy, Mercy&quot; shows them beating the Rolling Stones at their own game, and after you've heard &quot;Don't Look Back,&quot; you'll always wonder why it wasn't a Top Ten hit).]\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:0ifrxql5ldke&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:0ifrxql5ldke&lt;/a&gt;\n\nReviews and sound samples can be found here: &lt;a href=&quot; http://www.amazon.com/dp/B0000027FH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000027FH&lt;/a&gt;\n\nTrack List:\n\n01. Why Do I Cry\n02. When I Want To Know\n03. Ain't That Her\n04. All Good Things\n05. I'm Talking 'bout You\n06. My Babe\n07. Say You're Sorry\n08. Baby I Believe In You\n09. You Got A Hard Time Comin'\n10. I Can't Get Away From You\n11. Me Right Now\n12. Time Of Day\n13. Once Before\n14. But I Ain't Got You\n15. Diddy Wah Diddy\n16. Mercy, Mercy, Mercy\n17. Lonely Weekend\n18. Heart\n19. Thank You\n20. Say You're Sorry\n21. Don't Look Back\n","torrent":{"xt":"urn:btih:eae071da9469c75506e47c115edca48e081b256a","amp;dn":"Barry+%26amp%3B+The+Remains+-+The+Remains+%5BEpic-Legacy%5D+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eae071da9469c75506e47c115edca48e081b256a","infoHashBuffer":{"type":"Buffer","data":[234,224,113,218,148,105,199,85,6,228,124,17,94,220,164,142,8,27,37,106]},"announce":[],"urlList":[]}}