{"title":"Anal.Inferno.2.DiSC2.XXX.DVDRip","uid":8678019,"size":1116103682,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:eb9ca812f5612ffa23e8a1ebda40bc1b54293c14&amp;dn=Anal.Inferno.2.DiSC2.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1373639406,"description":"Porn superstud and uber-pervert Mike Adriano is ready to set your screen on fire with his hot, new two-disc collection of outrageously filthy butt play. In five epic encounters featuring the most gorgeous and talented anal starlets around, Mike plunders big, gaping booties and captures extreme prolapses, raunchy rim jobs and nasty ass-to-mouth cocksucking with his signature POV+ camerawork. This one is a scorcher! First, stunning brunettes Cici Rhodes and Sarah Shevon go the limit in a sick rectal three-way, gagging on the directors massive cock and wetly tonguing every bunghole in sight. Amid the intense butt-fucking and insane anal gapes, Sarah ejaculates a squirting climax and makes her colon bloom like a fleshy, glistening rose. Next, busty blonde Leya Falcon squeezes her gigantic knockers and chokes on dick until her cleavage is slathered with spit, then gets her anus pumped full of meat until Mike spurts cum into her open mouth. Scarlett Wild and Claire Robbins get their most twisted butthole fantasies fulfilled and share a gooey load. Adorable blonde Sierra Day endures a backdoor trial by fire in her very first anal scene, prolapsing like a champ. Sweet sluts Liv Aguilera and Cassandra Nix get rudely and happily sodomized while savoring each others asshole flavor. There`s also a bonus three-way butt-fuck is for fans that take their rectal obsessions deeply. Burn, baby, burn!\n\nCassandra Nix, Cici Rhodes, Claire Robbins, Krissy Lynn, Leya Falcon, Liv Aguilera, Mariah Madysinn, Mike Adriano, Sarah Shevon, Scarlett Wild, Sierra Day\n\n\n  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=analinfern.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=analinfern.jpg&lt;/a&gt;\n\n\ncd1  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=analinfsf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=analinfsf.jpg&lt;/a&gt;\n\ncd2  &lt;a href=&quot;\nhttp://www.fastpics.net/?v=analinbnb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=analinbnb.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:eb9ca812f5612ffa23e8a1ebda40bc1b54293c14","amp;dn":"Anal.Inferno.2.DiSC2.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb9ca812f5612ffa23e8a1ebda40bc1b54293c14","infoHashBuffer":{"type":"Buffer","data":[235,156,168,18,245,97,47,250,35,232,161,235,218,64,188,27,84,41,60,20]},"announce":[],"urlList":[]}}