{"title":"Sexually Broken--Bella Rossis mouth gagged open Bella Rossi  Mat","uid":7810183,"size":1055337724,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ef2cf15e42bf3c5f212e68ff3762dde0d246dffe&amp;dn=Sexually+Broken--Bella+Rossis+mouth+gagged+open+Bella+Rossi++Mat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1352505578,"description":"Bella Rossi's mouth is gagged open, rough skull fucking, dicked down from behind, brutal orgasms! | Bella Rossi | Matt Williams\n\nNovember 9, 2012\n\n\nMP4 only.\n\n\nWelcome Bella Rossi to Sexually Broken. Bella was exclusive to \nKink, not any more. Welcome her to the best sex and submission \nrope bondage site on the net.\n\nBella finds herself bound to the nines, completely helpless in \na doggy style position. Her amazing ass just sticking up with \nher wet pussy totally exposed. Her huge breasts are tightly \nbound and pulled painfully out and to the sides. She is \nsporting a nylon stocking mask with a huge ring gag to keep \nher sexy mouth and throat open. We blindfolded Bella with \nelectrical tape, she has no idea what is going to happen to \nher. Her hair is bound back, keeping her face at the perfect \nhight for a brutal rough throat pounding. \n\nNow is the time to completely destroy this beautiful girl with \ncock. We start with a long and devastating throat fuck. With \nher mouth bound open the cock goes past all her defenses and \ndown the back of her throat at will. Breath play at it's best. \nBella gags, spits, and suffers as the cock thoroughly fucks \nher into subspace. She breathes when we let her, and we like \nit when girls can't breathe. She goes into survival mode, \nstealing air when she can. We are relentless but Bella endures \nlike a professional, never letting the cock get the best of \nher. A heroic effort.\n\nWe move to the back, our cock easily slides into her wet tight \ncunt. She moans, and we destroy the pussy with hard pounding \naction. Within seconds we make Bella cum. She begs for \npermission but before we can answer she is cumming anyways. We \nfuck her to several brutal orgasms then quickly move to fuck \nher throat again. Back and forth we completely overload Bella \nwith breath control and orgasms.\n\nWe pull out the vibrator for the coup de grace, we make Bella \ncum so hard and often she is begging for us to stop. She has \nno power, mentally or physically to stop us from making her \ncum. She is broken, cumming and moaning for mercy. Just like \nwe love them... \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_09bella2/SexuallyBroken-Bella-Rossi-Matt-Williams-Bella-Rossi-mouth-is-gagged-open-rough-skull-fucking-dicked-down-from-behind-brutal-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_09bella2/SexuallyBroken-Bella-Rossi-Matt-Williams-Bella-Rossi-mouth-is-gagged-open-rough-skull-fucking-dicked-down-from-behind-brutal-orgasms.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:ef2cf15e42bf3c5f212e68ff3762dde0d246dffe","amp;dn":"Sexually+Broken--Bella+Rossis+mouth+gagged+open+Bella+Rossi++Mat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef2cf15e42bf3c5f212e68ff3762dde0d246dffe","infoHashBuffer":{"type":"Buffer","data":[239,44,241,94,66,191,60,95,33,46,104,255,55,98,221,224,210,70,223,254]},"announce":[],"urlList":[]}}