{"title":"Sunset Blvd. (1950) William Holden","uid":7872970,"size":1476870704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f16357cdf9a7b62a031e72e81242be75feb7720b&amp;dn=Sunset+Blvd.+%281950%29+William+Holden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"johnefp","files":-1,"time":1354264558,"description":"Billy Wilder's Sunset Boulevard ranks among the most scathing satires of Hollywood and the cruel fickleness of movie fandom. The story begins at the end as the body of Joe Gillis (William Holden) is fished out of a Hollywood swimming pool. From The Great Beyond, Joe details the circumstances of his untimely demise (originally, the film contained a lengthy prologue wherein the late Mr. Gillis told his tale to his fellow corpses in the city morgue, but this elicited such laughter during the preview that Wilder changed it). Hotly pursued by repo men, impoverished, indebted &quot;boy wonder&quot; screenwriter Gillis ducks into the garage of an apparently abandoned Sunset Boulevard mansion. Wandering into the spooky place, Joe encounters its owner, imperious silent star Norma Desmond (Gloria Swanson). Upon learning Joe's profession, Norma inveigles him into helping her with a comeback script that she's been working on for years. Joe realizes that the script is hopeless, but the money is good and he has nowhere else to go. Soon the cynical and opportunistic Joe becomes Norma's kept man. While they continue collaborating, Norma's loyal and protective chauffeur Max Von Mayerling (played by legendary filmmaker Erich von Stroheim) contemptuously watches from a distance. More melodramatic than funny, the screenplay by Wilder and Charles Brackett began life as a comedy about a has-been silent movie actress and the ambitious screenwriter who leeches off her. (Wilder originally offered the film to Mae West, Mary Pickford and Pola Negri. Montgomery Clift was the first choice for the part of opportunistic screenwriter Joe Gillis, but he refused, citing as &quot;disgusting&quot; the notion of a 25-year-old man being kept by a 50-year-old woman.) Andrew Lloyd Webber's long-running musical version has served as a tour-de-force for contemporary actresses ranging from Glenn Close to Betty Buckley to Diahann Carroll.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0043014/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0043014/?ref_=fn_al_tt_1&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-469&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-469&lt;/a&gt;\n\n[Video]\nResolution : 720x544\nCodec : XviD MPEG-4 codec\nFPS : 23,98\nBitRate : 1648 Kbps\nQuality Factor : 0,18 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps","torrent":{"xt":"urn:btih:f16357cdf9a7b62a031e72e81242be75feb7720b","amp;dn":"Sunset+Blvd.+%281950%29+William+Holden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f16357cdf9a7b62a031e72e81242be75feb7720b","infoHashBuffer":{"type":"Buffer","data":[241,99,87,205,249,167,182,42,3,30,114,232,18,66,190,117,254,183,114,11]},"announce":[],"urlList":[]}}