{"title":"Tara Jane O'Neil - In Circles [2006][EAC,log,cue. FLAC]","uid":8531621,"size":216193215,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1a908aff7cc3d01dd2a3036e91c50cd8bee0ba4&amp;dn=Tara+Jane+O%27Neil+-+In+Circles+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":12,"time":1370168328,"description":"Artist: Tara Jane O'Neil\nRelease: In Circles\nReleased: 2006\nLabel: Quarterstick Records\nCatalog#: QS96CD\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: americana, folk Rock\n\n01. Primer\n02. A Partridge Song\n03. The Louder\n04. A Sparrow Song\n05. A Room for These\n06. Blue Light Room\n07. Need No Pony\n08. Fundamental Tom\n09. The Looking Box\n10. This Beats\n\nJohn Schacht, allmusic.com wrote:\nAmid the hoopla surrounding strong 2006 releases from female musicians like Neko Case, Chan Marshall, Isobel Campbell, Ane Brun, Jolie Holland, and Beth Orton, the most affecting of the bunch may just be Tara Jane O'Neil's In Circles. Recorded in empty wooden houses around her current hometown of Portland, OR, In Circles' songs seem to arise out of the forest, rivers, sea, and dramatic vistas of the Pacific Northwest as though part of the aural and scenic landscape. O'Neil mostly eschews the twangy accents and full-band sound of 2004's You Sound, Reflect here, resulting in airier, less dense, and more delicate arrangements. She instead focuses her accomplished guitar playing on overlapping lines that chime like the clear, ringing tones Tom Verlaine pulls from his instrument. Accents like flute, melodica, and hushed percussion add to the ethereal nature of the music, but that doesn't make the record any less substantial. Where You Sound, Reflect seemed to bemoan the frail state of human relations, In Circles seeks balance back in natural surroundings, as imagery from the five elements -- Wood, Fire, Earth, Metal and Water -- color O'Neil's lyrics at almost every turn. &quot;Oh the light from the sky it pours into the sound,&quot; she sings hymn-like on &quot;The Louder,&quot; while &quot;The Looking Box&quot; opens with a similarly evocative couplet: &quot;Outside of my looking box/A breath waiting for me/It knows how light I'd be/One step down from my looking box/Where river meets the sea/And there it carried me.&quot; To match the mood, there's a timeless, acoustic Brit folk feel coursing through some songs (&quot;A Partridge Song,&quot; &quot;A Sparrow Song,&quot; and the Nick Drake-like &quot;Need No Pony&quot;), while others are swathed in misty atmospheric tape loops and textured guitar layers (&quot;Fundamental Tom,&quot; and instrumental album bookends &quot;Primer&quot; and &quot;This Beats&quot;). &quot;Blue Light Room&quot; even reprises a classic Nashville Skyline-country feel, with assistance from the graceful pedal steel of Lewy Longmeyer (Michael Hurley Band). No matter the styles or influences, O'Neil's vocals -- a whispered siren's cry, like Hope Sandoval crossed with Orton -- resonate seamlessly with the music, reinforcing the record's organic feel. Not a word or tone seems superfluous here, each element's arrangement serving the song in harmony with the rest, echoing the Euclidean perfection of the album's namesakes.","torrent":{"xt":"urn:btih:f1a908aff7cc3d01dd2a3036e91c50cd8bee0ba4","amp;dn":"Tara+Jane+O%27Neil+-+In+Circles+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a908aff7cc3d01dd2a3036e91c50cd8bee0ba4","infoHashBuffer":{"type":"Buffer","data":[241,169,8,175,247,204,61,1,221,42,48,54,233,28,80,205,139,238,11,164]},"announce":[],"urlList":[]}}