{"title":"WhatsApp PLUS v2.70 (Mod version) - ARMANI","uid":7922352,"size":6748699,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f262731edc5273fd993bc3ff92c07300186ea74e&amp;dn=WhatsApp+PLUS+v2.70+%28Mod+version%29+-+ARMANI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ARMANI","files":-1,"time":1355502778,"description":"Requirements: Android v2.1+\n\nOverview: \n\nWhatsApp Messenger is a smartphone messenger available for Android, BlackBerry, iPhone, Windows Phone and Nokia phones. \n\nWhatsApp uses your 3G or WiFi (when available) to message with friends and family. Switch from SMS to WhatsApp to send and receive messages, pictures, audio notes, and video messages. First year FREE! ($1.99/year after)\n\nWHY USE WHATSAPP:\n\nâ˜… NO HIDDEN COST: Once you and your friends download the application, you can use it to chat as much as you want. Send a million messages a day to your friends for free! WhatsApp uses your Internet connection: 3G/EDGE or Wi-Fi when available.\n\nâ˜… MULTIMEDIA: Send Video, Images, and Voice notes to your friends and contacts.\n\nâ˜… GROUP CHAT: Enjoy group conversations with your contacts.\n\nâ˜… NO INTERNATIONAL CHARGES: Just like there is no added cost to send an international email, there is no cost to send WhatsApp messages internationally. Chat with your friends all over the world as long as they have WhatsApp Messenger installed and avoid those pesky international SMS costs.\n\nâ˜… SAY NO TO PINS AND USERNAMES: Why even bother having to remember yet another PIN or username? WhatsApp works with your phone number, just like SMS would, and integrates flawlessly with your existing phone address book.\n\nâ˜… NO NEED TO LOG IN/OUT: No more confusion about getting logged off from another computer or device. With push notifications WhatsApp is ALWAYS ON and ALWAYS CONNECTED.\n\nâ˜… NO NEED TO ADD BUDDIES: Your Address Book is used to automatically connect you with your contacts. Your contacts who already have WhatsApp Messenger will be automatically displayed under Favorites, similar to a buddy list. (You can of course always edit Favorites any way you like)\n\nâ˜… OFFLINE MESSAGES: Even if you miss your push notifications or turn off your phone, WhatsApp will save your messages offline until you retrieve them during the next application use.\n\nâ˜… AND MUCH MORE: Share location, Exchange contacts, Custom wallpaper, Custom notification sounds, Landscape mode, Precise message time stamps, Email chat history, Broadcast messages and MMS to many contacts at once and much much more!\n\nNote:This is a Mod version of WhatsAppï¼Œwith many extra functions\n\nChangelog v2.70 (14/12/2012)\n-Base updated: 289108\n-More HoLo (HoLo theme in PLUS options, settings an other views)\n-Chat Contact Pic MOD, show contact pic on every message, in OTHER MODs (only contacts with profile picture, doesn't work on groups)\n-MOD to show your pic on every message, in OTHER MODs\n-MOD to set pic size on messages\n-1.1.2 Chat Photo Size can be 0 now\n-Seekbar control behaviour improved\n-Music sharing option not added for the moment\n-Known bug: Popup won't show when screen blocked\n\nThis app has no advertisements\n\nMore Info:\nCode:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.whatsapp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.whatsapp&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f262731edc5273fd993bc3ff92c07300186ea74e","amp;dn":"WhatsApp+PLUS+v2.70+%28Mod+version%29+-+ARMANI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f262731edc5273fd993bc3ff92c07300186ea74e","infoHashBuffer":{"type":"Buffer","data":[242,98,115,30,220,82,115,253,153,59,195,255,146,192,115,0,24,110,167,78]},"announce":[],"urlList":[]}}