{"title":"Soniccouture Abstrakt Breaks [Rex2] [loopville]","uid":8512139,"size":191069279,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f451f4907700fe3368bfbf412f16bf8cd8fbb3ee&amp;dn=Soniccouture+Abstrakt+Breaks+%5BRex2%5D+%5Bloopville%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"loopville23","files":202,"time":1369606675,"description":"A quick not from the manufacturer\n\nAbstrakt Breaks is a superb collection of complex, exciting hi-tech drum loops. Ideal for producers of Electronica, IDM, Glitch, Industrial and Film soundtracks, this collection sets a new standard for Loop Libraries. Produced and mastered at 24 bit, the sparkling sharp sound ensures you have a full frequency range to shape and mould into your production.\n\n\n\n\nRecycle REX2 24 bit unless otherwise stated.\n\nThese loops have been optimized for use with Spectrasonics Stylus RMX  VST. Some file names have been changed to comply \n\nwith the Stylus RMX Sage Converter filename limitations. The Packs have been organized to allow the user to drag and \n\ndrop directly into the Sage Converter. Use of the packs with other software such as Propellerheads Reason is possible \n\nbut not optimized!. These packs do NOT contain any wav files and, as ever, if you use and like them please support the \n\nartist concerned and buy the original from their website. Most rex2 files in the collections are 24 bit unless otherwise stated and some contain the relevant midi files if included with the original release. \nThese packs are not originals and i do not claim to be the original uploader!! NUFF Respect to the original uploader !!! \n\n(as always)....Unfortunately the original tags from individual uploaders had been erased before the making of these \n\nre-packs and they cannot be credited....Anyone feeling aggrieved at this is welcome to be in touch but unfortunately it \n\nwas out of my control before i was able to re-pack them!\n\n\nEnjoy!","torrent":{"xt":"urn:btih:f451f4907700fe3368bfbf412f16bf8cd8fbb3ee","amp;dn":"Soniccouture+Abstrakt+Breaks+%5BRex2%5D+%5Bloopville%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f451f4907700fe3368bfbf412f16bf8cd8fbb3ee","infoHashBuffer":{"type":"Buffer","data":[244,81,244,144,119,0,254,51,104,191,191,65,47,22,191,140,216,251,179,238]},"announce":[],"urlList":[]}}