{"title":"Taiwan Tens - SetS 131-140 (1080P)","uid":7858392,"size":2234188833,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:f560026a84e636cd411def5494d7f298b20f8575&amp;dn=Taiwan+Tens+-+SetS+131-140+%281080P%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"T-10","files":10,"time":1353849531,"description":"Screenshots for these and previous files are on asianbeautyleg.com under VIDEO\n\nJust click the T-10 link (above) to see all of the previous torrents in this series.\n\nThanks for sharing and thanks tremendously for the help seeding.\n\nIncluded in this torrent:\n\n131. Miya\n132. Olivia\n133. Jill\n134. Morning\n135. Lynn\n136. Evenni\n137. Miya\n138. Nana\n139. Aileen\n140. Olivia\n\nQ&amp;A Time\n\nQ.  Why do you think these ladies are all 10's?\nA.  Actually I don't!  They're all a lot better than I could personally hope to attract, but I don't really see Olivia and Eva as &quot;that&quot; attractive, and Yoyo is not my type at all.  Avy and Sara are perfect tens by my own tastes, but each man has his own standards.  We all have different &quot;turn-ons&quot;.\n\nI was told once that a ONE and a TEN are impossibilities, because a ONE is so ugly, she's either locked away like the elephant man or shot on sight to prevent the genetics being perpetuated... and a TEN is kept hidden away from sight so that men don't go crazy trying to get to her.  So really there is only a scale of 2-9.  And where you rank any woman has to be according to your tastes.  I would never be interested in Kim Kardashian for instance, or any other big butt woman, and plastic boobs or big feet are terrible turn-offs... but those are my own preferences and thankfully some men do like those things, so that most women find a mate and most men are at least temporarily happy (I won't get into my opinions about &quot;temporary&quot;.\n\nQ.  Why are these torrents listed under Porn (other) instead of Video (other)?\nA.  Originally I had them in Video, but couldn't find enough people to keep them seeded... nobody looks there.  I suggest you just look at the screenshots and streams at asianbeautyleg.com and decide for yourself if you want this collection (I am trying to use their numbering system to make that easy).  I think you'll at least find a few that you like.  But there's no stuffing, boffing, sucking or even suggestive wiggling going on in these videos... you'll have plenty of those available from the other guys. :)  The T-10 torrents are all pretty big 1080P videos and you sure don't want to download the whole thing just to see what it is, so check the website OR just pull down one file from one of the torrents... easy enough.\n \t","torrent":{"xt":"urn:btih:f560026a84e636cd411def5494d7f298b20f8575","amp;dn":"Taiwan+Tens+-+SetS+131-140+%281080P%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f560026a84e636cd411def5494d7f298b20f8575","infoHashBuffer":{"type":"Buffer","data":[245,96,2,106,132,230,54,205,65,29,239,84,148,215,242,152,178,15,133,117]},"announce":[],"urlList":[]}}