{"title":"Dragon Ball Z Kai Season 1 Part 1-6 Yify","uid":7842331,"size":7648289316,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f59527f0da12ff242d723ab383ef9297ca99c967&amp;dn=Dragon+Ball+Z+Kai+Season+1+Part+1-6+Yify&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gambit18","files":91,"time":1353372437,"description":"Dragon Ball Z Kai (known in Japan as Dragon Ball Kai) is a revised version of the anime series Dragon Ball Z produced in commemoration of the original's 20th anniversary. It features remastered high definition picture, sound, and special effects as well as a re-recorded voice track by most of the original cast.[3] As most of the series' sketches and animation cels had been discarded since the final episode of Dragon Ball Z in 1996, new frames were produced by digitally tracing over still frames from existing footage and filling them with softer colors; thus reducing visible damage to the original animation. Some frames were selectively cropped, while other frames feature new portions added to scenes that were hand drawn to conform to the designated picture ratio. Much of the material from the Dragon Ball Z anime that was not featured in the Dragon Ball manga has been left out in Kai; significantly reducing the total episode count.[4] Thus, Kai is more of a streamlined re-telling of the series focusing more on the material that was in the manga and taking out the extra content of the original anime that was used to pad out the series.","torrent":{"xt":"urn:btih:f59527f0da12ff242d723ab383ef9297ca99c967","amp;dn":"Dragon+Ball+Z+Kai+Season+1+Part+1-6+Yify","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f59527f0da12ff242d723ab383ef9297ca99c967","infoHashBuffer":{"type":"Buffer","data":[245,149,39,240,218,18,255,36,45,114,58,179,131,239,146,151,202,153,201,103]},"announce":[],"urlList":[]}}