{"title":"[ExploitedCollegeGirls] Hazel From Tarrant County College (07.12","uid":8676943,"size":311115986,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f5aba5177e4536e8fc7ff1a74df02fa92974d621&amp;dn=%5BExploitedCollegeGirls%5D+Hazel+From+Tarrant+County+College+%2807.12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1373619855,"description":"[ExploitedCollegeGirls] Hazel From Tarrant County College (07.12.2013)\n\nMy run of horny, slutty 18 year olds continues this week when I assfuck this self confessed naughty country girl from Texas in one of the most eventful ECG updates in a long time. How naughty is she? Well every story she tells me in the interview sounds like the plot to a big budget porno movie like the time she had a lesbian 3 way with two cousins, for example.\nAfter getting to know Hazel better and finding out just what a freak she is, I'm excited to get her naked. She admitted to masturbating several times a day but confessed that she can't afford any sex toys on her starving student budget, so I'm itching to blow her mind. She strips and reveals a pair of very perky B cups and a body built for banging. I get her positioned on the bed and show her how much fun a vibrator and anal beads can be in the right hands.\nShe's really getting into it, so I have her drop to her knees and blow me, which, not surprisingly, she's incredibly good at. As she gets into it I can tell she wants it rougher and pretty soon I'm face fucking her pretty aggressively and she loves it. In fact, after the shot she mentions that this was her favorite part of the entire session. She's so turned on that when I order her to get on the bed she puts her as sin the air, begging for my cock. Watch her face when I slide my dick in, the way she bites her lip and rolls her eyes is just amazing.\nRight about now in the shoot a couple of fairly unprecedented things all happen at once which make take this shoot from good to AWESOME. For example we discover that Hazel's pussy is not interested in shooting for much longer so this update is going to finish with my favorite thing: anal. Also the hotel manager calls and demands that I vacate the premises, so I'm going to have to skip the romance and pound Hazel's tight little ass into the bed. It doesn't hurt that once she gets into it and loses herself she's begging me to cum in her ass.\nWho am I to deprive a lady of a request? Some deep dicking and I blast off huge load in Hazel's ass. Aaaaaaaand it's time to start packing.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=1bewx69cptqs60fc268p.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=1bewx69cptqs60fc268p.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=vn16xml7p9cityc6pfv1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=vn16xml7p9cityc6pfv1.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f5aba5177e4536e8fc7ff1a74df02fa92974d621","amp;dn":"%5BExploitedCollegeGirls%5D+Hazel+From+Tarrant+County+College+%2807.12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5aba5177e4536e8fc7ff1a74df02fa92974d621","infoHashBuffer":{"type":"Buffer","data":[245,171,165,23,126,69,54,232,252,127,241,167,77,240,47,169,41,116,214,33]},"announce":[],"urlList":[]}}