{"title":"The Bradshaws Volumes 1 To 20","uid":8513767,"size":1135424906,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f69adad357035698f8d48a41b4df4ae1bff12071&amp;dn=The+Bradshaws+Volumes+1+To+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OBx2","files":-1,"time":1369654760,"description":"The Bradshaws is a fictional family created and voiced by the comedian and musician Buzz Hawkins. The family was created for The Gary Davies Show with Gary Davies on Piccadilly Radio in 1983 when Hawkins wrote a poem about a family's day trip to Blackpool. This soon developed into a series. In 1986, Hawkins was made producer of The Phil Wood Show, on which he performed more Bradshaws material.\n\nThe Bradshaws is set in a Cosy Terraced House with outside loo in the fictional Manchester suburb of Barnoldswick (any relation to the actual town of Barnoldswick, Lancashire, is apparent only in the name as the characters refer to Manchester as being their local town on many occasions) in the era of pounds, shillings and pence (probably sometime in the 1950s), there is almost always a brass band playing two or three streets away (Hawkins thought that some quiet brass band music in the background would help make the series feel warm and cosy). \nThe Bradshaws are a normal working-class family with little money, although they are able to afford a few luxuries (such as Alf's Woodbines).","torrent":{"xt":"urn:btih:f69adad357035698f8d48a41b4df4ae1bff12071","amp;dn":"The+Bradshaws+Volumes+1+To+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f69adad357035698f8d48a41b4df4ae1bff12071","infoHashBuffer":{"type":"Buffer","data":[246,154,218,211,87,3,86,152,248,212,138,65,180,223,74,225,191,241,32,113]},"announce":[],"urlList":[]}}