{"title":"Virginia City 1940 {Flynn, Scott, Bogart} (Western) [1940]","uid":7848429,"size":1595599098,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f712c9e98fb1853594b193b1859d7367529b081f&amp;dn=Virginia+City+1940+%7BFlynn%2C+Scott%2C+Bogart%7D+%28Western%29+%5B1940%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1353531200,"description":"Read This:  This movie is in dual language Spanish/English so you need a dual player as Spanish is the default language and English as the second one. \n\nAnd yes i know several programs exist to remove one of them.\n\nSamples are in Spanish since i just got quick clips\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0033226/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0033226/&lt;/a&gt;\n\nStoryline\n\nDuring the American Civil War, Captain Kerry Bradford escapes from a notorious confederate prison. He and two of his men are sent to Virginia City where Confederate sympathizers are prepared to donate $5 million dollars to the cause of Southern independence. The war is going badly for the Confederacy and money may tip the war in their favor. On the stagecoach to Virginia City, Bradford meets and falls in love with Julia Hayne not realizing that she is one of the conspirators. When he gets to Virginia City, he also runs into Confederate Captain Vance Irby who has been sent to collect and safely deliver the gold. Irby manages to get out of the city but the Union cavalry is in hot pursue. When Bradfoed catches up with them, he not only has to fight Irby but also John Murrell, a bandit who has his own plans for the gold.\n\nUser Review\n\nWhile not up to Errol Flynn's other great western, &quot;Dodge City,&quot; this movie is another in the long list of first-rate films that Flynn and director Michael Curtiz made together. The film has two main drawbacks: the severe miscasting of Humphrey Bogart as a Mexican bandit named Morrell (?!) and Miriam Hopkins as the Flynn/Scott love interest. Maybe she was being punished by Jack Warner for some transgression, or maybe she wanted to try to try something different, but Hopkins just isn't up to it. She plays her part of a saloon girl/spy like a grand dame, when the part calls for the sexy, comedic touch of an Ann Sheridan. Bogart's miscasting should be self-evident (you keep expecting to hear him turn to his gang of bandidos and say, &quot;Alright, you mugs . . .&quot;), and Randolph Scott is somewhat stiff (but still a better choice than Ronald Reagan, who was reportedly offered the part first). Other than that, though, the film has the usual Warner Bros. panache. The action scenes are first-rate, the cast--consisting of what came to be known as The Warner Bros. Stock Company--is top-notch, and the film has a zest and elan that characterizes the films that Flynn and Curtiz made together. A slam-bang western, and highly recommended.","torrent":{"xt":"urn:btih:f712c9e98fb1853594b193b1859d7367529b081f","amp;dn":"Virginia+City+1940+%7BFlynn%2C+Scott%2C+Bogart%7D+%28Western%29+%5B1940%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f712c9e98fb1853594b193b1859d7367529b081f","infoHashBuffer":{"type":"Buffer","data":[247,18,201,233,143,177,133,53,148,177,147,177,133,157,115,103,82,155,8,31]},"announce":[],"urlList":[]}}