{"title":"Hawtsome Adults Porn-Magazine-December 2012","uid":7919762,"size":52058905,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:f852d84965e84ba26548057ee0d1bb5aeab84eeb&amp;dn=Hawtsome+Adults+Porn-Magazine-December+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RAHMANAT1","files":1,"time":1355449882,"description":"ABOUT HAWTSOME MAGAZINE\nHAWTSOME Magazine has been around for nearly Three years now and counting. We started as just popular cover shots, as time progressed Hawtsome took on a life of its own. In 2009 Assurance Graphics team developed our first online publication of &quot;Hawtsome Magazine&quot; which mainly carried the Adult Content. Hawtsome Mag is a mixture of creativity and sexiness, along with bold and edgy work that is brilliantly edited and composed for the viewers and fans that have come to Know and love the works of the talented and dedicated professional.\nEditorial, Fashion and lifestyle can be found within these pages, articles and features ranging from relationships to economy. This is not your typical Men's mag or Eye candy mag. It is a publication comprised of works from various talents, well known and budding. We offer something more tangible and visually stimulating in the fact that you get to see the diversity of your favorite photographers, artists, muses and models in many different styles and various ways of creativity.\nOne of the main functions of our publication is to bring back what we felt was lost. The artistic and creative values. Not just flesh and sex. Which are major contributors to the sale of any magazine of this genre. Keeping the interest of our readers and fans devoted to us is paramount and so we continue to reopen avenues and doors that were once closed to photographers &amp; models who have the ability to become and do more with their skills and talents.\n&quot;Hawtsome means Hot and Handsome. In fact it is actually the brilliance or magnificence in things this is why you find our definition page in the mag before anything else&quot;","torrent":{"xt":"urn:btih:f852d84965e84ba26548057ee0d1bb5aeab84eeb","amp;dn":"Hawtsome+Adults+Porn-Magazine-December+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f852d84965e84ba26548057ee0d1bb5aeab84eeb","infoHashBuffer":{"type":"Buffer","data":[248,82,216,73,101,232,75,162,101,72,5,126,224,209,187,90,234,184,78,235]},"announce":[],"urlList":[]}}