{"title":"Trillian.5.Pro.for.Windows.v5.3.0.10.BETA-TE","uid":7941742,"size":26819479,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f8d31401b761d61f262ce8818aca2c2e434d89df&amp;dn=Trillian.5.Pro.for.Windows.v5.3.0.10.BETA-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"darksniper4887","files":3,"time":1355964965,"description":"Description:\n------------\nYour conversations come with you.\nStart a chat on your iPad at the breakfast table. Continue chatting on your phone as you take the train to work. Wrap things up when you sit down in front of your desktop. Trillian automatically keeps all of your devices synchronized throughout the day, ensuring you're always able to access conversation wherever you are.\n\nYou can chat with contacts on different networks.\nTrillian has great support for many different chat networks, including Facebook, Skype, Google, MSN, AIM, ICQ, XMPP, Yahoo!, and more. We're also working harder than ever before to adopt open standards and open communication and are committed to documenting Trillian's internal protocols.\n\nYour security and privacy are respected.\nIn an age of ever-decreasing privacy online, we think it's more and more important for companies to explain exactly how they use and protect your data. That's why we're taking a new approach with a transparent privacy policy that clearly outlines what Trillian is doing with your data and why.\n\nSocial networking support.\nTrillian is also great for social. Keep in touch with your social world on Twitter, Facebook, Foursquare and LinkedIn.\n \nMail integration.\nMail notifications on most IM networks combined with IMAP and POP3 support help you easily check mail and even mark items as spam.\n\n\nWhat's New:\n-----------\nMore fixes in Build 10 going out today. Enjoy the build!","torrent":{"xt":"urn:btih:f8d31401b761d61f262ce8818aca2c2e434d89df","amp;dn":"Trillian.5.Pro.for.Windows.v5.3.0.10.BETA-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8d31401b761d61f262ce8818aca2c2e434d89df","infoHashBuffer":{"type":"Buffer","data":[248,211,20,1,183,97,214,31,38,44,232,129,138,202,44,46,67,77,137,223]},"announce":[],"urlList":[]}}