{"title":"WarZ Emulator build Nov 30 2012","uid":7948776,"size":1745592323,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f91592442a9fc23e5fd16bb5409f586d400af0d4&amp;dn=WarZ+Emulator+build+Nov+30+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"velorond1","files":1,"time":1356201422,"description":" &lt;a href=&quot;http://warzemulator.com/forums/forum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://warzemulator.com/forums/forum.php&lt;/a&gt;\n\niNFO:                                                                                                                                                \nThe War Z is the world's first survival mmo Zombie Game. You may have played Zombie Games before - now it's time to live one. It's been five years since the outbreak; leaving in its wake a post-apocalyptic nightmare with ninety- five percent of the human population gone. In order to stay alive, you will need food, weapons, and other supplies. Some of you will be able to scavenge as you navigate the terrain, others will be forced to fight for survival as you encounter zombies and other players. Every decision will have an impact on whether you live or how quickly you die.\n\n                                         \nForget subscriptions, forget paid DLC and expansion packs.          \nThe War Z is as simple as this - once you install the game to your computer, you will be able to get into the game quickly and play without worrying about subscription fees, no hidden fees, and no paid updates. All updates will be seamlessly delivered to you free of charge when they're released. Add AAA graphics and effects mixed with the ability to run even on integrated video cards or low end laptops and you have a unique, fun, experience that is available to everyone. Choose one of the hundreds of servers to play on. Each Zombie Game world has an area of up to 400 square kilometers. As more worlds become available, just switch between them at any time, without losing your character's data, or paying any &quot;world transfer fees&quot;. Start playing in our first world &quot;Colorado&quot;, today, and prepare yourself to join other gameplay locations scattered around the world as we release more and more content.                                                                                                              \nCreate your own survival experience by selecting one of the available characters, customizing them and helping them to navigate through hostile world of The War Z. Gain experience and spend it to learn dozens of available skills in this Zombie Game. No classes and restrictions, no levels, or unrealistic stat modifications. Your goal is to survive this Zombie Game and the ones that survive longest will be victorious!                                                                                     \nAs you progress through this Zombie Game, exploring what happened, you will find notes and diaries that NPCs and other players left for you. These will have hints to the whereabouts of supplies and weapons you will need to survive The War Z is an open world Zombie Game; as you explore and immerse yourself in this post-apocalyptic world you'll discover more than you ever imagined.                                                                                   \n                                                                                                                                                            \nYou will find yourself hiding from zombies and other players; exploring hidden parts of the map and discovering hidden stashes throughout your journey.\n                                                                                                                                                                                                  \n READNFO:                                                                                                                   \nPlease note:                          \nYou can not play this game offline. It is an emulation of the official servers from the guys of http://emulatornexus.com accordingly a permanent functioning of the release is not guaranteed. For any support visit http://warzemulator.com/forums/                                                         \nSpecial thanks goes out to http://warzemulator.com/forums/forum.php                                                                                     \nNOTES:\n    \n1) unrar\n2) mount/burn the image\n3) install (it does not stuck at 93%, just give him time)\n4) copy the cracked content from the crack-dir to the install dir\n5) open your host.dat (C:WindowsSystem32Driversetc) with the editor and and add the following at the end: 76.115.137.4 api1.thewarinc.com then save\n6) start the game with the WarZlauncher.exe and register an account\n7) play tha game","torrent":{"xt":"urn:btih:f91592442a9fc23e5fd16bb5409f586d400af0d4","amp;dn":"WarZ+Emulator+build+Nov+30+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91592442a9fc23e5fd16bb5409f586d400af0d4","infoHashBuffer":{"type":"Buffer","data":[249,21,146,68,42,159,194,62,95,209,107,181,64,159,88,109,64,10,240,212]},"announce":[],"urlList":[]}}