{"title":"REVOLUTiON (2012) S01E09 (WEB-DL) 1080p ENg NLSubs","uid":7852864,"size":1821650586,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f9bd6e1e0bd2d7365d7a3c4cedbebfb8bbd43d08&amp;dn=REVOLUTiON+%282012%29+S01E09+%28WEB-DL%29+1080p+ENg+NLSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1353663840,"description":"REVOLUTiON (2012) S01E09 (WEB-DL) 1080p ENg NLSubs \n\n\nOnze totale levenswijze is afhankelijk van elektriciteit.\nWat zou er gebeuren als dit zou stoppen?\nOp een dag, alsof er een knop werd omgedraaid,\nkeert de wereld weer terug naar de middeleeuwen.\nVliegtuigen storten neer, ziekenhuizen sluiten en\nvele vormen van communicatie is niet meer mogelijk.\nAlles zonder moderne technologie en niemand weet waarom.\nNu, 15 jaar later, is het leven terug op het\nniveau van voor de industriele revolutie.\nFamilies leven in rustige dorpen,\nals de zon ondergaat worden er lantaarns en kaarsen aangestoken.\nHet leven is langzamer maar vredig. Of toch niet?\nBij een van de kleinere boerengehuchten ligt gevaar op de loer.\nEen jonge vrouw haar leven veranderd drastisch als\nhaar vader wordt omgebracht door de lokale burgerwacht.\nDie op mysterieuze wijze, en onbekend voor haar, iets te maken hadden met de black-out.\nDeze brute aanvaring zorgt ervoor dat zij met twee nogal\nongebruikelijke compagnons op een gedurfde reis gaat.\nOp zoek naar antwoorden over het verleden en om de toekomst te herveroveren.\n\n\n\nEnglish\n\nOur entire way of life depends on electricity. So what would happen if it just stopped working? Well, one day, like a switch turned off, the world is suddenly thrust back into the dark ages. Planes fall from the sky, hospitals shut down, and communication is impossible. And without any modern technology, who can tell us why? Now, 15 years later, life is back to what it once was long before the industrial revolution: families living in quiet cul-de-sacs, and when the sun goes down lanterns and candles are lit. Life is slower and sweeter. Or is it? On the fringes of small farming communities, danger lurks. And a young woman's life is dramatically changed when a local militia arrives and kills her father, who mysteriously - and unbeknownst to her - had something to do with the blackout. This brutal encounter sets her and two unlikely companions off on a daring coming-of-age journey to find answers about the past in the hopes of reclaiming the future. \n\n\n[img]http://i845.photobucket.com/albums/ab16/hortencia9/plaatjes%20film/marjan/extrainfoplain.png[/img]\n\nContainer....: MKV\nAudio........: DD5.1 English\nSubs.........: Custom NL (Instelbaar) (WinchesterGirl)\nSubs.........: English\nFormaat......: x264HD\nBron.........: TV (WEB-DL)\nGenre........: TV Series\n\nWebsite  \t:  \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2070791&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2070791&lt;/a&gt;","torrent":{"xt":"urn:btih:f9bd6e1e0bd2d7365d7a3c4cedbebfb8bbd43d08","amp;dn":"REVOLUTiON+%282012%29+S01E09+%28WEB-DL%29+1080p+ENg+NLSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9bd6e1e0bd2d7365d7a3c4cedbebfb8bbd43d08","infoHashBuffer":{"type":"Buffer","data":[249,189,110,30,11,210,215,54,93,122,60,76,237,190,191,184,187,212,61,8]},"announce":[],"urlList":[]}}