{"title":"The Observing Guide to the Messier Marathon","uid":7861358,"size":7996094,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc04557a2a6f3e61d16aa9cd559eb09cf88d9e4e&amp;dn=The+Observing+Guide+to+the+Messier+Marathon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1353940346,"description":" Don Machholz, &quot;The Observing Guide to the Messier Marathon: A Handbook and Atlas&quot;\nEnglish | ISBN: 0521803861 | 2002 | PDF | 172 pages | 7,63 mb\n\nhe Messier Catalogue is a list of one hundred and ten galaxies, star clusters and nebulae, and includes many of the brightest and best-known objects in the sky. Amateur astronomers who find all the objects on the list in one night have successfully completed the Messier Marathon. The Observing Guide to the Messier Marathon contains over 90 easy-to-use star maps to guide the observer from one object to the next, and provides tips for a successful night of observing. Don Machholz also tells the story of the eighteenth-century astronomer, Charles Messier, and how he came to compile his extensive catalogue. His complete guide to the Messier Marathon will help the amateur astronomer to observe the Messier Objects throughout the year, using a small telescope or even a pair of binoculars. Don Machholz is an engineer in Auburn, California. Interested in astronomy since childhood, he is a renowned comet hunter, having discovered nine comets that bear his name. He writes articles for local California newspapers and radio stations for special astronomical events. Between 1988 and 2000, Don Machholz was the Comets Recorder for the Association of Lunar and Planetary Recorder","torrent":{"xt":"urn:btih:fc04557a2a6f3e61d16aa9cd559eb09cf88d9e4e","amp;dn":"The+Observing+Guide+to+the+Messier+Marathon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc04557a2a6f3e61d16aa9cd559eb09cf88d9e4e","infoHashBuffer":{"type":"Buffer","data":[252,4,85,122,42,111,62,97,209,106,169,205,85,158,176,156,248,141,158,78]},"announce":[],"urlList":[]}}