{"title":"America's Best Dance Crew","uid":7848409,"size":29828208640,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fd6ca8f139af4b873a3b7bbc7e0edcf75055c06f&amp;dn=America%27s+Best+Dance+Crew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yura15cbx","files":-1,"time":1353530750,"description":"Randy Jackson Presents: America's Best Dance Crew, often abbreviated as ABDC, is an American competitive dance reality television series that features dance crews from the United States and around the world. It was produced by American Idol judge Randy Jackson and aired on MTV. The series was originally developed for NBC as World Moves. After seven seasons, ABDC was cancelled due to declining ratings.\nThe show was hosted by Mario Lopez, and featured television personality Layla Kayleigh as the backstage correspondent. The judging panel for the final seasons of the show included entertainers Lil Mama, JC Chasez, and Dominic &quot;D-Trix&quot; Sandoval. Former judges included hip-hop choreographer Shane Sparks and R&amp;B singer Omarion\n\nAmerica's Best Dance Crew is a reality show where dance crews showcase their talent, and compete for a $100,000 (USD) grand prize and the Golden ABDC Trophy (a golden statue of a B-Boy doing a freeze, with the legs moving like a bobblehead). Each week, the crews are given a challenge. The challenge is different for each crew, but has the same general concept or shares a specific theme. To begin each episode, Mario Lopez reveals, in no particular order, which crews are safe and which crews are at risk for elimination. After the crews in the bottom perform their routines, the judges decide which crew will advance to the next round.\nAnother unique aspect of ABDC is the crew banner. Each banner's logo represents its respective crew, appearing during interviews, performances, and on various merchandise. It is also used as a transition effect. When a crew is eliminated, their banner falls from the top of the stadium, where the banners of the crews still in the running stand. The contestants get to dance one final time on the stage as they &quot;walk it out&quot; to the song of the same name. If a crew is eliminated from the sixth place mark (fifth in Season 4, 5, and 7), the show will play a compilation video of their journey on ABDC.","torrent":{"xt":"urn:btih:fd6ca8f139af4b873a3b7bbc7e0edcf75055c06f","amp;dn":"America%27s+Best+Dance+Crew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6ca8f139af4b873a3b7bbc7e0edcf75055c06f","infoHashBuffer":{"type":"Buffer","data":[253,108,168,241,57,175,75,135,58,59,123,188,126,14,220,247,80,85,192,111]},"announce":[],"urlList":[]}}