{"title":"Captured! The Betty and Barney Hill UFO Experience The True Stor","uid":7929028,"size":3799585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe888a9fd3251cc90c6b6ccdd1b94c517babf7c7&amp;dn=Captured%21+The+Betty+and+Barney+Hill+UFO+Experience+The+True+Stor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"imarion","files":-1,"time":1355673638,"description":"Stanton T. Friedman, Kathleen Marden - Captured! The Betty and Barney Hill UFO Experience: The True Story of the World's First Documented Alien Abduction\nPublished: 2007-07-23 | ISBN: 1564149714 | PDF | 319 pages | 3 MB\n\n\nToday, 46 years after the UFO abduction of Betty and Barney Hill, more and more people are convinced that UFOs are real and their existence is being covered up by the government. If you have doubts or questions about the Hill case or alien experiences in general, Captured! will give you the answers you're searching for.\nThe 1961 abduction of the Hills stirred worldwide interest, primarily because of the book The Interrupted Journey, the subsequent media coverage, and a 1975 TV movie, The UFO Incident. The case is mentioned in almost all UFO abduction books. It also became a target for debunkers, who still attack it today.\nBut the complete story of what really happened that day, its effect on the participants, and the findings of investigators has never been told...until now.\nIn Captured! you'll get an insider's look at the alien abduction, previously unpublished information about the lives of the Hills before and after Barney's death in 1969, their status as celebrities, Betty's experiences as a UFO investigator, and other activities before her death in 2004.\nKathleen Marden, Betty Hill's niece, shares details from her discussions with Betty and from the evidence of the UFO abduction. She also looks at the Hills' riveting hypnosis sessions about their time onboard the spacecraft. The transcripts of these sessions provide insight into the character of the aliens, including their curiosity, their democratic discussions, and their desire to avoid inflicting pain.\nIn addition, co-author, physicist, and ufologist Stanton T. Friedman, the original civilian investigator of the Roswell Incident, reviews and refutes the arguments of those who have attacked the Hill case, including the star map Betty Hill saw inside the craft and later recreated. ","torrent":{"xt":"urn:btih:fe888a9fd3251cc90c6b6ccdd1b94c517babf7c7","amp;dn":"Captured%21+The+Betty+and+Barney+Hill+UFO+Experience+The+True+Stor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe888a9fd3251cc90c6b6ccdd1b94c517babf7c7","infoHashBuffer":{"type":"Buffer","data":[254,136,138,159,211,37,28,201,12,107,108,205,209,185,76,81,123,171,247,199]},"announce":[],"urlList":[]}}