{"title":"Muleskinner Jones - Postcard from Deadeye (2008)","uid":7967101,"size":35093872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:febc2bcbf28bc9e89d912f561371346604e1ffc2&amp;dn=Muleskinner+Jones+-+Postcard+from+Deadeye+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mr_Kurtz","files":-1,"time":1356711326,"description":"Muleskinner Jones - Postcard from Deadeye (2008) mp3\n\n\n5 track EP released 2008 on Red Meat Records\nA no-budget Spaghetti Western from a galaxy far, far away...\n\nDeadeye is a place you dont want to go. A burnt-out town in a long-forgotten parallel universe. Here men wear Stetsons, play videogames, drink cactus wine, ride coyotes and spit blood. The five songs on this EP are as close to Deadeye as you're going to want to get...\n\nBritish-born Muleskinner Jones is as much influenced by the experimental rock of The Fall, The Residents, Captain Beefheart and The Butthole Surfers as he is by traditional Country acts such as Hank Williams, Johnny Cash, Doc Boggs and the Harry Smith Anthologies. People get killed in these songs. Lots of them. And those that don't tend to get drunk and fall over.\n\nThis off-the-wall, visceral avant-country tends to divide critical opinion. Youll have to make up your own mind. With his blend of country twang, lolloping boogie and Beefheartian astringency Muleskinner Jones may be the British Johnny Dowd. [The Independent] Sci-fi B movies soundtracked by gonzo country. Recommended.\n\nThis 5-track EP from James Closs alter-ego Muleskinner Jones, Postcards From Deadeye is the follow up to his Alcohol Tobacco Raygun album.  It is set in a fictional town that you are advised never to visit. In reality the five songs that make up the cd are brutal murder ballads. Although undoubtedly Americana, Jones has no problem mentioning British towns in his songs. For instance, Walthamstow gets a mention in Twisted, Sick and Bitter. Its also part of Muleskinner Jones way of subverting the genre, a traditional love song, All The Good Times (Are Past And Gone) is on the EP but is now a murder ballad. \n\nMuleskinner Jones is undoubtedly an acquired taste, mainly because as an artist he is so difficult to pigeon-hole. The influences he cites are very wide ranging, from the likes of Hank Williams and Bob Wills to Giant Sand and Nick Cave along with Captain Beefheart, Johnny Dowd and Tom Waits, often within the same song! Not for the faint hearted.","torrent":{"xt":"urn:btih:febc2bcbf28bc9e89d912f561371346604e1ffc2","amp;dn":"Muleskinner+Jones+-+Postcard+from+Deadeye+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"febc2bcbf28bc9e89d912f561371346604e1ffc2","infoHashBuffer":{"type":"Buffer","data":[254,188,43,203,242,139,201,232,157,145,47,86,19,113,52,102,4,225,255,194]},"announce":[],"urlList":[]}}